[
  {
    "cardName": "The Fool",
    "number": 0,
    "arcana": "Major",
    "suit": "Keys",
    "cardDescription": "The Fool depicts a youthful figure carrying a bundle, standing on the edge of a cliff, with a small dog at his heels. The sun shines brightly, and mountains loom in the distance.",
    "meanings": [
      {
        "title": "Upright Meaning",
        "description": "In the upright position, The Fool symbolizes new beginnings, innocence, spontaneous actions, freedom, and originality.",
        "keywords": [
          "new beginnings",
          "innocence",
          "spontaneous actions",
          "freedom",
          "originality"
        ]
      },
      {
        "title": "Reversed Meaning",
        "description": "In the reversed position, The Fool can indicate naivety, foolishness, recklessness, and risk-taking without forethought.",
        "keywords": [
          "naivety",
          "foolishness",
          "recklessness",
          "risk-taking without forethought"
        ]
      }
    ],
    "imageFileName": "RWS_Tarot_00_Fool",
    "prominentSymbols": [
      {
        "symbol": "youthful figure",
        "meaning": "Represents a new journey, innocence, and being open to new experiences."
      },
      {
        "symbol": "cliff",
        "meaning": "Symbolizes a leap of faith, taking risks, and being on the edge of change."
      },
      {
        "symbol": "dog",
        "meaning": "Can signify loyalty, friendship, protection, and companionship."
      },
      {
        "symbol": "sun",
        "meaning": "Represents success, vitality, enlightenment, and clarity."
      },
      {
        "symbol": "mountains",
        "meaning": "Symbolize challenges, obstacles, and the need for perseverance and determination."
      }
    ],
    "prominentColors": [
      {
        "color": "yellow",
        "meaning": "Joy, happiness, intellect, energy."
      },
      {
        "color": "white",
        "meaning": "Purity, innocence, clarity, new beginnings."
      },
      {
        "color": "blue",
        "meaning": "Calmness, tranquility, communication, spirituality."
      },
      {
        "color": "green",
        "meaning": "Growth, fertility, abundance, harmony."
      }
    ]
  },
  {
    "cardName": "The Magician",
    "number": 1,
    "arcana": "Major",
    "suit": "Keys",
    "cardDescription": "The Magician is seen standing at a table with one hand pointed to the sky and the other pointing to the ground. Symbols of the four suits (Wands, Cups, Swords, Pentacles) are on the table, symbolizing the elements of natural power.",
    "meanings": [
      {
        "title": "Upright Meaning",
        "description": "In the upright position, The Magician represents manifestation, resourcefulness, power, and inspired action.",
        "keywords": [
          "manifestation",
          "resourcefulness",
          "power",
          "inspired action"
        ]
      },
      {
        "title": "Reversed Meaning",
        "description": "In the reversed position, The Magician can indicate manipulation, poor planning, and untapped talents.",
        "keywords": ["manipulation", "poor planning", "untapped talents"]
      }
    ],
    "imageFileName": "RWS_Tarot_01_Magician",
    "prominentSymbols": [
      {
        "symbol": "one hand pointing upwards",
        "meaning": "The hand pointing upwards symbolizes the connection between the spiritual and material worlds, as above, so below."
      },
      {
        "symbol": "one hand pointing downwards",
        "meaning": "The hand pointing downwards represents the power to manifest ideas and bring them into reality."
      },
      {
        "symbol": "four suits",
        "meaning": "The four suits represent the four elements (Wands - Fire, Cups - Water, Swords - Air, Pentacles - Earth) and the ability to harness natural power."
      },
      {
        "symbol": "infinity symbol",
        "meaning": "The infinity symbol above the Magician's head represents infinite potential and the interconnectedness of all things."
      }
    ],
    "prominentColors": [
      {
        "color": "red",
        "meaning": "Red symbolizes passion, energy, and the power to take action."
      },
      {
        "color": "white",
        "meaning": "White symbolizes purity of intention and the clarity of thought needed to manifest ideas."
      },
      {
        "color": "yellow",
        "meaning": "Yellow symbolizes the intellect and the creative mind at work."
      },
      {
        "color": "green",
        "meaning": "Green symbolizes growth, abundance, and the ability to manifest material wealth."
      }
    ]
  },
  {
    "cardName": "The High Priestess",
    "number": 2,
    "arcana": "Major",
    "suit": "Keys",
    "cardDescription": "The High Priestess is seated between two pillars, with a tapestry hanging between them, symbolizing the veil of awareness. She holds a Torah, representing divine knowledge.",
    "meanings": [
      {
        "title": "Upright Meaning",
        "description": "In the upright position, The High Priestess represents intuition, unconscious knowledge, mystery, and spirituality.",
        "keywords": [
          "intuition",
          "unconscious knowledge",
          "mystery",
          "spirituality"
        ]
      },
      {
        "title": "Reversed Meaning",
        "description": "In the reversed position, The High Priestess can indicate secrets, being disconnected from intuition, and withdrawal and silence.",
        "keywords": [
          "secrets",
          "disconnected from intuition",
          "withdrawal and silence"
        ]
      }
    ],
    "imageFileName": "RWS_Tarot_02_High_Priestess",
    "prominentSymbols": [
      {
        "symbol": "pillars",
        "meaning": "Pillars represent duality, such as light and dark, and the need to balance opposing forces."
      },
      {
        "symbol": "veil",
        "meaning": "The veil symbolizes hidden knowledge and the need to look beyond the obvious."
      },
      {
        "symbol": "Torah",
        "meaning": "The Torah signifies divine knowledge and the importance of seeking wisdom."
      },
      {
        "symbol": "moon crown",
        "meaning": "The moon crown represents the subconscious mind and the mysteries of the night."
      }
    ],
    "prominentColors": [
      {
        "color": "blue",
        "meaning": "Blue symbolizes intuition, depth, and the mysteries of the unknown."
      },
      {
        "color": "black",
        "meaning": "Black represents the hidden, the unconscious, and the mysteries that lie beyond."
      },
      {
        "color": "white",
        "meaning": "White symbolizes purity, truth, and the clarity of thought."
      },
      {
        "color": "yellow",
        "meaning": "Yellow represents enlightenment, optimism, and the light of wisdom."
      }
    ]
  },
  {
    "cardName": "The Empress",
    "number": 3,
    "arcana": "Major",
    "suit": "Keys",
    "cardDescription": "The Empress is depicted as a motherly figure sitting on a throne in a field of wheat, symbolizing fertility and abundance. She holds a scepter and wears a crown of stars.",
    "meanings": [
      {
        "title": "Upright Meaning",
        "description": "In the upright position, The Empress represents fertility, femininity, beauty, nature, and nurturing.",
        "keywords": ["fertility", "femininity", "beauty", "nature", "nurturing"]
      },
      {
        "title": "Reversed Meaning",
        "description": "In the reversed position, The Empress can indicate neglect, lack of growth, smothering care, and infertility.",
        "keywords": [
          "neglect",
          "lack of growth",
          "smothering care",
          "infertility"
        ]
      }
    ],
    "imageFileName": "RWS_Tarot_03_Empress",
    "prominentSymbols": [
      {
        "symbol": "throne",
        "meaning": "The throne symbolizes authority, power, and the ability to nurture and protect."
      },
      {
        "symbol": "wheat field",
        "meaning": "The wheat field represents fertility, abundance, and the cycles of nature."
      },
      {
        "symbol": "scepter",
        "meaning": "The scepter symbolizes authority, leadership, and the power to create and nurture."
      },
      {
        "symbol": "crown of stars",
        "meaning": "The crown of stars represents divine guidance, intuition, and the connection to higher realms."
      }
    ],
    "prominentColors": [
      {
        "color": "green",
        "meaning": "Green symbolizes growth, fertility, and the nurturing aspects of nature."
      },
      {
        "color": "yellow",
        "meaning": "Yellow symbolizes joy, optimism, and the creative energy of the sun."
      },
      {
        "color": "red",
        "meaning": "Red symbolizes passion, vitality, and the life force that sustains all living things."
      },
      {
        "color": "blue",
        "meaning": "Blue symbolizes intuition, depth, and the calming influence of water."
      }
    ]
  },
  {
    "cardName": "The Emperor",
    "number": 4,
    "arcana": "Major",
    "suit": "Keys",
    "cardDescription": "The Emperor sits on a throne adorned with rams' heads, symbolizing authority and power. He holds an orb and a scepter, representing the world and his control over it.",
    "meanings": [
      {
        "title": "Upright Meaning",
        "description": "In the upright position, The Emperor represents authority, structure, control, fatherhood, and leadership.",
        "keywords": [
          "authority",
          "structure",
          "control",
          "fatherhood",
          "leadership"
        ]
      },
      {
        "title": "Reversed Meaning",
        "description": "In the reversed position, The Emperor can indicate tyranny, rigidity, coldness, and overbearing power.",
        "keywords": ["tyranny", "rigidity", "coldness", "overbearing power"]
      }
    ],
    "imageFileName": "RWS_Tarot_04_Emperor",
    "prominentSymbols": [
      {
        "symbol": "throne",
        "meaning": "The throne symbolizes authority, power, and the establishment of order."
      },
      {
        "symbol": "rams' heads",
        "meaning": "The rams' heads represent determination, power, and the ability to overcome obstacles."
      },
      {
        "symbol": "orb",
        "meaning": "The orb symbolizes the world and the Emperor's control over his domain."
      },
      {
        "symbol": "scepter",
        "meaning": "The scepter symbolizes authority, leadership, and the Emperor's power to rule."
      }
    ],
    "prominentColors": [
      {
        "color": "red",
        "meaning": "Red symbolizes passion, power, and the Emperor's ability to take action."
      },
      {
        "color": "yellow",
        "meaning": "Yellow symbolizes intellect, clarity, and the Emperor's wisdom in decision-making."
      },
      {
        "color": "blue",
        "meaning": "Blue symbolizes stability, trustworthiness, and the Emperor's commitment to order."
      },
      {
        "color": "white",
        "meaning": "White symbolizes purity, authority, and the Emperor's impartiality in judgment."
      }
    ]
  },
  {
    "cardName": "The Hierophant",
    "number": 5,
    "arcana": "Major",
    "suit": "Keys",
    "cardDescription": "The Hierophant is depicted as a religious figure sitting between two pillars, similar to The High Priestess. He wears a papal crown and holds a scepter.",
    "meanings": [
      {
        "title": "Upright Meaning",
        "description": "In the upright position, The Hierophant represents tradition, conformity, morality, and religious beliefs.",
        "keywords": ["tradition", "conformity", "morality", "religious beliefs"]
      },
      {
        "title": "Reversed Meaning",
        "description": "In the reversed position, The Hierophant can indicate rebellion, subversiveness, new approaches, and unconventional thinking.",
        "keywords": [
          "rebellion",
          "subversiveness",
          "new approaches",
          "unconventional"
        ]
      }
    ],
    "imageFileName": "RWS_Tarot_05_Hierophant",
    "prominentSymbols": [
      {
        "symbol": "pillars",
        "meaning": "The pillars symbolize duality, balance, and the gateway between the physical and spiritual worlds."
      },
      {
        "symbol": "papal crown",
        "meaning": "The papal crown symbolizes authority, leadership, and divine connection."
      },
      {
        "symbol": "scepter",
        "meaning": "The scepter symbolizes power, authority, and the Hierophant's role as a spiritual leader."
      },
      {
        "symbol": "cross",
        "meaning": "The cross symbolizes faith, sacrifice, and spiritual teachings."
      }
    ],
    "prominentColors": [
      {
        "color": "red",
        "meaning": "Red symbolizes passion, power, and the Hierophant's dedication to his beliefs."
      },
      {
        "color": "blue",
        "meaning": "Blue symbolizes wisdom, truth, and the Hierophant's connection to the divine."
      },
      {
        "color": "yellow",
        "meaning": "Yellow symbolizes enlightenment, clarity, and the Hierophant's spiritual guidance."
      },
      {
        "color": "white",
        "meaning": "White symbolizes purity, holiness, and the Hierophant's commitment to righteousness."
      }
    ]
  },
  {
    "cardName": "The Lovers",
    "number": 6,
    "arcana": "Major",
    "suit": "Keys",
    "cardDescription": "The Lovers card shows a man and a woman in a garden, with an angel blessing them from above. The card symbolizes harmony, relationships, and choices.",
    "meanings": [
      {
        "title": "Upright Meaning",
        "description": "In the upright position, The Lovers card represents love, harmony, relationships, values alignment, and choices.",
        "keywords": [
          "love",
          "harmony",
          "relationships",
          "values alignment",
          "choices"
        ]
      },
      {
        "title": "Reversed Meaning",
        "description": "In the reversed position, The Lovers card can indicate disharmony, imbalance, misalignment of values, and difficult choices.",
        "keywords": [
          "disharmony",
          "imbalance",
          "misalignment of values",
          "difficult choices"
        ]
      }
    ],
    "imageFileName": "RWS_Tarot_06_Lovers",
    "prominentSymbols": [
      {
        "symbol": "man",
        "meaning": "The man symbolizes masculinity, logic, and the conscious mind."
      },
      {
        "symbol": "woman",
        "meaning": "The woman symbolizes femininity, intuition, and the subconscious mind."
      },
      {
        "symbol": "angel",
        "meaning": "The angel symbolizes divine guidance, blessings, and spiritual connection."
      },
      {
        "symbol": "tree",
        "meaning": "The tree symbolizes growth, life, and the natural world."
      },
      {
        "symbol": "serpent",
        "meaning": "The serpent symbolizes temptation, transformation, and the cycle of life and death."
      }
    ],
    "prominentColors": [
      {
        "color": "green",
        "meaning": "Green symbolizes nature, fertility, and growth, reflecting the harmony and balance of The Lovers."
      },
      {
        "color": "red",
        "meaning": "Red symbolizes passion, desire, and love, highlighting the emotional connection between the man and woman."
      },
      {
        "color": "blue",
        "meaning": "Blue symbolizes communication, wisdom, and truth, suggesting the importance of honest and open dialogue in relationships."
      },
      {
        "color": "yellow",
        "meaning": "Yellow symbolizes positivity, joy, and enlightenment, representing the blessings and divine guidance of the angel."
      }
    ]
  },
  {
    "cardName": "The Chariot",
    "number": 7,
    "arcana": "Major",
    "suit": "Keys",
    "cardDescription": "The Chariot depicts a warrior riding a chariot, pulled by two sphinxes of opposite colors. The card represents control, willpower, and victory.",
    "meanings": [
      {
        "title": "Upright Meaning",
        "description": "In the upright position, The Chariot represents control, willpower, success, action, and determination.",
        "keywords": [
          "control",
          "willpower",
          "success",
          "action",
          "determination"
        ]
      },
      {
        "title": "Reversed Meaning",
        "description": "In the reversed position, The Chariot can indicate lack of control, lack of direction, aggression, and failure.",
        "keywords": [
          "lack of control",
          "lack of direction",
          "aggression",
          "failure"
        ]
      }
    ],
    "imageFileName": "RWS_Tarot_07_Chariot",
    "prominentSymbols": [
      {
        "symbol": "chariot",
        "meaning": "The chariot symbolizes travel, progression, and control over one's path."
      },
      {
        "symbol": "sphinxes",
        "meaning": "The sphinxes represent opposing forces or aspects of the self, requiring balance and control."
      },
      {
        "symbol": "armor",
        "meaning": "The armor symbolizes protection, strength, and preparedness for battle."
      },
      {
        "symbol": "city",
        "meaning": "The city in the background symbolizes civilization, progress, and the destination of the chariot's journey."
      }
    ],
    "prominentColors": [
      {
        "color": "yellow",
        "meaning": "Yellow symbolizes energy, vitality, and confidence, reflecting the dynamic nature of The Chariot."
      },
      {
        "color": "blue",
        "meaning": "Blue symbolizes stability, control, and communication, emphasizing the need for clear direction and purpose."
      },
      {
        "color": "black",
        "meaning": "Black symbolizes mystery, the unknown, and hidden forces, suggesting challenges or obstacles to overcome."
      },
      {
        "color": "white",
        "meaning": "White symbolizes purity, clarity, and spiritual enlightenment, indicating the spiritual guidance and purity of intention needed for victory."
      }
    ]
  },
  {
    "cardName": "Strength",
    "number": 8,
    "arcana": "Major",
    "suit": "Keys",
    "cardDescription": "Strength shows a woman gently closing the jaws of a lion. The card symbolizes inner strength, courage, and compassion.",
    "meanings": [
      {
        "title": "Upright Meaning",
        "description": "In the upright position, Strength represents strength, courage, patience, control, and compassion.",
        "keywords": ["strength", "courage", "patience", "control", "compassion"]
      },
      {
        "title": "Reversed Meaning",
        "description": "In the reversed position, Strength can indicate weakness, self-doubt, lack of self-discipline, and cowardice.",
        "keywords": [
          "weakness",
          "self-doubt",
          "lack of self-discipline",
          "cowardice"
        ]
      }
    ],
    "imageFileName": "RWS_Tarot_08_Strength",
    "prominentSymbols": [
      {
        "symbol": "woman",
        "meaning": "The woman symbolizes inner strength, nurturing, and feminine power."
      },
      {
        "symbol": "lion",
        "meaning": "The lion represents courage, strength, and the raw, primal aspects of the self."
      },
      {
        "symbol": "lemniscate",
        "meaning": "The lemniscate, or infinity symbol, signifies infinite strength, balance, and harmony."
      },
      {
        "symbol": "mountains",
        "meaning": "The mountains in the background represent obstacles, challenges, and the need for perseverance."
      }
    ],
    "prominentColors": [
      {
        "color": "yellow",
        "meaning": "Yellow symbolizes energy, joy, and optimism, reflecting the inner strength and courage of the woman."
      },
      {
        "color": "green",
        "meaning": "Green symbolizes growth, healing, and renewal, suggesting the compassionate and nurturing nature of strength."
      },
      {
        "color": "red",
        "meaning": "Red symbolizes passion, courage, and vitality, highlighting the fierce determination and courage needed to face challenges."
      },
      {
        "color": "blue",
        "meaning": "Blue symbolizes peace, tranquility, and clarity, indicating the calm control and patience required to manage difficult situations."
      }
    ]
  },
  {
    "cardName": "The Hermit",
    "number": 9,
    "arcana": "Major",
    "suit": "Keys",
    "cardDescription": "The Hermit stands alone on a mountain peak, holding a lantern and a staff. The card represents introspection, solitude, and guidance.",
    "meanings": [
      {
        "title": "Upright Meaning",
        "description": "In the upright position, The Hermit represents introspection, solitude, guidance, contemplation, and inner wisdom.",
        "keywords": [
          "introspection",
          "solitude",
          "guidance",
          "contemplation",
          "inner wisdom"
        ]
      },
      {
        "title": "Reversed Meaning",
        "description": "In the reversed position, The Hermit can indicate loneliness, isolation, feeling lost, withdrawal, and paranoia.",
        "keywords": [
          "loneliness",
          "isolation",
          "lost",
          "withdrawal",
          "paranoia"
        ]
      }
    ],
    "imageFileName": "RWS_Tarot_09_Hermit",
    "prominentSymbols": [
      {
        "symbol": "mountain",
        "meaning": "The mountain symbolizes challenges, obstacles, and the journey to enlightenment."
      },
      {
        "symbol": "lantern",
        "meaning": "The lantern represents inner guidance, wisdom, and the search for truth in the darkness."
      },
      {
        "symbol": "staff",
        "meaning": "The staff symbolizes authority, wisdom, and the journey of self-discovery."
      },
      {
        "symbol": "cloak",
        "meaning": "The cloak symbolizes protection, concealment, and the need for introspection and solitude."
      }
    ],
    "prominentColors": [
      {
        "color": "gray",
        "meaning": "Gray symbolizes neutrality, wisdom, and balance, reflecting the introspective nature of The Hermit's journey."
      },
      {
        "color": "yellow",
        "meaning": "Yellow symbolizes enlightenment, joy, and clarity, representing the inner wisdom and guidance The Hermit seeks."
      },
      {
        "color": "blue",
        "meaning": "Blue symbolizes peace, tranquility, and intuition, suggesting the calm contemplation and guidance provided by The Hermit."
      },
      {
        "color": "white",
        "meaning": "White symbolizes purity, clarity, and spiritual enlightenment, indicating the spiritual guidance and truth The Hermit seeks."
      }
    ]
  },
  {
    "cardName": "The Wheel of Fortune",
    "number": 10,
    "arcana": "Major",
    "suit": "Keys",
    "cardDescription": "The Wheel of Fortune features a large wheel surrounded by various creatures and symbols. It represents cycles, change, and the ups and downs of life.",
    "meanings": [
      {
        "title": "Upright Meaning",
        "description": "In the upright position, The Wheel of Fortune represents good luck, karma, life cycles, destiny, and a turning point.",
        "keywords": [
          "good luck",
          "karma",
          "life cycles",
          "destiny",
          "turning point"
        ]
      },
      {
        "title": "Reversed Meaning",
        "description": "In the reversed position, The Wheel of Fortune can indicate bad luck, resistance to change, breaking cycles, and unforeseen events.",
        "keywords": [
          "bad luck",
          "resistance to change",
          "breaking cycles",
          "unforeseen events"
        ]
      }
    ],
    "imageFileName": "RWS_Tarot_10_Wheel_of_Fortune",
    "prominentSymbols": [
      {
        "symbol": "wheel",
        "meaning": "The wheel symbolizes the cycles of life, fate, and the interconnectedness of all things."
      },
      {
        "symbol": "creatures",
        "meaning": "The creatures symbolize the four fixed signs of the zodiac and the continuous cycle of change and evolution."
      },
      {
        "symbol": "symbols",
        "meaning": "The symbols represent the ever-changing nature of life and the lessons to be learned from each cycle."
      },
      {
        "symbol": "clouds",
        "meaning": "The clouds symbolize uncertainty and the unpredictable nature of fate and destiny."
      }
    ],
    "prominentColors": [
      {
        "color": "blue",
        "meaning": "Blue symbolizes stability, trust, and calmness, suggesting the need to trust in the natural cycles of life."
      },
      {
        "color": "yellow",
        "meaning": "Yellow symbolizes positivity, energy, and optimism, indicating a turning point or change for the better."
      },
      {
        "color": "red",
        "meaning": "Red symbolizes passion, action, and vitality, suggesting a period of transformation and change."
      },
      {
        "color": "green",
        "meaning": "Green symbolizes growth, renewal, and balance, indicating a time of positive change and new opportunities."
      }
    ]
  },
  {
    "cardName": "Justice",
    "number": 11,
    "arcana": "Major",
    "suit": "Keys",
    "cardDescription": "Justice depicts a figure seated on a throne, holding a sword in one hand and scales in the other. It symbolizes fairness, truth, and the law.",
    "meanings": [
      {
        "title": "Upright Meaning",
        "description": "In the upright position, Justice represents justice, fairness, truth, cause and effect, and the law.",
        "keywords": ["justice", "fairness", "truth", "cause and effect", "law"]
      },
      {
        "title": "Reversed Meaning",
        "description": "In the reversed position, Justice can indicate unfairness, lack of accountability, dishonesty, and injustice.",
        "keywords": [
          "unfairness",
          "lack of accountability",
          "dishonesty",
          "injustice"
        ]
      }
    ],
    "imageFileName": "RWS_Tarot_11_Justice",
    "prominentSymbols": [
      {
        "symbol": "scales",
        "meaning": "The scales symbolize balance, fairness, and the weighing of decisions."
      },
      {
        "symbol": "sword",
        "meaning": "The sword symbolizes truth, justice, and the power of reason and intellect."
      },
      {
        "symbol": "throne",
        "meaning": "The throne symbolizes authority, power, and the seat of judgment."
      },
      {
        "symbol": "pillar",
        "meaning": "The pillar symbolizes stability, strength, and the support of justice and truth."
      }
    ],
    "prominentColors": [
      {
        "color": "red",
        "meaning": "Red symbolizes passion, action, and justice, suggesting the need for action and fairness."
      },
      {
        "color": "blue",
        "meaning": "Blue symbolizes truth, clarity, and justice, indicating a need for honesty and integrity."
      },
      {
        "color": "yellow",
        "meaning": "Yellow symbolizes clarity, wisdom, and intellect, suggesting the need for rational judgment."
      },
      {
        "color": "white",
        "meaning": "White symbolizes purity, truth, and fairness, indicating a need for impartiality and objectivity."
      }
    ]
  },
  {
    "cardName": "The Hanged Man",
    "number": 12,
    "arcana": "Major",
    "suit": "Keys",
    "cardDescription": "The Hanged Man is depicted hanging upside-down by one foot from a tree. It represents sacrifice, new perspectives, and surrender.",
    "meanings": [
      {
        "title": "Upright Meaning",
        "description": "In the upright position, The Hanged Man represents a pause, surrender, letting go, and new perspectives.",
        "keywords": ["pause", "surrender", "letting go", "new perspectives"]
      },
      {
        "title": "Reversed Meaning",
        "description": "In the reversed position, The Hanged Man can indicate delays, resistance, stalling, and indecision.",
        "keywords": ["delays", "resistance", "stalling", "indecision"]
      }
    ],
    "imageFileName": "RWS_Tarot_12_Hanged_Man",
    "prominentSymbols": [
      {
        "symbol": "tree",
        "meaning": "The tree symbolizes life, growth, and connection to the earth, suggesting the need to look at things from a different perspective."
      },
      {
        "symbol": "halo",
        "meaning": "The halo symbolizes enlightenment, spiritual awakening, and divine guidance, indicating a need to surrender to a higher power or wisdom."
      },
      {
        "symbol": "bound foot",
        "meaning": "The bound foot symbolizes sacrifice, restriction, and surrender, suggesting the need to let go of control and accept a new way of thinking."
      },
      {
        "symbol": "serenity",
        "meaning": "The serenity of the figure's expression symbolizes peace, acceptance, and tranquility, indicating the benefits of surrender and acceptance."
      }
    ],
    "prominentColors": [
      {
        "color": "blue",
        "meaning": "Blue symbolizes calmness, introspection, and intuition, suggesting the need to reflect on one's situation and find inner peace."
      },
      {
        "color": "green",
        "meaning": "Green symbolizes growth, renewal, and harmony with nature, indicating the need for a fresh perspective and new beginnings."
      },
      {
        "color": "yellow",
        "meaning": "Yellow symbolizes enlightenment, positivity, and clarity, suggesting the need to see things from a different angle and embrace change."
      },
      {
        "color": "red",
        "meaning": "Red symbolizes passion, action, and courage, indicating the need to take bold steps and face challenges with determination."
      }
    ]
  },
  {
    "cardName": "Death",
    "number": 13,
    "arcana": "Major",
    "suit": "Keys",
    "cardDescription": "Death depicts a skeleton riding a white horse, with people of different social statuses lying in its path. It symbolizes endings, transformation, and renewal.",
    "meanings": [
      {
        "title": "Upright Meaning",
        "description": "In the upright position, Death represents endings, change, transformation, and transition.",
        "keywords": ["endings", "change", "transformation", "transition"]
      },
      {
        "title": "Reversed Meaning",
        "description": "In the reversed position, Death can indicate resistance to change, personal transformation, and inner purging.",
        "keywords": [
          "resistance to change",
          "personal transformation",
          "inner purging"
        ]
      }
    ],
    "imageFileName": "RWS_Tarot_13_Death",
    "prominentSymbols": [
      {
        "symbol": "skeleton",
        "meaning": "The skeleton symbolizes the end of life, mortality, and the impermanence of existence, suggesting the need to accept endings and embrace change."
      },
      {
        "symbol": "white horse",
        "meaning": "The white horse symbolizes purity, spirit, and the journey of the soul, indicating a transition to a new phase of life or a spiritual transformation."
      },
      {
        "symbol": "fallen figures",
        "meaning": "The fallen figures represent people from different social statuses, symbolizing the universal nature of death and the leveling of all individuals in its path."
      },
      {
        "symbol": "rising sun",
        "meaning": "The rising sun symbolizes new beginnings, hope, and the promise of a new day, suggesting that death is not the end but a new beginning."
      }
    ],
    "prominentColors": [
      {
        "color": "black",
        "meaning": "Black symbolizes death, mourning, and the unknown, suggesting the need to confront fears and embrace the mysteries of life."
      },
      {
        "color": "white",
        "meaning": "White symbolizes purity, innocence, and spiritual awakening, indicating a transformation or purification process."
      },
      {
        "color": "yellow",
        "meaning": "Yellow symbolizes enlightenment, clarity, and optimism, suggesting that death brings understanding and a new perspective."
      },
      {
        "color": "blue",
        "meaning": "Blue symbolizes tranquility, peace, and acceptance, indicating the need to find peace with the natural cycle of life and death."
      }
    ]
  },
  {
    "cardName": "Temperance",
    "number": 14,
    "arcana": "Major",
    "suit": "Keys",
    "cardDescription": "Temperance depicts an angelic figure pouring water between two cups, symbolizing balance, moderation, and harmony.",
    "meanings": [
      {
        "title": "Upright Meaning",
        "description": "In the upright position, Temperance represents balance, moderation, patience, purpose, and meaning.",
        "keywords": ["balance", "moderation", "patience", "purpose", "meaning"]
      },
      {
        "title": "Reversed Meaning",
        "description": "In the reversed position, Temperance can indicate imbalance, excess, self-healing, and re-alignment.",
        "keywords": ["imbalance", "excess", "self-healing", "re-alignment"]
      }
    ],
    "imageFileName": "RWS_Tarot_14_Temperance",
    "prominentSymbols": [
      {
        "symbol": "angel",
        "meaning": "The angel symbolizes divine intervention, guidance, and spiritual connection, suggesting the need to find a higher purpose or spiritual path."
      },
      {
        "symbol": "water",
        "meaning": "Water symbolizes emotions, intuition, and the subconscious mind, indicating the need to balance and harmonize emotions."
      },
      {
        "symbol": "cups",
        "meaning": "The cups symbolize emotions, relationships, and the heart, suggesting the need to find harmony and balance in relationships."
      },
      {
        "symbol": "path",
        "meaning": "The path symbolizes the journey of life, indicating the need to find balance and moderation on life's path."
      },
      {
        "symbol": "mountains",
        "meaning": "Mountains symbolize challenges, obstacles, and the need for perseverance, suggesting the need to overcome challenges with patience and moderation."
      }
    ],
    "prominentColors": [
      {
        "color": "blue",
        "meaning": "Blue symbolizes tranquility, peace, and calmness, suggesting the need to find inner peace and balance."
      },
      {
        "color": "yellow",
        "meaning": "Yellow symbolizes joy, happiness, and positivity, indicating the need to approach life with optimism and enthusiasm."
      },
      {
        "color": "red",
        "meaning": "Red symbolizes passion, energy, and action, suggesting the need to take decisive action with moderation and balance."
      },
      {
        "color": "white",
        "meaning": "White symbolizes purity, clarity, and spiritual awakening, indicating the need to find spiritual balance and harmony."
      }
    ]
  },
  {
    "cardName": "The Devil",
    "number": 15,
    "arcana": "Major",
    "suit": "Keys",
    "cardDescription": "The Devil shows a horned figure with two chained figures beneath him. It represents bondage, materialism, and the shadow self.",
    "meanings": [
      {
        "title": "Upright Meaning",
        "description": "In the upright position, The Devil represents bondage, addiction, sexuality, and materialism.",
        "keywords": ["bondage", "addiction", "sexuality", "materialism"]
      },
      {
        "title": "Reversed Meaning",
        "description": "In the reversed position, The Devil can indicate release, freedom, reclaiming power, and breaking chains.",
        "keywords": [
          "release",
          "freedom",
          "reclaiming power",
          "breaking chains"
        ]
      }
    ],
    "imageFileName": "RWS_Tarot_15_Devil",
    "prominentSymbols": [
      {
        "symbol": "horned figure",
        "meaning": "The horned figure symbolizes temptation, desire, and the shadow self, suggesting the need to confront and overcome inner demons."
      },
      {
        "symbol": "chains",
        "meaning": "The chains symbolize bondage and restriction, indicating the need to break free from limiting beliefs or situations."
      },
      {
        "symbol": "flames",
        "meaning": "The flames symbolize passion, desire, and transformation, suggesting the need to channel desires in a positive direction."
      },
      {
        "symbol": "nude figures",
        "meaning": "The nude figures symbolize vulnerability and exposure, indicating the need to confront fears and insecurities."
      }
    ],
    "prominentColors": [
      {
        "color": "black",
        "meaning": "Black symbolizes darkness, mystery, and the unknown, suggesting the need to explore hidden aspects of the self."
      },
      {
        "color": "red",
        "meaning": "Red symbolizes passion, desire, and intensity, indicating the need to harness and control powerful emotions."
      },
      {
        "color": "gray",
        "meaning": "Gray symbolizes neutrality and balance, suggesting the need to find a balance between extremes."
      },
      {
        "color": "yellow",
        "meaning": "Yellow symbolizes clarity, intellect, and illumination, indicating the need to shed light on dark or hidden aspects of the self."
      }
    ]
  },
  {
    "cardName": "The Tower",
    "number": 16,
    "arcana": "Major",
    "suit": "Keys",
    "cardDescription": "The Tower depicts a tall tower struck by lightning, with figures falling from it. It symbolizes sudden change, upheaval, and revelation.",
    "meanings": [
      {
        "title": "Upright Meaning",
        "description": "In the upright position, The Tower represents sudden change, upheaval, chaos, revelation, and awakening.",
        "keywords": [
          "sudden change",
          "upheaval",
          "chaos",
          "revelation",
          "awakening"
        ]
      },
      {
        "title": "Reversed Meaning",
        "description": "In the reversed position, The Tower can indicate personal transformation, fear of change, and averting disaster.",
        "keywords": [
          "personal transformation",
          "fear of change",
          "averting disaster"
        ]
      }
    ],
    "imageFileName": "RWS_Tarot_16_Tower",
    "prominentSymbols": [
      {
        "symbol": "tower",
        "meaning": "The tower symbolizes a structure built on false beliefs or shaky foundations, suggesting the need to rebuild and start anew."
      },
      {
        "symbol": "lightning",
        "meaning": "Lightning symbolizes a sudden and unexpected event or realization, indicating the need to embrace change and let go of the past."
      },
      {
        "symbol": "falling figures",
        "meaning": "The falling figures symbolize destruction and chaos, suggesting the need to surrender to forces beyond control."
      },
      {
        "symbol": "fire",
        "meaning": "Fire symbolizes destruction and purification, indicating the need to let go of what no longer serves for new growth to occur."
      }
    ],
    "prominentColors": [
      {
        "color": "red",
        "meaning": "Red symbolizes passion, intensity, and upheaval, suggesting the need to channel energy into positive transformation."
      },
      {
        "color": "yellow",
        "meaning": "Yellow symbolizes illumination and insight, indicating the need to embrace change and seek higher understanding."
      },
      {
        "color": "gray",
        "meaning": "Gray symbolizes neutrality and detachment, suggesting the need to step back and reassess the situation."
      },
      {
        "color": "blue",
        "meaning": "Blue symbolizes clarity and calmness, indicating the need to stay grounded and focused during times of upheaval."
      }
    ]
  },
  {
    "cardName": "The Star",
    "number": 17,
    "arcana": "Major",
    "suit": "Keys",
    "cardDescription": "The Star shows a naked woman pouring water into a pool and onto the land, with stars shining above. It represents hope, inspiration, and serenity.",
    "meanings": [
      {
        "title": "Upright Meaning",
        "description": "In the upright position, The Star represents hope, faith, inspiration, spirituality, and renewal.",
        "keywords": ["hope", "faith", "inspiration", "spirituality", "renewal"]
      },
      {
        "title": "Reversed Meaning",
        "description": "In the reversed position, The Star can indicate lack of faith, despair, self-trust, and disconnection.",
        "keywords": ["lack of faith", "despair", "self-trust", "disconnection"]
      }
    ],
    "imageFileName": "RWS_Tarot_17_Star",
    "prominentSymbols": [
      {
        "symbol": "naked woman",
        "meaning": "The naked woman symbolizes vulnerability and openness, suggesting the need to be authentic and true to oneself."
      },
      {
        "symbol": "stars",
        "meaning": "Stars symbolize hope and guidance, indicating the need to trust in a higher purpose or divine plan."
      },
      {
        "symbol": "water",
        "meaning": "Water symbolizes emotions and intuition, suggesting the need to listen to one's inner voice and follow one's heart."
      },
      {
        "symbol": "bird",
        "meaning": "The bird symbolizes freedom and transcendence, indicating the need to rise above challenges and limitations."
      }
    ],
    "prominentColors": [
      {
        "color": "blue",
        "meaning": "Blue symbolizes peace and tranquility, suggesting the need to find inner calm and clarity."
      },
      {
        "color": "yellow",
        "meaning": "Yellow symbolizes optimism and joy, indicating the need to stay positive and hopeful."
      },
      {
        "color": "green",
        "meaning": "Green symbolizes growth and healing, suggesting the need to nurture oneself and others."
      },
      {
        "color": "white",
        "meaning": "White symbolizes purity and clarity, indicating the need to let go of negativity and embrace purity of spirit."
      }
    ]
  },
  {
    "cardName": "The Moon",
    "number": 18,
    "arcana": "Major",
    "suit": "Keys",
    "cardDescription": "The Moon features a night scene with a full moon, two towers, a wolf, a dog howling, and a crayfish emerging from water. It symbolizes intuition, fear, and the subconscious.",
    "meanings": [
      {
        "title": "Upright Meaning",
        "description": "In the upright position, The Moon represents illusion, fear, anxiety, the subconscious, and intuition.",
        "keywords": ["illusion", "fear", "anxiety", "subconscious", "intuition"]
      },
      {
        "title": "Reversed Meaning",
        "description": "In the reversed position, The Moon can indicate the release of fear, repressed emotion, inner clarity, and facing fears.",
        "keywords": [
          "release of fear",
          "repressed emotion",
          "inner clarity",
          "facing fears"
        ]
      }
    ],
    "imageFileName": "RWS_Tarot_18_Moon",
    "prominentSymbols": [
      {
        "symbol": "moon",
        "meaning": "The moon symbolizes the subconscious mind, emotions, and cycles, suggesting the need to trust in the unknown and navigate through uncertainty."
      },
      {
        "symbol": "wolf",
        "meaning": "The wolf symbolizes instinct, intuition, and the wild, indicating the need to listen to one's inner voice and primal instincts."
      },
      {
        "symbol": "dog",
        "meaning": "The dog symbolizes loyalty and companionship, suggesting the need for emotional support and guidance."
      },
      {
        "symbol": "crayfish",
        "meaning": "The crayfish symbolizes regeneration and renewal, indicating the need to let go of the past and embrace new beginnings."
      },
      {
        "symbol": "towers",
        "meaning": "The towers symbolize illusion and deception, suggesting the need to look beyond surface appearances and uncover hidden truths."
      }
    ],
    "prominentColors": [
      {
        "color": "blue",
        "meaning": "Blue symbolizes intuition and inner knowing, suggesting the need to trust in one's instincts and follow one's inner guidance."
      },
      {
        "color": "yellow",
        "meaning": "Yellow symbolizes illumination and clarity, indicating the need to shine light on the subconscious and uncover hidden fears."
      },
      {
        "color": "black",
        "meaning": "Black symbolizes the unknown and the subconscious mind, suggesting the need to explore the depths of one's psyche and confront fears."
      },
      {
        "color": "white",
        "meaning": "White symbolizes purity and spiritual growth, indicating the need to find clarity and peace within oneself."
      }
    ]
  },
  {
    "cardName": "The Sun",
    "number": 19,
    "arcana": "Major",
    "suit": "Keys",
    "cardDescription": "The Sun shows a joyful child riding a white horse under the bright sun, surrounded by sunflowers. It represents success, vitality, and joy.",
    "meanings": [
      {
        "title": "Upright Meaning",
        "description": "In the upright position, The Sun represents positivity, fun, warmth, success, and vitality.",
        "keywords": ["positivity", "fun", "warmth", "success", "vitality"]
      },
      {
        "title": "Reversed Meaning",
        "description": "In the reversed position, The Sun can indicate negativity, depression, sadness, and lack of clarity.",
        "keywords": ["negativity", "depression", "sadness", "lack of clarity"]
      }
    ],
    "imageFileName": "RWS_Tarot_19_Sun",
    "prominentSymbols": [
      {
        "symbol": "child",
        "meaning": "The child symbolizes innocence, joy, and new beginnings, suggesting the need to approach life with a fresh perspective and open heart."
      },
      {
        "symbol": "white horse",
        "meaning": "The white horse symbolizes purity, freedom, and spiritual growth, indicating the need to embrace your true self and follow your path with confidence."
      },
      {
        "symbol": "sun",
        "meaning": "The sun symbolizes success, vitality, and enlightenment, suggesting the need to shine brightly and embrace opportunities for growth and transformation."
      },
      {
        "symbol": "sunflowers",
        "meaning": "Sunflowers symbolize joy, happiness, and optimism, indicating the need to focus on the positive aspects of life and cultivate a sense of gratitude."
      }
    ],
    "prominentColors": [
      {
        "color": "yellow",
        "meaning": "Yellow symbolizes happiness, positivity, and enlightenment, suggesting the need to stay optimistic and focus on the bright side of life."
      },
      {
        "color": "white",
        "meaning": "White symbolizes purity, clarity, and new beginnings, indicating the need to let go of the past and embrace a fresh start."
      },
      {
        "color": "green",
        "meaning": "Green symbolizes growth, abundance, and vitality, suggesting the need to nurture your dreams and cultivate a sense of well-being."
      },
      {
        "color": "red",
        "meaning": "Red symbolizes passion, energy, and vitality, indicating the need to take action and pursue your goals with enthusiasm."
      }
    ]
  },
  {
    "cardName": "Judgement",
    "number": 20,
    "arcana": "Major",
    "suit": "Keys",
    "cardDescription": "Judgement depicts an angel blowing a trumpet, with people rising from their graves. It symbolizes rebirth, inner calling, and absolution.",
    "meanings": [
      {
        "title": "Upright Meaning",
        "description": "In the upright position, Judgement represents judgement, rebirth, inner calling, and absolution.",
        "keywords": ["judgement", "rebirth", "inner calling", "absolution"]
      },
      {
        "title": "Reversed Meaning",
        "description": "In the reversed position, Judgement can indicate self-doubt, failure to learn lessons, and the need for self-examination.",
        "keywords": [
          "self-doubt",
          "failure to learn lessons",
          "self-examination"
        ]
      }
    ],
    "imageFileName": "RWS_Tarot_20_Judgement",
    "prominentSymbols": [
      {
        "symbol": "angel",
        "meaning": "The angel symbolizes divine intervention, guidance, and awakening, suggesting the need to listen to your inner voice and follow your spiritual path."
      },
      {
        "symbol": "trumpet",
        "meaning": "The trumpet symbolizes awakening, revelation, and the call to action, indicating the need to heed the call of destiny and embrace change."
      },
      {
        "symbol": "rising figures",
        "meaning": "The rising figures symbolize rebirth, renewal, and transformation, suggesting the need to let go of the past and embrace a new beginning."
      },
      {
        "symbol": "cross",
        "meaning": "The cross symbolizes sacrifice, redemption, and faith, indicating the need to make sacrifices for a greater good and have faith in the future."
      }
    ],
    "prominentColors": [
      {
        "color": "blue",
        "meaning": "Blue symbolizes spirituality, intuition, and inner peace, suggesting the need to connect with your spiritual side and trust your instincts."
      },
      {
        "color": "red",
        "meaning": "Red symbolizes passion, vitality, and action, indicating the need to take bold steps and pursue your goals with determination."
      },
      {
        "color": "white",
        "meaning": "White symbolizes purity, clarity, and new beginnings, suggesting the need to let go of the past and embrace a fresh start."
      },
      {
        "color": "yellow",
        "meaning": "Yellow symbolizes enlightenment, positivity, and joy, indicating the need to stay optimistic and focus on the bright side of life."
      }
    ]
  },
  {
    "cardName": "The World",
    "number": 21,
    "arcana": "Major",
    "suit": "Keys",
    "cardDescription": "The World shows a figure surrounded by a laurel wreath, with symbols of the four elements in each corner. It represents completion, accomplishment, and unity.",
    "meanings": [
      {
        "title": "Upright Meaning",
        "description": "In the upright position, The World represents completion, accomplishment, travel, fulfillment, and harmony.",
        "keywords": [
          "completion",
          "accomplishment",
          "travel",
          "fulfillment",
          "harmony"
        ]
      },
      {
        "title": "Reversed Meaning",
        "description": "In the reversed position, The World can indicate incompletion, lack of closure, lack of achievement, and stagnation.",
        "keywords": [
          "incompletion",
          "lack of closure",
          "lack of achievement",
          "stagnation"
        ]
      }
    ],
    "imageFileName": "RWS_Tarot_21_World",
    "prominentSymbols": [
      {
        "symbol": "laurel wreath",
        "meaning": "The laurel wreath symbolizes victory, success, and achievement, suggesting the need to celebrate your accomplishments and acknowledge your hard work."
      },
      {
        "symbol": "four elements",
        "meaning": "The symbols of the four elements (earth, air, fire, water) represent balance and harmony, indicating the need to find balance in all aspects of your life."
      },
      {
        "symbol": "dancing figure",
        "meaning": "The dancing figure symbolizes joy, celebration, and freedom, suggesting the need to embrace life with enthusiasm and optimism."
      },
      {
        "symbol": "ribbon",
        "meaning": "The ribbon symbolizes unity and completion, indicating the need to tie up loose ends and bring projects to a successful conclusion."
      }
    ],
    "prominentColors": [
      {
        "color": "green",
        "meaning": "Green symbolizes growth, renewal, and harmony, suggesting the need to nurture your relationships and personal growth."
      },
      {
        "color": "blue",
        "meaning": "Blue symbolizes peace, tranquility, and communication, indicating the need to express yourself clearly and listen to others."
      },
      {
        "color": "red",
        "meaning": "Red symbolizes passion, energy, and action, suggesting the need to take bold steps and pursue your goals with determination."
      },
      {
        "color": "yellow",
        "meaning": "Yellow symbolizes enlightenment, positivity, and joy, indicating the need to stay optimistic and focus on the bright side of life."
      }
    ]
  },
  {
    "cardName": "Ace of Wands",
    "number": 1,
    "arcana": "Minor",
    "suit": "Wands",
    "cardDescription": "The Ace of Wands depicts a hand holding a budding wand, symbolizing new beginnings, inspiration, and potential.",
    "meanings": [
      {
        "title": "Upright Meaning",
        "description": "In the upright position, the Ace of Wands represents new beginnings, inspiration, creativity, and potential.",
        "keywords": ["new beginnings", "inspiration", "creativity", "potential"]
      },
      {
        "title": "Reversed Meaning",
        "description": "In the reversed position, the Ace of Wands can indicate delays, lack of motivation, wasted potential, and feeling uninspired.",
        "keywords": [
          "delays",
          "lack of motivation",
          "wasted potential",
          "uninspired"
        ]
      }
    ],
    "imageFileName": "Wands01",
    "prominentSymbols": [
      {
        "symbol": "hand",
        "meaning": "The hand symbolizes action and creativity, suggesting the need to take action and pursue your passions."
      },
      {
        "symbol": "budding wand",
        "meaning": "The budding wand symbolizes new beginnings and potential, indicating the start of a new journey or project."
      },
      {
        "symbol": "landscape",
        "meaning": "The landscape represents the fertile ground for growth and creativity, suggesting that now is the time to plant seeds for the future."
      }
    ],
    "prominentColors": [
      {
        "color": "yellow",
        "meaning": "Yellow symbolizes energy, creativity, and positivity, suggesting that now is the time to be optimistic and take action."
      },
      {
        "color": "green",
        "meaning": "Green symbolizes growth, vitality, and abundance, indicating that now is the time for new growth and opportunities."
      },
      {
        "color": "blue",
        "meaning": "Blue symbolizes communication, inspiration, and intuition, suggesting that now is the time to listen to your inner voice and trust your instincts."
      },
      {
        "color": "brown",
        "meaning": "Brown symbolizes stability, grounding, and practicality, indicating that now is the time to be practical and realistic in your endeavors."
      }
    ]
  },
  {
    "cardName": "Two of Wands",
    "number": 2,
    "arcana": "Minor",
    "suit": "Wands",
    "cardDescription": "The Two of Wands shows a figure holding a globe, looking out over a landscape. It represents future planning, progress, decisions, and discovery.",
    "meanings": [
      {
        "title": "Upright Meaning",
        "description": "In the upright position, the Two of Wands represents future planning, progress, decisions, and discovery.",
        "keywords": ["future planning", "progress", "decisions", "discovery"]
      },
      {
        "title": "Reversed Meaning",
        "description": "In the reversed position, the Two of Wands can indicate fear of change, indecision, lack of planning, and feeling overwhelmed.",
        "keywords": [
          "fear of change",
          "indecision",
          "lack of planning",
          "overwhelmed"
        ]
      }
    ],
    "imageFileName": "Wands02",
    "prominentSymbols": [
      {
        "symbol": "figure",
        "meaning": "The figure represents someone who is at a crossroads, needing to make a decision or choose a path forward."
      },
      {
        "symbol": "globe",
        "meaning": "The globe symbolizes the world of possibilities and opportunities that are available, suggesting the need to think globally and consider the bigger picture."
      },
      {
        "symbol": "landscape",
        "meaning": "The landscape represents the vastness of the future and the unknown, suggesting the need to explore and be open to new experiences."
      },
      {
        "symbol": "wand",
        "meaning": "The wand symbolizes creativity, energy, and action, suggesting that now is the time to take the first steps towards your goals."
      }
    ],
    "prominentColors": [
      {
        "color": "red",
        "meaning": "Red symbolizes passion, energy, and action, suggesting that now is the time to be bold and take risks."
      },
      {
        "color": "blue",
        "meaning": "Blue symbolizes communication, intuition, and clarity, suggesting that now is the time to listen to your inner voice and trust your instincts."
      },
      {
        "color": "yellow",
        "meaning": "Yellow symbolizes optimism, joy, and positivity, suggesting that now is the time to be optimistic about the future."
      },
      {
        "color": "green",
        "meaning": "Green symbolizes growth, abundance, and prosperity, suggesting that now is the time for personal and professional growth."
      }
    ]
  },
  {
    "cardName": "Three of Wands",
    "number": 3,
    "arcana": "Minor",
    "suit": "Wands",
    "cardDescription": "The Three of Wands depicts a figure looking out over a vast landscape, with three wands standing firmly. It symbolizes exploration, foresight, and expansion.",
    "meanings": [
      {
        "title": "Upright Meaning",
        "description": "In the upright position, the Three of Wands represents expansion, foresight, overseas opportunities, and long-term plans.",
        "keywords": [
          "expansion",
          "foresight",
          "overseas opportunities",
          "long-term plans"
        ]
      },
      {
        "title": "Reversed Meaning",
        "description": "In the reversed position, the Three of Wands can indicate delays, obstacles, frustration, and a lack of foresight.",
        "keywords": ["delays", "obstacles", "frustration", "lack of foresight"]
      }
    ],
    "imageFileName": "Wands03",
    "prominentSymbols": [
      {
        "symbol": "figure",
        "meaning": "The figure represents someone who is looking out into the future with optimism and confidence, ready to explore new opportunities."
      },
      {
        "symbol": "landscape",
        "meaning": "The landscape symbolizes the vast possibilities and opportunities that lie ahead, suggesting that now is the time to think big and expand your horizons."
      },
      {
        "symbol": "three wands",
        "meaning": "The three wands standing firmly symbolize stability and strength, suggesting that your plans are well-founded and likely to succeed."
      },
      {
        "symbol": "sea",
        "meaning": "The sea symbolizes the unknown and unexplored, suggesting that now is the time to venture into new territories and take risks."
      }
    ],
    "prominentColors": [
      {
        "color": "red",
        "meaning": "Red symbolizes passion, energy, and action, suggesting that now is the time to take bold steps towards your goals."
      },
      {
        "color": "green",
        "meaning": "Green symbolizes growth, abundance, and prosperity, suggesting that your plans are likely to lead to success and prosperity."
      },
      {
        "color": "blue",
        "meaning": "Blue symbolizes communication, intuition, and clarity, suggesting that you have a clear vision of where you want to go and how to get there."
      },
      {
        "color": "yellow",
        "meaning": "Yellow symbolizes optimism, joy, and positivity, suggesting that your future is bright and full of opportunities."
      }
    ]
  },
  {
    "cardName": "Four of Wands",
    "number": 4,
    "arcana": "Minor",
    "suit": "Wands",
    "cardDescription": "The Four of Wands depicts a celebration with a background of a castle. It represents community, homecoming, and joy.",
    "meanings": [
      {
        "title": "Upright Meaning",
        "description": "In the upright position, the Four of Wands represents celebration, joy, harmony, relaxation, and homecoming.",
        "keywords": [
          "celebration",
          "joy",
          "harmony",
          "relaxation",
          "homecoming"
        ]
      },
      {
        "title": "Reversed Meaning",
        "description": "In the reversed position, the Four of Wands can indicate a lack of support, feeling unwelcome, transient joy, and instability.",
        "keywords": [
          "lack of support",
          "feeling unwelcome",
          "transient joy",
          "instability"
        ]
      }
    ],
    "imageFileName": "Wands04",
    "prominentSymbols": [
      {
        "symbol": "celebration",
        "meaning": "The celebration symbolizes a time of happiness and joy, suggesting that you should take the time to celebrate your achievements and enjoy the moment."
      },
      {
        "symbol": "castle",
        "meaning": "The castle symbolizes stability and security, suggesting that you are in a safe and comfortable place in your life."
      },
      {
        "symbol": "four wands",
        "meaning": "The four wands represent a solid foundation and support, suggesting that you have the support of friends and family in your endeavors."
      },
      {
        "symbol": "garlands",
        "meaning": "The garlands symbolize decoration and festivity, suggesting that now is a time for celebration and enjoyment."
      }
    ],
    "prominentColors": [
      {
        "color": "yellow",
        "meaning": "Yellow symbolizes joy, happiness, and optimism, suggesting that this is a time of celebration and happiness."
      },
      {
        "color": "red",
        "meaning": "Red symbolizes passion, energy, and excitement, suggesting that the celebration will be lively and enjoyable."
      },
      {
        "color": "green",
        "meaning": "Green symbolizes growth, harmony, and balance, suggesting that the celebration will bring a sense of peace and harmony."
      },
      {
        "color": "blue",
        "meaning": "Blue symbolizes tranquility, calmness, and stability, suggesting that the celebration will be a peaceful and enjoyable experience."
      }
    ]
  },
  {
    "cardName": "Five of Wands",
    "number": 5,
    "arcana": "Minor",
    "suit": "Wands",
    "cardDescription": "The Five of Wands shows five people holding wands and appearing to be in conflict. It represents competition, conflict, and disagreement.",
    "meanings": [
      {
        "title": "Upright Meaning",
        "description": "In the upright position, the Five of Wands represents conflict, competition, disagreements, tension, and diversity.",
        "keywords": [
          "conflict",
          "competition",
          "disagreements",
          "tension",
          "diversity"
        ]
      },
      {
        "title": "Reversed Meaning",
        "description": "In the reversed position, the Five of Wands can indicate avoiding conflict, respecting differences, and finding common ground.",
        "keywords": [
          "avoiding conflict",
          "respecting differences",
          "finding common ground"
        ]
      }
    ],
    "imageFileName": "Wands05",
    "prominentSymbols": [
      {
        "symbol": "five people",
        "meaning": "The five people symbolize different perspectives and personalities, suggesting that there are multiple viewpoints in the situation."
      },
      {
        "symbol": "wands",
        "meaning": "The wands symbolize conflict and competition, suggesting that there is a struggle for dominance or control."
      },
      {
        "symbol": "struggle",
        "meaning": "The struggle symbolizes the challenges and obstacles that must be overcome, suggesting that there is a need to find a resolution."
      },
      {
        "symbol": "disarray",
        "meaning": "The disarray symbolizes confusion and disorder, suggesting that there is a lack of clarity or direction in the situation."
      }
    ],
    "prominentColors": [
      {
        "color": "orange",
        "meaning": "Orange symbolizes energy and enthusiasm, suggesting that there is a lot of activity and movement in the situation."
      },
      {
        "color": "yellow",
        "meaning": "Yellow symbolizes intellect and communication, suggesting that there may be misunderstandings or miscommunications causing the conflict."
      },
      {
        "color": "blue",
        "meaning": "Blue symbolizes calmness and stability, suggesting that there is a need to remain calm and composed in the face of conflict."
      },
      {
        "color": "green",
        "meaning": "Green symbolizes growth and harmony, suggesting that there is a need to find a peaceful resolution to the conflict."
      }
    ]
  },
  {
    "cardName": "Six of Wands",
    "number": 6,
    "arcana": "Minor",
    "suit": "Wands",
    "cardDescription": "The Six of Wands depicts a figure riding a horse, holding a wand with a wreath. It symbolizes victory, success, and recognition.",
    "meanings": [
      {
        "title": "Upright Meaning",
        "description": "In the upright position, the Six of Wands represents victory, success, public recognition, progress, and self-confidence.",
        "keywords": [
          "victory",
          "success",
          "recognition",
          "progress",
          "self-confidence"
        ]
      },
      {
        "title": "Reversed Meaning",
        "description": "In the reversed position, the Six of Wands can indicate failure, lack of recognition, lack of achievement, and a fall from grace.",
        "keywords": [
          "failure",
          "lack of recognition",
          "lack of achievement",
          "fall from grace"
        ]
      }
    ],
    "imageFileName": "Wands06",
    "prominentSymbols": [
      {
        "symbol": "figure on horse",
        "meaning": "The figure on the horse symbolizes leadership and triumph, suggesting that you are in a position of power and authority."
      },
      {
        "symbol": "wreath",
        "meaning": "The wreath symbolizes victory and achievement, suggesting that you have accomplished your goals and are being rewarded for your efforts."
      },
      {
        "symbol": "crowd",
        "meaning": "The crowd symbolizes recognition and admiration, suggesting that others are celebrating your success and achievements."
      },
      {
        "symbol": "six wands",
        "meaning": "The six wands symbolize success and victory, suggesting that you have achieved a significant milestone or goal."
      }
    ],
    "prominentColors": [
      {
        "color": "red",
        "meaning": "Red symbolizes passion and energy, suggesting that you are driven to succeed and achieve your goals."
      },
      {
        "color": "yellow",
        "meaning": "Yellow symbolizes joy and happiness, suggesting that your success is bringing you great satisfaction and fulfillment."
      },
      {
        "color": "white",
        "meaning": "White symbolizes purity and innocence, suggesting that your success is well-deserved and untainted."
      },
      {
        "color": "green",
        "meaning": "Green symbolizes growth and prosperity, suggesting that your success will lead to further opportunities and advancements."
      }
    ]
  },
  {
    "cardName": "Seven of Wands",
    "number": 7,
    "arcana": "Minor",
    "suit": "Wands",
    "cardDescription": "The Seven of Wands shows a figure standing on a hill, defending against opponents. It represents standing one's ground, perseverance, and challenge.",
    "meanings": [
      {
        "title": "Upright Meaning",
        "description": "In the upright position, the Seven of Wands represents perseverance, defensive posture, maintaining control, and facing challenges head-on."
      },
      {
        "title": "Reversed Meaning",
        "description": "In the reversed position, the Seven of Wands can indicate giving up, feeling overwhelmed, yielding to pressure, and lacking confidence."
      }
    ],
    "imageFileName": "Wands07",
    "prominentSymbols": [
      {
        "symbol": "figure on hill",
        "meaning": "The figure on the hill symbolizes the need to defend your position or beliefs, suggesting that you may face opposition or challenges."
      },
      {
        "symbol": "opponents",
        "meaning": "The opponents symbolize external challenges or obstacles that you must overcome, suggesting that you may need to fight for what you believe in."
      },
      {
        "symbol": "seven wands",
        "meaning": "The seven wands symbolize resilience and determination, suggesting that you have the strength and courage to face whatever comes your way."
      },
      {
        "symbol": "defensive stance",
        "meaning": "The defensive stance of the figure symbolizes the need to stand your ground and protect your interests, suggesting that you may need to be assertive and determined."
      }
    ],
    "prominentColors": [
      {
        "color": "red",
        "meaning": "Red symbolizes passion and determination, suggesting that you are fiercely committed to your goals and beliefs."
      },
      {
        "color": "yellow",
        "meaning": "Yellow symbolizes courage and confidence, suggesting that you have the strength and conviction to face challenges."
      },
      {
        "color": "green",
        "meaning": "Green symbolizes growth and resilience, suggesting that you have the ability to adapt and overcome obstacles."
      },
      {
        "color": "blue",
        "meaning": "Blue symbolizes calmness and stability, suggesting that you can maintain your composure and focus under pressure."
      }
    ]
  },
  {
    "cardName": "Eight of Wands",
    "number": 8,
    "arcana": "Minor",
    "suit": "Wands",
    "cardDescription": "The Eight of Wands shows eight wands flying through the air, symbolizing swift action, movement, and rapid change.",
    "meanings": [
      {
        "title": "Upright Meaning",
        "description": "In the upright position, the Eight of Wands represents rapid action, movement, quick decisions, and swift changes. It indicates that things are progressing quickly and you may need to act fast to keep up."
      },
      {
        "title": "Reversed Meaning",
        "description": "In the reversed position, the Eight of Wands can indicate delays, frustration, resisting change, and internal conflict. It suggests that things may not be progressing as quickly as you'd like, and you may need to address any internal conflicts or resistance to change."
      }
    ],
    "imageFileName": "Wands08",
    "prominentSymbols": [
      {
        "symbol": "eight wands",
        "meaning": "The eight wands flying through the air symbolize swift action and movement, suggesting that things are happening quickly or that you need to act fast."
      },
      {
        "symbol": "speed",
        "meaning": "The speed at which the wands are moving symbolizes rapid change and progress, suggesting that things are moving forward swiftly."
      },
      {
        "symbol": "movement",
        "meaning": "The movement of the wands symbolizes forward momentum and progress, suggesting that things are in motion and progressing quickly."
      },
      {
        "symbol": "river",
        "meaning": "The river in the background symbolizes the flow of energy and change, suggesting that change is inevitable and happening swiftly."
      }
    ],
    "prominentColors": [
      {
        "color": "yellow",
        "meaning": "Yellow symbolizes energy and action, suggesting that you may need to take swift action or make quick decisions."
      },
      {
        "color": "green",
        "meaning": "Green symbolizes growth and progress, suggesting that things are moving forward rapidly."
      },
      {
        "color": "blue",
        "meaning": "Blue symbolizes communication and clarity, suggesting that you may need to communicate clearly and quickly to keep up with the pace of change."
      },
      {
        "color": "red",
        "meaning": "Red symbolizes passion and urgency, suggesting that you may need to act quickly and decisively."
      }
    ]
  },
  {
    "cardName": "Nine of Wands",
    "number": 9,
    "arcana": "Minor",
    "suit": "Wands",
    "cardDescription": "The Nine of Wands shows a figure standing guard with a bandaged head, surrounded by nine wands. It represents resilience, persistence, and boundaries.",
    "meanings": [
      {
        "title": "Upright Meaning",
        "description": "In the upright position, the Nine of Wands represents resilience, courage, persistence, a test of faith, and boundaries. It suggests that you have been through challenges but have the strength to continue and defend your position."
      },
      {
        "title": "Reversed Meaning",
        "description": "In the reversed position, the Nine of Wands can indicate inner resources, struggle, overwhelm, defensiveness, and paranoia. It suggests that you may be feeling overwhelmed or defensive, and it may be time to reassess your boundaries and approach to challenges."
      }
    ],
    "imageFileName": "Wands09",
    "prominentSymbols": [
      {
        "symbol": "bandaged figure",
        "meaning": "The bandaged figure represents someone who has been through challenges but remains strong and resilient."
      },
      {
        "symbol": "nine wands",
        "meaning": "The nine wands surrounding the figure symbolize resilience, persistence, and the ability to defend one's position."
      },
      {
        "symbol": "mountains",
        "meaning": "The mountains in the background symbolize the challenges that the figure has faced and overcome."
      }
    ],
    "prominentColors": [
      {
        "color": "yellow",
        "meaning": "Yellow symbolizes resilience and optimism, suggesting that you have the strength to overcome challenges."
      },
      {
        "color": "green",
        "meaning": "Green symbolizes growth and renewal, suggesting that you are able to grow and learn from your experiences."
      },
      {
        "color": "red",
        "meaning": "Red symbolizes passion and strength, suggesting that you have the passion and strength to persevere."
      },
      {
        "color": "blue",
        "meaning": "Blue symbolizes calmness and stability, suggesting that you are able to remain calm and stable in the face of challenges."
      }
    ]
  },
  {
    "cardName": "Ten of Wands",
    "number": 10,
    "arcana": "Minor",
    "suit": "Wands",
    "cardDescription": "The Ten of Wands depicts a figure carrying a heavy load of ten wands. It symbolizes burden, responsibility, and hard work.",
    "meanings": [
      {
        "title": "Upright Meaning",
        "description": "In the upright position, the Ten of Wands represents burden, responsibility, hard work, stress, and achievement. It suggests that you may be feeling overwhelmed by your responsibilities but that you have the strength and determination to see them through."
      },
      {
        "title": "Reversed Meaning",
        "description": "In the reversed position, the Ten of Wands can indicate release, letting go, feeling overwhelmed, and having too much to bear. It suggests that you may need to delegate or let go of some of your burdens to avoid becoming overwhelmed."
      }
    ],
    "imageFileName": "Wands10",
    "prominentSymbols": [
      {
        "symbol": "figure",
        "meaning": "The figure carrying the wands symbolizes someone who is burdened by responsibilities but is determined to see them through."
      },
      {
        "symbol": "ten wands",
        "meaning": "The ten wands symbolize the burdens and responsibilities that the figure is carrying."
      },
      {
        "symbol": "burden",
        "meaning": "The burden represents the weight of responsibility and hard work that the figure is carrying."
      }
    ],
    "prominentColors": [
      {
        "color": "yellow",
        "meaning": "Yellow symbolizes optimism and energy, suggesting that you have the energy and determination to complete your tasks."
      },
      {
        "color": "red",
        "meaning": "Red symbolizes passion and action, suggesting that you are driven by a strong sense of purpose."
      },
      {
        "color": "green",
        "meaning": "Green symbolizes growth and renewal, suggesting that your burdens may lead to personal growth and development."
      },
      {
        "color": "brown",
        "meaning": "Brown symbolizes stability and grounding, suggesting that you have a solid foundation to support you through your challenges."
      }
    ]
  },
  {
    "cardName": "Page of Wands",
    "arcana": "Minor",
    "suit": "Wands",
    "cardDescription": "The Page of Wands shows a young figure holding a staff, looking at it with curiosity. It represents enthusiasm, exploration, and discovery.",
    "meanings": [
      {
        "title": "Upright Meaning",
        "description": "In the upright position, the Page of Wands represents enthusiasm, exploration, discovery, and a free spirit. It suggests that you are full of energy and excitement for new opportunities and adventures."
      },
      {
        "title": "Reversed Meaning",
        "description": "In the reversed position, the Page of Wands can indicate a lack of direction, procrastination, and creating conflict. It suggests that you may be feeling restless or unsure about your path, leading to indecision or conflict with others."
      }
    ],
    "imageFileName": "Wands11",
    "prominentSymbols": [
      {
        "symbol": "young figure",
        "meaning": "The young figure represents youthfulness, energy, and a willingness to embrace new experiences."
      },
      {
        "symbol": "staff",
        "meaning": "The staff symbolizes potential and the beginning of a journey or adventure."
      },
      {
        "symbol": "desert",
        "meaning": "The desert represents the vast expanse of opportunities and adventures that lie ahead, waiting to be explored."
      }
    ],
    "prominentColors": [
      {
        "color": "yellow",
        "meaning": "Yellow symbolizes enthusiasm and optimism, suggesting that you are ready to embrace new challenges."
      },
      {
        "color": "red",
        "meaning": "Red symbolizes passion and energy, suggesting that you are driven by a strong sense of purpose."
      },
      {
        "color": "blue",
        "meaning": "Blue symbolizes introspection and wisdom, suggesting that you are open to learning and discovering new things."
      },
      {
        "color": "green",
        "meaning": "Green symbolizes growth and renewal, suggesting that you are ready to grow and develop through new experiences."
      }
    ]
  },
  {
    "cardName": "Knight of Wands",
    "arcana": "Minor",
    "suit": "Wands",
    "cardDescription": "The Knight of Wands shows a knight in armor riding a horse, representing energy, passion, and adventure.",
    "meanings": [
      {
        "title": "Upright Meaning",
        "description": "In the upright position, the Knight of Wands represents energy, passion, adventure, impulsiveness, and travel. It suggests that you are full of energy and ready to embark on new adventures or projects."
      },
      {
        "title": "Reversed Meaning",
        "description": "In the reversed position, the Knight of Wands can indicate haste, scattered energy, delays, and frustration. It suggests that you may be rushing into things without proper planning or facing obstacles that slow your progress."
      }
    ],
    "imageFileName": "Wands12",
    "prominentSymbols": [
      {
        "symbol": "knight",
        "meaning": "The knight symbolizes action, movement, and a willingness to pursue your goals."
      },
      {
        "symbol": "horse",
        "meaning": "The horse represents strength, power, and the drive to move forward."
      },
      {
        "symbol": "armor",
        "meaning": "The armor symbolizes protection and readiness for battle, suggesting that you are prepared to face challenges head-on."
      },
      {
        "symbol": "wands",
        "meaning": "The wands symbolize creativity, passion, and the pursuit of goals and desires."
      }
    ],
    "prominentColors": [
      {
        "color": "red",
        "meaning": "Red symbolizes passion, energy, and action, suggesting that you are driven by your desires and goals."
      },
      {
        "color": "yellow",
        "meaning": "Yellow symbolizes optimism and enthusiasm, suggesting that you are excited about the opportunities ahead."
      },
      {
        "color": "green",
        "meaning": "Green symbolizes growth and vitality, suggesting that you are ready to grow and expand your horizons."
      },
      {
        "color": "blue",
        "meaning": "Blue symbolizes wisdom and introspection, suggesting that you may need to consider your actions carefully before proceeding."
      }
    ]
  },
  {
    "cardName": "Queen of Wands",
    "arcana": "Minor",
    "suit": "Wands",
    "cardDescription": "The Queen of Wands sits on her throne, holding a wand and a sunflower, embodying confidence, warmth, and determination.",
    "meanings": [
      {
        "title": "Upright Meaning",
        "description": "In the upright position, the Queen of Wands represents confidence, warmth, determination, vibrancy, and independence. She embodies the qualities of a natural leader who is passionate about her pursuits and inspires others with her enthusiasm."
      },
      {
        "title": "Reversed Meaning",
        "description": "In the reversed position, the Queen of Wands can indicate overbearing behavior, being demanding, jealousy, and deceit. It suggests that you may need to be mindful of your actions and their impact on others."
      }
    ],
    "imageFileName": "Wands13",
    "prominentSymbols": [
      {
        "symbol": "queen",
        "meaning": "The queen symbolizes leadership, confidence, and independence, suggesting that you have the ability to take charge of your life and pursue your goals."
      },
      {
        "symbol": "throne",
        "meaning": "The throne symbolizes authority and power, suggesting that you have the strength and determination to overcome challenges."
      },
      {
        "symbol": "sunflower",
        "meaning": "The sunflower symbolizes warmth, positivity, and vitality, suggesting that you bring joy and energy to those around you."
      },
      {
        "symbol": "lion",
        "meaning": "The lion symbolizes courage and strength, suggesting that you have the inner strength to face any challenges that come your way."
      }
    ],
    "prominentColors": [
      {
        "color": "yellow",
        "meaning": "Yellow symbolizes confidence and positivity, suggesting that you approach life with a bright and optimistic outlook."
      },
      {
        "color": "red",
        "meaning": "Red symbolizes passion and energy, suggesting that you are driven by your desires and goals."
      },
      {
        "color": "green",
        "meaning": "Green symbolizes growth and vitality, suggesting that you are constantly evolving and expanding your horizons."
      },
      {
        "color": "orange",
        "meaning": "Orange symbolizes creativity and enthusiasm, suggesting that you are full of creative energy and ideas."
      }
    ]
  },
  {
    "cardName": "King of Wands",
    "arcana": "Minor",
    "suit": "Wands",
    "cardDescription": "The King of Wands is a natural leader, depicted on his throne, which is adorned with lions and salamanders, symbolizing strength and transformation.",
    "meanings": [
      {
        "title": "Upright Meaning",
        "description": "In the upright position, the King of Wands represents a natural leader, vision, entrepreneurship, honor, and being a force of nature. He embodies the qualities of a charismatic leader who inspires others with his ideas and actions."
      },
      {
        "title": "Reversed Meaning",
        "description": "In the reversed position, the King of Wands can indicate impulsiveness, being overbearing, having unrealistic expectations, and tyranny. It suggests that you may need to temper your actions and consider the impact they have on others."
      }
    ],
    "imageFileName": "Wands14",
    "prominentSymbols": [
      {
        "symbol": "king",
        "meaning": "The king symbolizes leadership, authority, and influence, suggesting that you have the ability to lead and inspire others."
      },
      {
        "symbol": "throne",
        "meaning": "The throne symbolizes power and authority, suggesting that you have the strength and determination to achieve your goals."
      },
      {
        "symbol": "lion",
        "meaning": "The lion symbolizes courage and strength, suggesting that you have the inner strength to face challenges."
      },
      {
        "symbol": "salamander",
        "meaning": "The salamander symbolizes transformation and regeneration, suggesting that you have the ability to adapt and change in any situation."
      }
    ],
    "prominentColors": [
      {
        "color": "orange",
        "meaning": "Orange symbolizes creativity and enthusiasm, suggesting that you approach life with passion and energy."
      },
      {
        "color": "yellow",
        "meaning": "Yellow symbolizes confidence and positivity, suggesting that you have a bright and optimistic outlook."
      },
      {
        "color": "red",
        "meaning": "Red symbolizes passion and action, suggesting that you are driven by your desires and goals."
      },
      {
        "color": "green",
        "meaning": "Green symbolizes growth and renewal, suggesting that you are constantly evolving and improving."
      }
    ]
  },
  {
    "cardName": "Ace of Cups",
    "arcana": "Minor",
    "suit": "Cups",
    "cardDescription": "The Ace of Cups depicts a hand holding a cup overflowing with water, symbolizing new beginnings, emotional fulfillment, and intuition.",
    "meanings": [
      {
        "title": "Upright Meaning",
        "description": "In the upright position, the Ace of Cups represents new beginnings, emotional fulfillment, intuition, and creativity. It signifies the start of a new emotional journey or a deepening of existing emotional bonds."
      },
      {
        "title": "Reversed Meaning",
        "description": "In the reversed position, the Ace of Cups can indicate emotional loss, blocked creativity, emptiness, or unfulfilled love. It suggests that you may need to address your emotional needs or explore new ways to express your feelings."
      }
    ],
    "imageFileName": "Cups01",
    "prominentSymbols": [
      {
        "symbol": "hand",
        "meaning": "The hand symbolizes offering or receiving, suggesting openness to new emotional experiences."
      },
      {
        "symbol": "overflowing cup",
        "meaning": "The overflowing cup symbolizes abundance and emotional fulfillment, suggesting a wealth of positive emotions."
      },
      {
        "symbol": "water",
        "meaning": "Water symbolizes emotions and intuition, suggesting a deep connection to your feelings and inner guidance."
      },
      {
        "symbol": "dove",
        "meaning": "The dove symbolizes peace and love, suggesting harmonious relationships and emotional healing."
      }
    ],
    "prominentColors": [
      {
        "color": "blue",
        "meaning": "Blue symbolizes tranquility and calmness, suggesting emotional stability and serenity."
      },
      {
        "color": "white",
        "meaning": "White symbolizes purity and spirituality, suggesting a clear and open heart."
      },
      {
        "color": "yellow",
        "meaning": "Yellow symbolizes joy and happiness, suggesting a positive and uplifting emotional state."
      },
      {
        "color": "green",
        "meaning": "Green symbolizes growth and healing, suggesting emotional renewal and transformation."
      }
    ]
  },
  {
    "cardName": "Two of Cups",
    "arcana": "Minor",
    "suit": "Cups",
    "cardDescription": "The Two of Cups shows two people exchanging cups, symbolizing partnership, unity, and emotional connection.",
    "meanings": [
      {
        "title": "Upright Meaning",
        "description": "In the upright position, the Two of Cups represents partnership, unity, emotional connection, and mutual attraction. It signifies the beginning of a meaningful relationship or a deepening bond between two people."
      },
      {
        "title": "Reversed Meaning",
        "description": "In the reversed position, the Two of Cups can indicate miscommunication, breakups, imbalance, or tension in relationships. It suggests that there may be challenges or conflicts that need to be addressed in order to maintain harmony."
      }
    ],
    "imageFileName": "Cups02",
    "prominentSymbols": [
      {
        "symbol": "two people",
        "meaning": "The two people symbolize a partnership or relationship, suggesting a strong emotional bond."
      },
      {
        "symbol": "exchange of cups",
        "meaning": "The exchange of cups symbolizes the sharing of emotions and feelings, suggesting mutual understanding and connection."
      },
      {
        "symbol": "caduceus",
        "meaning": "The caduceus symbolizes healing and transformation, suggesting the potential for emotional growth and renewal in relationships."
      },
      {
        "symbol": "lion's head",
        "meaning": "The lion's head symbolizes courage and strength, suggesting the need for bravery and resilience in relationships."
      }
    ],
    "prominentColors": [
      {
        "color": "red",
        "meaning": "Red symbolizes passion and love, suggesting a deep emotional connection."
      },
      {
        "color": "blue",
        "meaning": "Blue symbolizes communication and understanding, suggesting a harmonious relationship."
      },
      {
        "color": "yellow",
        "meaning": "Yellow symbolizes happiness and optimism, suggesting a positive and uplifting partnership."
      },
      {
        "color": "green",
        "meaning": "Green symbolizes growth and renewal, suggesting the potential for emotional development in the relationship."
      }
    ]
  },
  {
    "cardName": "Three of Cups",
    "arcana": "Minor",
    "suit": "Cups",
    "cardDescription": "The Three of Cups depicts three people celebrating together, symbolizing friendship, community, and joy.",
    "meanings": [
      {
        "title": "Upright Meaning",
        "description": "In the upright position, the Three of Cups represents friendship, community, celebration, collaboration, and joy. It signifies coming together with others to share happiness and good times."
      },
      {
        "title": "Reversed Meaning",
        "description": "In the reversed position, the Three of Cups can indicate overindulgence, gossip, isolation, or conflicts in friendship. It suggests that there may be issues in relationships or social interactions that need to be addressed."
      }
    ],
    "imageFileName": "Cups03",
    "prominentSymbols": [
      {
        "symbol": "three people",
        "meaning": "The three people symbolize friendship and community, suggesting a sense of belonging and camaraderie."
      },
      {
        "symbol": "celebration",
        "meaning": "The celebration symbolizes joy and happiness, suggesting a time of festivity and shared enjoyment."
      },
      {
        "symbol": "cups",
        "meaning": "The cups symbolize emotions and relationships, suggesting a focus on emotional connections and shared experiences."
      },
      {
        "symbol": "fruit",
        "meaning": "The fruit symbolizes abundance and prosperity, suggesting a time of plenty and shared blessings."
      }
    ],
    "prominentColors": [
      {
        "color": "yellow",
        "meaning": "Yellow symbolizes happiness and optimism, suggesting a positive and joyful atmosphere."
      },
      {
        "color": "green",
        "meaning": "Green symbolizes growth and harmony, suggesting a sense of balance and unity in the celebration."
      },
      {
        "color": "red",
        "meaning": "Red symbolizes passion and vitality, suggesting a lively and energetic gathering."
      },
      {
        "color": "blue",
        "meaning": "Blue symbolizes communication and understanding, suggesting open and meaningful interactions."
      }
    ]
  },
  {
    "cardName": "Four of Cups",
    "arcana": "Minor",
    "suit": "Cups",
    "cardDescription": "The Four of Cups shows a figure contemplating three cups while a fourth is offered. It represents contemplation, apathy, and missed opportunities.",
    "meanings": [
      {
        "title": "Upright Meaning",
        "description": "In the upright position, the Four of Cups represents contemplation, apathy, missed opportunities, and dissatisfaction. It suggests a period of introspection and contemplation, but warns against becoming too focused on what is lacking and missing out on new opportunities."
      },
      {
        "title": "Reversed Meaning",
        "description": "In the reversed position, the Four of Cups can indicate new opportunities, reevaluation, newfound interest, or overcoming apathy. It suggests a shift in perspective that allows for the discovery of new possibilities and a renewed sense of interest and engagement."
      }
    ],
    "imageFileName": "Cups04",
    "prominentSymbols": [
      {
        "symbol": "figure",
        "meaning": "The figure symbolizes introspection and contemplation, suggesting a period of deep thought and reflection."
      },
      {
        "symbol": "three cups",
        "meaning": "The three cups symbolize existing opportunities or blessings, suggesting that there is much to be grateful for and to consider."
      },
      {
        "symbol": "offered cup",
        "meaning": "The offered cup symbolizes new opportunities or possibilities that may be overlooked if one is too focused on what is already known or familiar."
      },
      {
        "symbol": "tree",
        "meaning": "The tree symbolizes growth and vitality, suggesting that new opportunities may lead to personal growth and development."
      }
    ],
    "prominentColors": [
      {
        "color": "blue",
        "meaning": "Blue symbolizes introspection and contemplation, suggesting a focus on inner thoughts and feelings."
      },
      {
        "color": "green",
        "meaning": "Green symbolizes growth and renewal, suggesting that new opportunities may lead to personal growth and positive change."
      },
      {
        "color": "yellow",
        "meaning": "Yellow symbolizes positivity and optimism, suggesting that new opportunities may bring about positive outcomes."
      },
      {
        "color": "red",
        "meaning": "Red symbolizes passion and action, suggesting that new opportunities may require boldness and action to pursue."
      }
    ]
  },
  {
    "cardName": "Five of Cups",
    "arcana": "Minor",
    "suit": "Cups",
    "cardDescription": "The Five of Cups shows a figure mourning over three spilled cups, unaware of two upright cups behind them. It symbolizes loss, regret, and focusing on the negative.",
    "meanings": [
      {
        "title": "Upright Meaning",
        "description": "In the upright position, the Five of Cups represents loss, regret, disappointment, focusing on the negative, and sadness. It suggests a period of mourning or sadness over past events or losses, often accompanied by a sense of regret or disappointment."
      },
      {
        "title": "Reversed Meaning",
        "description": "In the reversed position, the Five of Cups can indicate acceptance, moving on, finding peace, forgiveness, or hope. It suggests a shift in perspective that allows for acceptance of past events and a willingness to move forward with renewed hope and optimism."
      }
    ],
    "imageFileName": "Cups05",
    "prominentSymbols": [
      {
        "symbol": "figure in cloak",
        "meaning": "The figure in a cloak symbolizes sorrow or mourning, suggesting a period of sadness or regret."
      },
      {
        "symbol": "spilled cups",
        "meaning": "The spilled cups symbolize loss or missed opportunities, suggesting a focus on what has been lost rather than what remains."
      },
      {
        "symbol": "upright cups",
        "meaning": "The upright cups behind the figure symbolize hidden blessings or opportunities that may be overlooked in the midst of grief or disappointment."
      },
      {
        "symbol": "river",
        "meaning": "The river symbolizes the flow of emotions, suggesting that it is natural to experience sadness or loss but also to allow emotions to flow and eventually find peace."
      }
    ],
    "prominentColors": [
      {
        "color": "black",
        "meaning": "Black symbolizes mourning or darkness, suggesting a period of sadness or loss."
      },
      {
        "color": "blue",
        "meaning": "Blue symbolizes sadness or contemplation, suggesting a focus on emotions and reflection."
      },
      {
        "color": "red",
        "meaning": "Red symbolizes passion or strong emotions, suggesting intense feelings of regret or loss."
      },
      {
        "color": "green",
        "meaning": "Green symbolizes growth or renewal, suggesting that even in times of sadness, there is the potential for growth and new beginnings."
      }
    ]
  },
  {
    "cardName": "Six of Cups",
    "arcana": "Minor",
    "suit": "Cups",
    "cardDescription": "The Six of Cups depicts two children sharing cups filled with flowers, symbolizing nostalgia, innocence, and childhood memories.",
    "meanings": [
      {
        "title": "Upright Meaning",
        "description": "In the upright position, the Six of Cups represents nostalgia, innocence, childhood memories, joy, and simplicity. It suggests a return to simpler times or a focus on happy memories from the past. It can also indicate a need to reconnect with your inner child or approach life with a more innocent and playful attitude."
      },
      {
        "title": "Reversed Meaning",
        "description": "In the reversed position, the Six of Cups can indicate being stuck in the past, naivety, unrealistic expectations, growing up, or letting go of the past. It suggests a need to let go of outdated beliefs or behaviors that may be holding you back from moving forward."
      }
    ],
    "imageFileName": "Cups06",
    "prominentSymbols": [
      {
        "symbol": "two children",
        "meaning": "The two children symbolize innocence, purity, and a playful attitude."
      },
      {
        "symbol": "cups with flowers",
        "meaning": "The cups filled with flowers symbolize joy, beauty, and the simple pleasures of life."
      },
      {
        "symbol": "village",
        "meaning": "The village in the background symbolizes community, belonging, and a sense of home."
      },
      {
        "symbol": "guard",
        "meaning": "The guard symbolizes protection, suggesting a need to protect your inner child or cherished memories."
      }
    ],
    "prominentColors": [
      {
        "color": "yellow",
        "meaning": "Yellow symbolizes happiness, warmth, and positivity, reflecting the joyful nature of the card."
      },
      {
        "color": "green",
        "meaning": "Green symbolizes growth, renewal, and nature, reflecting the innocence and naturalness of childhood."
      },
      {
        "color": "blue",
        "meaning": "Blue symbolizes peace, tranquility, and emotional depth, suggesting a sense of calm and contentment in nostalgic memories."
      },
      {
        "color": "red",
        "meaning": "Red symbolizes passion, vitality, and energy, suggesting the vibrant and lively nature of childhood experiences."
      }
    ]
  },
  {
    "cardName": "Seven of Cups",
    "arcana": "Minor",
    "suit": "Cups",
    "cardDescription": "The Seven of Cups shows a figure facing a cloud of cups filled with various symbols, representing choices, illusions, and imagination.",
    "meanings": [
      {
        "title": "Upright Meaning",
        "description": "In the upright position, the Seven of Cups represents choices, illusions, imagination, fantasy, and wishful thinking. It suggests that you may be faced with many options or opportunities, but not all may be as they seem. It can also indicate a need to focus on what is truly important and not get lost in daydreams or unrealistic expectations."
      },
      {
        "title": "Reversed Meaning",
        "description": "In the reversed position, the Seven of Cups can indicate clarity, decision-making, seeing through illusions, and facing reality. It suggests that you are gaining a clearer perspective and are able to make more informed decisions. It can also indicate a need to be more grounded and practical in your approach."
      }
    ],
    "imageFileName": "Cups07",
    "prominentSymbols": [
      {
        "symbol": "figure",
        "meaning": "The figure represents the person facing the choices and illusions presented by the cups."
      },
      {
        "symbol": "cloud of cups",
        "meaning": "The cloud of cups represents the many options or opportunities available, each filled with different symbols."
      },
      {
        "symbol": "various symbols",
        "meaning": "The various symbols in the cups represent the different choices or illusions, which can include material wealth, love, power, and other desires."
      },
      {
        "symbol": "mist",
        "meaning": "The mist represents the uncertainty and confusion that can come from facing too many choices or illusions."
      }
    ],
    "prominentColors": [
      {
        "color": "blue",
        "meaning": "Blue symbolizes dreams, intuition, and spirituality, suggesting the dream-like nature of the choices and illusions."
      },
      {
        "color": "yellow",
        "meaning": "Yellow symbolizes optimism, happiness, and energy, reflecting the positive and hopeful aspects of wishful thinking."
      },
      {
        "color": "red",
        "meaning": "Red symbolizes passion, desire, and action, suggesting the strong emotions and desires associated with the choices presented."
      },
      {
        "color": "green",
        "meaning": "Green symbolizes growth, fertility, and abundance, suggesting the potential for growth and new opportunities among the choices."
      }
    ]
  },
  {
    "cardName": "Eight of Cups",
    "arcana": "Minor",
    "suit": "Cups",
    "cardDescription": "The Eight of Cups depicts a figure walking away from a stack of cups, symbolizing moving on, letting go, and seeking deeper meaning.",
    "meanings": [
      {
        "title": "Upright Meaning",
        "description": "In the upright position, the Eight of Cups represents moving on, letting go, seeking deeper meaning, and disillusionment. It suggests that you may be leaving behind something that no longer serves you in search of a deeper emotional fulfillment or spiritual purpose. It can also indicate a need to listen to your inner voice and follow your intuition."
      },
      {
        "title": "Reversed Meaning",
        "description": "In the reversed position, the Eight of Cups can indicate stagnation, fear of change, clinging to the past, and indecision. It suggests that you may be hesitant to let go of the past or move on from a situation, even though it may no longer be beneficial for you. It can also indicate a need to confront your fears and make a decision to move forward."
      }
    ],
    "imageFileName": "Cups08",
    "prominentSymbols": [
      {
        "symbol": "walking figure",
        "meaning": "The walking figure represents the act of moving on and seeking something more fulfilling."
      },
      {
        "symbol": "stack of cups",
        "meaning": "The stack of cups represents the emotional baggage or attachments that the figure is leaving behind."
      },
      {
        "symbol": "moon",
        "meaning": "The moon symbolizes the unconscious mind, suggesting that the figure is guided by their intuition and inner feelings."
      },
      {
        "symbol": "river",
        "meaning": "The river represents the flow of emotions and the journey toward deeper understanding."
      }
    ],
    "prominentColors": [
      {
        "color": "blue",
        "meaning": "Blue symbolizes introspection, wisdom, and truth, reflecting the inner journey of self-discovery."
      },
      {
        "color": "brown",
        "meaning": "Brown symbolizes grounding, stability, and the earth, suggesting the need to stay grounded during times of change."
      },
      {
        "color": "yellow",
        "meaning": "Yellow symbolizes enlightenment, optimism, and joy, indicating the potential for spiritual growth and new beginnings."
      },
      {
        "color": "red",
        "meaning": "Red symbolizes passion, energy, and action, suggesting the courage and determination needed to move forward."
      }
    ]
  },
  {
    "cardName": "Nine of Cups",
    "arcana": "Minor",
    "suit": "Cups",
    "cardDescription": "The Nine of Cups shows a figure sitting in front of a row of cups, symbolizing contentment, satisfaction, and emotional fulfillment.",
    "meanings": [
      {
        "title": "Upright Meaning",
        "description": "In the upright position, the Nine of Cups represents contentment, satisfaction, emotional fulfillment, gratitude, and wish fulfillment. It suggests that you are in a state of emotional satisfaction and have achieved a sense of fulfillment in your life. It can also indicate that your wishes and desires are coming true, bringing you joy and happiness."
      },
      {
        "title": "Reversed Meaning",
        "description": "In the reversed position, the Nine of Cups can indicate dissatisfaction, materialism, smugness, and unfulfilled wishes. It suggests that you may be focusing too much on material possessions or external validation, leading to a lack of true emotional fulfillment. It can also indicate a need to reevaluate your desires and priorities to find true happiness."
      }
    ],
    "imageFileName": "Cups09",
    "prominentSymbols": [
      {
        "symbol": "seated figure",
        "meaning": "The seated figure represents contentment and satisfaction with what has been achieved."
      },
      {
        "symbol": "row of cups",
        "meaning": "The row of cups symbolizes emotional fulfillment and the abundance of positive emotions."
      },
      {
        "symbol": "curtained backdrop",
        "meaning": "The curtained backdrop suggests that emotional fulfillment is an internal state, not dependent on external circumstances."
      }
    ],
    "prominentColors": [
      {
        "color": "blue",
        "meaning": "Blue symbolizes calmness, tranquility, and emotional stability, reflecting the figure's emotional state."
      },
      {
        "color": "yellow",
        "meaning": "Yellow symbolizes happiness, optimism, and joy, indicating the figure's positive emotional state."
      },
      {
        "color": "red",
        "meaning": "Red symbolizes passion, desire, and fulfillment, reflecting the emotional richness of the scene."
      },
      {
        "color": "white",
        "meaning": "White symbolizes purity, clarity, and spiritual fulfillment, suggesting a sense of inner peace and harmony."
      }
    ]
  },
  {
    "cardName": "Ten of Cups",
    "arcana": "Minor",
    "suit": "Cups",
    "cardDescription": "The Ten of Cups depicts a happy family with a rainbow of cups in the sky, symbolizing harmony, joy, and emotional contentment.",
    "meanings": [
      {
        "title": "Upright Meaning",
        "description": "In the upright position, the Ten of Cups represents harmony, joy, family happiness, emotional contentment, and fulfillment. It suggests that you are experiencing a period of emotional satisfaction and happiness, particularly within your family and close relationships. It can also indicate a sense of peace and contentment with your current life circumstances."
      },
      {
        "title": "Reversed Meaning",
        "description": "In the reversed position, the Ten of Cups can indicate a broken family, disharmony, lack of emotional connection, and disillusionment. It suggests that there may be challenges or conflicts within your family or close relationships, leading to feelings of unhappiness or discontent. It can also indicate a need to reevaluate your emotional needs and priorities to find true happiness."
      }
    ],
    "imageFileName": "Cups10",
    "prominentSymbols": [
      {
        "symbol": "happy family",
        "meaning": "The happy family symbolizes harmony, joy, and emotional fulfillment within family relationships."
      },
      {
        "symbol": "rainbow of cups",
        "meaning": "The rainbow of cups symbolizes emotional abundance, happiness, and the fulfillment of emotional desires."
      },
      {
        "symbol": "home",
        "meaning": "The home symbolizes a safe and nurturing environment where emotional fulfillment can be found."
      },
      {
        "symbol": "green landscape",
        "meaning": "The green landscape symbolizes growth, abundance, and prosperity, reflecting the emotional richness of the scene."
      }
    ],
    "prominentColors": [
      {
        "color": "blue",
        "meaning": "Blue symbolizes calmness, tranquility, and emotional stability, reflecting the harmonious nature of the scene."
      },
      {
        "color": "green",
        "meaning": "Green symbolizes growth, abundance, and prosperity, indicating the emotional richness of the family's life."
      },
      {
        "color": "yellow",
        "meaning": "Yellow symbolizes happiness, optimism, and joy, reflecting the family's emotional state."
      },
      {
        "color": "red",
        "meaning": "Red symbolizes passion, love, and emotional intensity, suggesting the deep emotional connections within the family."
      }
    ]
  },
  {
    "cardName": "Page of Cups",
    "arcana": "Minor",
    "suit": "Cups",
    "cardDescription": "The Page of Cups shows a young figure holding a cup with a fish in it, symbolizing curiosity, creativity, and emotional beginnings.",
    "meanings": [
      {
        "title": "Upright Meaning",
        "description": "In the upright position, the Page of Cups represents curiosity, creativity, emotional beginnings, intuition, and new opportunities. It suggests that you are open to exploring your emotions and creative ideas, and you may be at the beginning of a new emotional or creative journey. It can also indicate the emergence of intuitive insights and the potential for new emotional experiences."
      },
      {
        "title": "Reversed Meaning",
        "description": "In the reversed position, the Page of Cups can indicate emotional immaturity, creative blocks, moodiness, and insecurity. It suggests that you may be struggling to express your emotions or creative ideas effectively, leading to feelings of frustration or insecurity. It can also indicate a need to work through emotional issues or insecurities to allow for personal growth and creative expression."
      }
    ],
    "imageFileName": "Cups11",
    "prominentSymbols": [
      {
        "symbol": "young figure",
        "meaning": "The young figure symbolizes youthfulness, innocence, and a fresh perspective."
      },
      {
        "symbol": "cup with fish",
        "meaning": "The cup with a fish symbolizes emotional depth, intuition, and the subconscious mind."
      },
      {
        "symbol": "waves",
        "meaning": "The waves symbolize the ebb and flow of emotions, reflecting the emotional nature of the Page."
      },
      {
        "symbol": "floral hat",
        "meaning": "The floral hat symbolizes creativity, imagination, and the potential for new ideas."
      }
    ],
    "prominentColors": [
      {
        "color": "blue",
        "meaning": "Blue symbolizes calmness, tranquility, and emotional depth, reflecting the emotional nature of the card."
      },
      {
        "color": "yellow",
        "meaning": "Yellow symbolizes happiness, optimism, and creativity, suggesting the potential for new beginnings."
      },
      {
        "color": "pink",
        "meaning": "Pink symbolizes love, compassion, and emotional sensitivity, reflecting the emotional depth of the Page."
      },
      {
        "color": "white",
        "meaning": "White symbolizes purity, innocence, and a fresh start, suggesting the youthfulness of the Page."
      }
    ]
  },
  {
    "cardName": "Knight of Cups",
    "arcana": "Minor",
    "suit": "Cups",
    "cardDescription": "The Knight of Cups rides gracefully on a horse, holding a cup, symbolizing charm, romance, and a quest for emotional fulfillment.",
    "meanings": [
      {
        "title": "Upright Meaning",
        "description": "In the upright position, the Knight of Cups represents charm, romance, idealism, artistic nature, and following the heart. It suggests that you may be in touch with your emotions and are willing to express them in a creative or romantic way. It can also indicate a quest for emotional fulfillment and a willingness to pursue your dreams and desires."
      },
      {
        "title": "Reversed Meaning",
        "description": "In the reversed position, the Knight of Cups can indicate moodiness, disillusionment, unrealistic expectations, and jealousy. It suggests that you may be overly focused on romantic ideals or artistic pursuits, leading to feelings of disappointment or dissatisfaction. It can also indicate a need to be more realistic in your approach to relationships and creative endeavors."
      }
    ],
    "imageFileName": "Cups12",
    "prominentSymbols": [
      {
        "symbol": "knight",
        "meaning": "The knight symbolizes action, adventure, and the pursuit of ideals, reflecting the Knight's quest for emotional fulfillment."
      },
      {
        "symbol": "horse",
        "meaning": "The horse symbolizes power, strength, and grace, reflecting the Knight's graceful and charming nature."
      },
      {
        "symbol": "cup",
        "meaning": "The cup symbolizes emotions, intuition, and the heart, reflecting the Knight's emotional depth and romantic nature."
      },
      {
        "symbol": "river",
        "meaning": "The river symbolizes emotions, flow, and movement, reflecting the Knight's emotional and creative energy."
      }
    ],
    "prominentColors": [
      {
        "color": "blue",
        "meaning": "Blue symbolizes calmness, tranquility, and emotional depth, reflecting the emotional nature of the Knight."
      },
      {
        "color": "yellow",
        "meaning": "Yellow symbolizes happiness, optimism, and creativity, suggesting the Knight's idealistic nature."
      },
      {
        "color": "red",
        "meaning": "Red symbolizes passion, desire, and romance, reflecting the Knight's romantic nature."
      },
      {
        "color": "white",
        "meaning": "White symbolizes purity, innocence, and spirituality, suggesting the Knight's pure intentions."
      }
    ]
  },
  {
    "cardName": "Queen of Cups",
    "arcana": "Minor",
    "suit": "Cups",
    "cardDescription": "The Queen of Cups sits on a throne by the sea, holding an ornate cup. She symbolizes compassion, intuition, and emotional security.",
    "meanings": [
      {
        "title": "Upright Meaning",
        "description": "In the upright position, the Queen of Cups represents compassion, intuition, emotional security, nurturing, and empathy. It suggests that you are emotionally balanced and in tune with your feelings and the feelings of others. You may be a source of comfort and support for those around you, and you approach life with kindness and understanding."
      },
      {
        "title": "Reversed Meaning",
        "description": "In the reversed position, the Queen of Cups can indicate emotional insecurity, codependency, manipulation, and moodiness. It suggests that you may be struggling with your emotions or relying too heavily on others for emotional support. It can also indicate a need to be more aware of your own feelings and boundaries."
      }
    ],
    "imageFileName": "Cups13",
    "prominentSymbols": [
      {
        "symbol": "queen",
        "meaning": "The queen symbolizes compassion, nurturing, and emotional depth, reflecting the Queen's empathetic nature."
      },
      {
        "symbol": "throne",
        "meaning": "The throne symbolizes authority, power, and stability, reflecting the Queen's emotional security."
      },
      {
        "symbol": "ornate cup",
        "meaning": "The ornate cup symbolizes emotions, intuition, and spirituality, reflecting the Queen's deep emotional connection."
      },
      {
        "symbol": "sea",
        "meaning": "The sea symbolizes emotions, depth, and the subconscious mind, reflecting the Queen's emotional depth and intuition."
      }
    ],
    "prominentColors": [
      {
        "color": "blue",
        "meaning": "Blue symbolizes calmness, tranquility, and emotional depth, reflecting the Queen's emotional stability."
      },
      {
        "color": "yellow",
        "meaning": "Yellow symbolizes happiness, optimism, and creativity, suggesting the Queen's nurturing and empathetic nature."
      },
      {
        "color": "red",
        "meaning": "Red symbolizes passion, desire, and emotion, reflecting the Queen's emotional intensity."
      },
      {
        "color": "white",
        "meaning": "White symbolizes purity, innocence, and spirituality, suggesting the Queen's pure intentions."
      }
    ]
  },
  {
    "cardName": "King of Cups",
    "arcana": "Minor",
    "suit": "Cups",
    "cardDescription": "The King of Cups sits on a throne surrounded by water, holding a cup and a scepter. He represents emotional balance, diplomacy, and wisdom.",
    "meanings": [
      {
        "title": "Upright Meaning",
        "description": "In the upright position, the King of Cups represents emotional balance, diplomacy, wisdom, calmness, and fairness. It suggests that you are in control of your emotions and are able to approach situations with empathy and understanding. You may be seen as a peacemaker and a source of stability for others."
      },
      {
        "title": "Reversed Meaning",
        "description": "In the reversed position, the King of Cups can indicate emotional manipulation, volatility, detachment, and moodiness. It suggests that you may be struggling to control your emotions or may be using them to manipulate others. It can also indicate a need to be more in touch with your feelings and to express them in a healthy way."
      }
    ],
    "imageFileName": "Cups14",
    "prominentSymbols": [
      {
        "symbol": "king",
        "meaning": "The king symbolizes authority, leadership, and control, reflecting the King's emotional maturity and stability."
      },
      {
        "symbol": "throne",
        "meaning": "The throne symbolizes authority, power, and stability, reflecting the King's emotional control and balance."
      },
      {
        "symbol": "cup",
        "meaning": "The cup symbolizes emotions, intuition, and spirituality, reflecting the King's deep emotional understanding."
      },
      {
        "symbol": "scepter",
        "meaning": "The scepter symbolizes authority, leadership, and control, reflecting the King's emotional authority."
      },
      {
        "symbol": "water",
        "meaning": "Water symbolizes emotions, intuition, and the subconscious mind, reflecting the King's deep emotional connection."
      }
    ],
    "prominentColors": [
      {
        "color": "blue",
        "meaning": "Blue symbolizes calmness, tranquility, and emotional depth, reflecting the King's emotional stability."
      },
      {
        "color": "yellow",
        "meaning": "Yellow symbolizes happiness, optimism, and creativity, suggesting the King's emotional warmth and openness."
      },
      {
        "color": "red",
        "meaning": "Red symbolizes passion, desire, and emotion, reflecting the King's emotional intensity."
      },
      {
        "color": "green",
        "meaning": "Green symbolizes growth, healing, and balance, suggesting the King's emotional maturity and balance."
      }
    ]
  },
  {
    "cardName": "Ace of Swords",
    "arcana": "Minor",
    "suit": "Swords",
    "cardDescription": "The Ace of Swords depicts a hand holding a sword upright, symbolizing clarity, breakthroughs, and new ideas.",
    "meanings": [
      {
        "title": "Upright Meaning",
        "description": "In the upright position, the Ace of Swords represents clarity, breakthroughs, new ideas, mental clarity, and truth. It suggests that you may be experiencing a moment of clarity or a new perspective that allows you to see things more clearly. It can also indicate a breakthrough in your thinking or a new idea that leads to success."
      },
      {
        "title": "Reversed Meaning",
        "description": "In the reversed position, the Ace of Swords can indicate confusion, misinformation, lack of clarity, or indecision. It suggests that you may be feeling overwhelmed or unable to see things clearly. It can also indicate that you may need to take a step back and reassess the situation before moving forward."
      }
    ],
    "imageFileName": "Swords01",
    "prominentSymbols": [
      {
        "symbol": "hand",
        "meaning": "The hand symbolizes power, action, and control, reflecting the ability to grasp opportunities and take decisive action."
      },
      {
        "symbol": "upright sword",
        "meaning": "The upright sword symbolizes clarity, truth, and mental strength, reflecting the ability to cut through confusion and see things clearly."
      },
      {
        "symbol": "crown",
        "meaning": "The crown symbolizes victory, success, and authority, reflecting the potential for success and achievement."
      },
      {
        "symbol": "clouds",
        "meaning": "The clouds symbolize confusion, uncertainty, and lack of clarity, reflecting the need to clear away mental fog and gain clarity."
      }
    ],
    "prominentColors": [
      {
        "color": "blue",
        "meaning": "Blue symbolizes clarity, communication, and truth, reflecting the card's themes of mental clarity and truth."
      },
      {
        "color": "yellow",
        "meaning": "Yellow symbolizes clarity, optimism, and energy, reflecting the card's themes of mental clarity and new ideas."
      },
      {
        "color": "gray",
        "meaning": "Gray symbolizes neutrality, balance, and stability, reflecting the need to find balance and stability in your thoughts."
      },
      {
        "color": "white",
        "meaning": "White symbolizes purity, clarity, and truth, reflecting the card's themes of mental clarity and truth."
      }
    ]
  },
  {
    "cardName": "Two of Swords",
    "arcana": "Minor",
    "suit": "Swords",
    "cardDescription": "The Two of Swords shows a blindfolded figure holding two crossed swords, symbolizing indecision, stalemate, and blocked emotions.",
    "meanings": [
      {
        "title": "Upright Meaning",
        "description": "In the upright position, the Two of Swords represents indecision, stalemate, blocked emotions, denial, and truce. It suggests that you may be facing a situation where you are unable or unwilling to make a decision, leading to a state of limbo or stalemate. It can also indicate a need to confront your emotions and address any issues that are being ignored."
      },
      {
        "title": "Reversed Meaning",
        "description": "In the reversed position, the Two of Swords can indicate clarity, decision-making, resolution of conflict, and openness. It suggests that you may have gained a new perspective or insight that allows you to see things more clearly and make decisions with confidence. It can also indicate a willingness to address conflicts or confront difficult emotions."
      }
    ],
    "imageFileName": "Swords02",
    "prominentSymbols": [
      {
        "symbol": "blindfolded figure",
        "meaning": "The blindfolded figure symbolizes a lack of clarity or insight, reflecting the inability to see the situation clearly or make a decision."
      },
      {
        "symbol": "crossed swords",
        "meaning": "The crossed swords symbolize conflict, decision-making, and the need to make a choice, reflecting the indecision and stalemate of the situation."
      },
      {
        "symbol": "moon",
        "meaning": "The moon symbolizes illusion, confusion, and hidden emotions, reflecting the need to confront emotions that are being blocked or ignored."
      },
      {
        "symbol": "sea",
        "meaning": "The sea symbolizes the subconscious mind, emotions, and hidden depths, reflecting the emotional turmoil and blocked emotions of the situation."
      }
    ],
    "prominentColors": [
      {
        "color": "blue",
        "meaning": "Blue symbolizes clarity, communication, and truth, reflecting the need to find clarity and make decisions."
      },
      {
        "color": "white",
        "meaning": "White symbolizes clarity, purity, and truth, reflecting the need to see the situation clearly and make decisions based on truth."
      },
      {
        "color": "gray",
        "meaning": "Gray symbolizes neutrality, balance, and stability, reflecting the need to find balance and stability in your decisions."
      },
      {
        "color": "black",
        "meaning": "Black symbolizes mystery, hidden emotions, and the unknown, reflecting the hidden emotions and conflicts of the situation."
      }
    ]
  },
  {
    "cardName": "Three of Swords",
    "arcana": "Minor",
    "suit": "Swords",
    "cardDescription": "The Three of Swords depicts a heart pierced by three swords, representing heartbreak, sorrow, and betrayal.",
    "meanings": [
      {
        "title": "Upright Meaning",
        "description": "In the upright position, the Three of Swords represents heartbreak, sorrow, betrayal, loss, and painful separation. It suggests that you may be experiencing emotional pain or suffering due to a breakup, betrayal, or loss. It can also indicate a need to process and heal from past wounds before moving forward."
      },
      {
        "title": "Reversed Meaning",
        "description": "In the reversed position, the Three of Swords can indicate healing, reconciliation, forgiveness, and the release of pain. It suggests that you may be moving towards healing and reconciliation in a difficult situation. It can also indicate a need to let go of past hurt and embrace forgiveness in order to move forward."
      }
    ],
    "imageFileName": "Swords03",
    "prominentSymbols": [
      {
        "symbol": "pierced heart",
        "meaning": "The pierced heart symbolizes emotional pain, heartbreak, and sorrow, reflecting the pain and suffering experienced in the situation."
      },
      {
        "symbol": "three swords",
        "meaning": "The three swords symbolize betrayal, loss, and painful separation, reflecting the causes of the emotional pain."
      },
      {
        "symbol": "clouds",
        "meaning": "The clouds symbolize confusion, sadness, and emotional turmoil, reflecting the emotional state of the person experiencing the heartbreak."
      },
      {
        "symbol": "rain",
        "meaning": "The rain symbolizes tears, cleansing, and emotional release, reflecting the need to release pent-up emotions and heal from the pain."
      }
    ],
    "prominentColors": [
      {
        "color": "red",
        "meaning": "Red symbolizes passion, anger, and intense emotions, reflecting the intense emotional pain and heartbreak experienced."
      },
      {
        "color": "gray",
        "meaning": "Gray symbolizes sadness, depression, and gloom, reflecting the emotional state of the person experiencing the heartbreak."
      },
      {
        "color": "black",
        "meaning": "Black symbolizes mourning, loss, and the unknown, reflecting the feelings of loss and betrayal experienced."
      },
      {
        "color": "blue",
        "meaning": "Blue symbolizes sadness, tears, and emotional depth, reflecting the depth of the emotional pain and sorrow experienced."
      }
    ]
  },
  {
    "cardName": "Four of Swords",
    "arcana": "Minor",
    "suit": "Swords",
    "cardDescription": "The Four of Swords shows a figure lying in repose, with swords hanging above. It represents rest, recovery, and contemplation.",
    "meanings": [
      {
        "title": "Upright Meaning",
        "description": "In the upright position, the Four of Swords represents rest, recovery, contemplation, meditation, and peace. It suggests that you may need to take a break from your current situation to rest and recharge. It can also indicate a period of reflection and contemplation to gain clarity and perspective."
      },
      {
        "title": "Reversed Meaning",
        "description": "In the reversed position, the Four of Swords can indicate exhaustion, burnout, stress, restlessness, and lack of progress. It suggests that you may be pushing yourself too hard and need to take a step back to avoid burnout. It can also indicate a need to find new ways to relax and recharge."
      }
    ],
    "imageFileName": "Swords04",
    "prominentSymbols": [
      {
        "symbol": "reposing figure",
        "meaning": "The reposing figure symbolizes rest, relaxation, and taking a break from the demands of life or a situation."
      },
      {
        "symbol": "hanging swords",
        "meaning": "The hanging swords symbolize the need to be alert and prepared, even during times of rest and recovery."
      },
      {
        "symbol": "stained glass window",
        "meaning": "The stained glass window symbolizes spirituality, reflection, and inner peace, suggesting that the rest and recovery should include a spiritual or reflective element."
      }
    ],
    "prominentColors": [
      {
        "color": "blue",
        "meaning": "Blue symbolizes calmness, peace, and tranquility, reflecting the peaceful and contemplative nature of the card."
      },
      {
        "color": "yellow",
        "meaning": "Yellow symbolizes mental clarity, energy, and optimism, suggesting that the period of rest and recovery will lead to mental clarity and renewed energy."
      },
      {
        "color": "gray",
        "meaning": "Gray symbolizes neutrality, balance, and stability, suggesting that the rest and recovery will bring about a sense of balance and stability."
      },
      {
        "color": "red",
        "meaning": "Red symbolizes passion, vitality, and action, suggesting that the rest and recovery will lead to a renewed sense of passion and vitality."
      }
    ]
  },
  {
    "cardName": "Five of Swords",
    "arcana": "Minor",
    "suit": "Swords",
    "cardDescription": "The Five of Swords depicts a figure holding three swords while two others are discarded, symbolizing conflict, betrayal, and winning at all costs.",
    "meanings": [
      {
        "title": "Upright Meaning",
        "description": "In the upright position, the Five of Swords represents conflict, betrayal, loss, winning at all costs, and tension. It suggests that there may be a situation in your life where conflicts or disagreements are causing tension and disharmony. It can also indicate a need to be wary of betrayal or deceitful behavior from others."
      },
      {
        "title": "Reversed Meaning",
        "description": "In the reversed position, the Five of Swords can indicate reconciliation, making amends, addressing past resentments, and forgiveness. It suggests that conflicts or disagreements may be resolved, leading to a more harmonious relationship or situation. It can also indicate a need to let go of past grievances and forgive others."
      }
    ],
    "imageFileName": "Swords05",
    "prominentSymbols": [
      {
        "symbol": "smirking figure",
        "meaning": "The smirking figure symbolizes someone who may be acting in a deceitful or manipulative manner, suggesting that caution is needed in your interactions with others."
      },
      {
        "symbol": "discarded swords",
        "meaning": "The discarded swords symbolize the idea of letting go of past conflicts or battles, suggesting that it may be time to move on from a situation that is causing tension or conflict."
      },
      {
        "symbol": "stormy sky",
        "meaning": "The stormy sky symbolizes the turbulent emotions and tensions associated with conflict and betrayal, suggesting that the situation may be emotionally charged."
      }
    ],
    "prominentColors": [
      {
        "color": "gray",
        "meaning": "Gray symbolizes neutrality and balance, suggesting that it may be necessary to find a balanced and fair resolution to conflicts."
      },
      {
        "color": "blue",
        "meaning": "Blue symbolizes communication and clarity, suggesting that clear and honest communication may be needed to resolve conflicts."
      },
      {
        "color": "yellow",
        "meaning": "Yellow symbolizes optimism and energy, suggesting that a positive and proactive approach may be needed to address conflicts."
      },
      {
        "color": "green",
        "meaning": "Green symbolizes growth and renewal, suggesting that conflicts may lead to personal growth and positive change if handled constructively."
      }
    ]
  },
  {
    "cardName": "Six of Swords",
    "arcana": "Minor",
    "suit": "Swords",
    "cardDescription": "The Six of Swords shows a figure being ferried across water, symbolizing transition, moving on, and finding solace.",
    "meanings": [
      {
        "title": "Upright Meaning",
        "description": "In the upright position, the Six of Swords represents transition, moving on, finding solace, and journeying to a calmer place. It suggests that you are in a period of transition or change, and while it may be challenging, there is a sense of moving towards a more peaceful and stable situation. It can also indicate a journey, either physical or metaphorical, that will lead to a better place."
      },
      {
        "title": "Reversed Meaning",
        "description": "In the reversed position, the Six of Swords can indicate stagnation, emotional baggage, unresolved issues, and resistance to change. It suggests that you may be finding it difficult to move on from a challenging situation or that there are unresolved issues from the past that are holding you back. It can also indicate a reluctance to embrace change or a fear of the unknown."
      }
    ],
    "imageFileName": "Swords06",
    "prominentSymbols": [
      {
        "symbol": "boat",
        "meaning": "The boat symbolizes the journey or transition that you are currently experiencing. It suggests that you are moving from one phase of life to another, and while it may be challenging, there is hope for a better future."
      },
      {
        "symbol": "figure with child",
        "meaning": "The figure with a child symbolizes the need to protect and care for others, suggesting that you may be responsible for guiding others through a difficult time."
      },
      {
        "symbol": "six swords",
        "meaning": "The six swords symbolize the challenges and obstacles that you may face during this transition. They suggest that while the journey may be difficult, it is necessary for your growth and development."
      },
      {
        "symbol": "calm water",
        "meaning": "The calm water symbolizes the emotional calm and clarity that can come from moving on from a challenging situation. It suggests that while there may be turbulence ahead, there is also the promise of a peaceful resolution."
      }
    ],
    "prominentColors": [
      {
        "color": "blue",
        "meaning": "Blue symbolizes peace and tranquility, suggesting that while the journey may be difficult, there is the promise of a peaceful resolution."
      },
      {
        "color": "gray",
        "meaning": "Gray symbolizes neutrality and balance, suggesting that you may need to find a balanced approach to navigating this transition."
      },
      {
        "color": "yellow",
        "meaning": "Yellow symbolizes optimism and hope, suggesting that there is the promise of a brighter future ahead."
      },
      {
        "color": "brown",
        "meaning": "Brown symbolizes stability and grounding, suggesting that while the journey may be challenging, you have the strength and stability to overcome it."
      }
    ]
  },
  {
    "cardName": "Seven of Swords",
    "arcana": "Minor",
    "suit": "Swords",
    "cardDescription": "The Seven of Swords depicts a figure sneaking away with five swords, leaving two behind, symbolizing deception, strategy, and evasion.",
    "meanings": [
      {
        "title": "Upright Meaning",
        "description": "In the upright position, the Seven of Swords represents deception, strategy, stealth, tactics, and resourcefulness. It suggests that you may need to use your wit and cunning to navigate a tricky situation or that someone may be trying to deceive you. It can also indicate a need to be strategic in your actions and to think carefully before making a move."
      },
      {
        "title": "Reversed Meaning",
        "description": "In the reversed position, the Seven of Swords can indicate coming clean, facing consequences, honesty, and confession. It suggests that the time for deception and evasion is over, and it is time to be honest and face the consequences of your actions. It can also indicate a need to confess to something you have been hiding or to be honest about your intentions."
      }
    ],
    "imageFileName": "Swords07",
    "prominentSymbols": [
      {
        "symbol": "sneaky figure",
        "meaning": "The sneaky figure symbolizes deception and stealth, suggesting that someone may be trying to deceive you or that you may need to be careful about being deceived."
      },
      {
        "symbol": "five swords",
        "meaning": "The five swords symbolize the deception and strategy involved in the situation. They suggest that there may be hidden motives or agendas at play."
      },
      {
        "symbol": "two left behind",
        "meaning": "The two swords left behind symbolize the consequences of deception and dishonesty. They suggest that while deception may seem like a good strategy in the short term, it can lead to negative consequences in the long run."
      },
      {
        "symbol": "camp",
        "meaning": "The camp in the background symbolizes the need to be wary of your surroundings and to be prepared for any challenges that may arise."
      }
    ],
    "prominentColors": [
      {
        "color": "yellow",
        "meaning": "Yellow symbolizes caution and warning, suggesting that you need to be cautious about being deceived or about deceiving others."
      },
      {
        "color": "blue",
        "meaning": "Blue symbolizes truth and honesty, suggesting that it may be time to be honest and face the consequences of your actions."
      },
      {
        "color": "green",
        "meaning": "Green symbolizes growth and renewal, suggesting that being honest and facing the consequences can lead to personal growth and renewal."
      },
      {
        "color": "red",
        "meaning": "Red symbolizes danger and warning, suggesting that there may be danger ahead if you continue to deceive or be deceived."
      }
    ]
  },
  {
    "cardName": "Eight of Swords",
    "arcana": "Minor",
    "suit": "Swords",
    "cardDescription": "The Eight of Swords shows a blindfolded figure surrounded by swords, symbolizing feeling trapped, restricted, and self-imposed limitations.",
    "meanings": [
      {
        "title": "Upright Meaning",
        "description": "In the upright position, the Eight of Swords represents feeling trapped, restricted, and experiencing self-imposed limitations. It can indicate that you may be feeling stuck in a situation where you perceive there to be no way out. This card often suggests that the limitations you are experiencing are more mental than physical and that you have the power to free yourself from them."
      },
      {
        "title": "Reversed Meaning",
        "description": "In the reversed position, the Eight of Swords can indicate self-liberation, release, overcoming obstacles, and gaining a new perspective. It suggests that you are finding ways to free yourself from the limitations that have been holding you back. You may be gaining a new understanding of your situation and seeing things from a different point of view."
      }
    ],
    "imageFileName": "Swords08",
    "prominentSymbols": [
      {
        "symbol": "blindfolded figure",
        "meaning": "The blindfolded figure symbolizes feeling blinded or unaware of the possibilities around you. It suggests that you may not be seeing things clearly and that you may need to remove the blindfold to see the situation more clearly."
      },
      {
        "symbol": "eight swords",
        "meaning": "The eight swords surrounding the figure symbolize the feeling of being surrounded by obstacles and limitations. They suggest that you may feel trapped or restricted in your current circumstances."
      },
      {
        "symbol": "water",
        "meaning": "The water at the figure's feet symbolizes emotions and intuition. It suggests that your emotions may be clouding your judgment and contributing to your feelings of being trapped."
      },
      {
        "symbol": "castle",
        "meaning": "The castle in the background symbolizes safety and security. It suggests that while you may feel trapped now, there is a way out if you can find the courage to break free."
      }
    ],
    "prominentColors": [
      {
        "color": "blue",
        "meaning": "Blue symbolizes clarity and communication. It suggests that you may need to communicate your feelings and thoughts more clearly to break free from your limitations."
      },
      {
        "color": "gray",
        "meaning": "Gray symbolizes uncertainty and confusion. It suggests that you may be feeling unsure about how to proceed and that you may need to take some time to reflect on your situation."
      },
      {
        "color": "yellow",
        "meaning": "Yellow symbolizes positivity and optimism. It suggests that you have the power to overcome your limitations and that a brighter future is possible."
      },
      {
        "color": "brown",
        "meaning": "Brown symbolizes stability and grounding. It suggests that you may need to ground yourself in reality and take practical steps to free yourself from your limitations."
      }
    ]
  },
  {
    "cardName": "Nine of Swords",
    "arcana": "Minor",
    "suit": "Swords",
    "cardDescription": "The Nine of Swords depicts a figure sitting up in bed, hands over their face, with nine swords on the wall, symbolizing worry, anxiety, and nightmares.",
    "meanings": [
      {
        "title": "Upright Meaning",
        "description": "In the upright position, the Nine of Swords represents worry, anxiety, nightmares, and mental torment. It indicates that you may be feeling overwhelmed by negative thoughts and fears, leading to sleepless nights and feelings of guilt or regret. This card often suggests that your worries are unfounded and that you may be blowing things out of proportion."
      },
      {
        "title": "Reversed Meaning",
        "description": "In the reversed position, the Nine of Swords can indicate the release of worry, finding hope, overcoming fear, and moving past guilt. It suggests that you are beginning to see things more positively and that you are finding ways to overcome your anxieties. You may be finding hope in a difficult situation and realizing that things are not as bad as they seem."
      }
    ],
    "imageFileName": "Swords09",
    "prominentSymbols": [
      {
        "symbol": "anguished figure",
        "meaning": "The anguished figure sitting up in bed symbolizes worry, anxiety, and mental torment. It suggests that you may be feeling overwhelmed by negative thoughts and fears."
      },
      {
        "symbol": "nine swords",
        "meaning": "The nine swords on the wall symbolize the worries and fears that are keeping you awake at night. They suggest that your anxieties may be unfounded and that you may be blowing things out of proportion."
      },
      {
        "symbol": "darkness",
        "meaning": "The darkness in the room symbolizes the deep despair and hopelessness that can accompany anxiety and worry. It suggests that you may be feeling lost and unsure of how to move forward."
      },
      {
        "symbol": "bed",
        "meaning": "The bed symbolizes rest and relaxation. It suggests that your worries may be interfering with your ability to rest and that you may need to find ways to calm your mind."
      }
    ],
    "prominentColors": [
      {
        "color": "blue",
        "meaning": "Blue symbolizes sadness and depression. It suggests that your worries may be causing you to feel sad and hopeless."
      },
      {
        "color": "gray",
        "meaning": "Gray symbolizes uncertainty and fear. It suggests that your worries may be causing you to feel unsure about the future and fearful of what lies ahead."
      },
      {
        "color": "yellow",
        "meaning": "Yellow symbolizes positivity and hope. It suggests that you may be finding hope and optimism in a difficult situation."
      },
      {
        "color": "red",
        "meaning": "Red symbolizes passion and intensity. It suggests that your worries may be causing you to feel intense emotions and that you may need to find ways to calm your mind."
      }
    ]
  },
  {
    "cardName": "Ten of Swords",
    "arcana": "Minor",
    "suit": "Swords",
    "cardDescription": "The Ten of Swords shows a figure lying face down with ten swords in their back, symbolizing betrayal, loss, and a need to let go.",
    "meanings": [
      {
        "title": "Upright Meaning",
        "description": "In the upright position, the Ten of Swords represents betrayal, loss, the end of a cycle, backstabbing, and the need to let go. It indicates that you may have experienced a sudden and unexpected betrayal or loss, leaving you feeling defeated and overwhelmed. This card often suggests that it is time to let go of the past and move on from a painful situation."
      },
      {
        "title": "Reversed Meaning",
        "description": "In the reversed position, the Ten of Swords can indicate recovery, resilience, moving on, release of pain, and forgiveness. It suggests that you are beginning to recover from a painful experience and that you are finding the strength to move on. This card often indicates that you are learning to forgive yourself and others for past mistakes."
      }
    ],
    "imageFileName": "Swords10",
    "prominentSymbols": [
      {
        "symbol": "fallen figure",
        "meaning": "The fallen figure symbolizes defeat and betrayal. It suggests that you may have been blindsided by a betrayal or loss, leaving you feeling overwhelmed and defeated."
      },
      {
        "symbol": "ten swords",
        "meaning": "The ten swords in the figure's back symbolize the pain and suffering that can come from betrayal and loss. They suggest that you may be feeling overwhelmed by negative emotions and that you may need to find ways to release this pain."
      },
      {
        "symbol": "dark sky",
        "meaning": "The dark sky symbolizes the darkness and despair that can accompany betrayal and loss. It suggests that you may be feeling lost and hopeless."
      },
      {
        "symbol": "dawn",
        "meaning": "The dawn breaking on the horizon symbolizes hope and new beginnings. It suggests that while you may be going through a difficult time, there is light on the horizon and that better days are ahead."
      }
    ],
    "prominentColors": [
      {
        "color": "black",
        "meaning": "Black symbolizes darkness and despair. It suggests that you may be feeling overwhelmed by negative emotions and that you may need to find ways to bring light into your life."
      },
      {
        "color": "red",
        "meaning": "Red symbolizes pain and suffering. It suggests that you may be experiencing intense emotions as a result of betrayal and loss."
      },
      {
        "color": "yellow",
        "meaning": "Yellow symbolizes hope and optimism. It suggests that while you may be going through a difficult time, there is hope for a brighter future."
      },
      {
        "color": "blue",
        "meaning": "Blue symbolizes sadness and depression. It suggests that you may be feeling overwhelmed by negative emotions and that you may need to find ways to lift your spirits."
      }
    ]
  },
  {
    "cardName": "Page of Swords",
    "arcana": "Minor",
    "suit": "Swords",
    "cardDescription": "The Page of Swords shows a young figure holding a sword, symbolizing curiosity, mental agility, and a thirst for knowledge.",
    "meanings": [
      {
        "title": "Upright Meaning",
        "description": "In the upright position, the Page of Swords represents curiosity, mental agility, a thirst for knowledge, new ideas, and vigilance. It suggests that you are eager to learn and explore new ideas and that you are intellectually curious. This card often indicates that you are alert and aware of your surroundings, ready to take on new challenges and opportunities."
      },
      {
        "title": "Reversed Meaning",
        "description": "In the reversed position, the Page of Swords can indicate deception, manipulation, gossip, lack of planning, and hasty decisions. It suggests that you may be prone to jumping to conclusions or making decisions without considering all the facts. This card often indicates that you need to be more careful and thoughtful in your actions."
      }
    ],
    "imageFileName": "Swords11",
    "prominentSymbols": [
      {
        "symbol": "young figure",
        "meaning": "The young figure symbolizes youth and curiosity. It suggests that you are eager to learn and explore new ideas."
      },
      {
        "symbol": "sword",
        "meaning": "The sword symbolizes intellect and mental agility. It suggests that you are sharp and quick-witted."
      },
      {
        "symbol": "windy clouds",
        "meaning": "The windy clouds symbolize change and movement. They suggest that you are open to new ideas and experiences."
      },
      {
        "symbol": "birds",
        "meaning": "The birds symbolize communication and messages. They suggest that you are receptive to new information and ideas."
      }
    ],
    "prominentColors": [
      {
        "color": "yellow",
        "meaning": "Yellow symbolizes intellect and curiosity. It suggests that you are eager to learn and explore new ideas."
      },
      {
        "color": "blue",
        "meaning": "Blue symbolizes mental clarity and communication. It suggests that you are sharp and quick-witted."
      },
      {
        "color": "green",
        "meaning": "Green symbolizes growth and change. It suggests that you are open to new ideas and experiences."
      },
      {
        "color": "red",
        "meaning": "Red symbolizes passion and energy. It suggests that you are enthusiastic about learning and exploring new ideas."
      }
    ]
  },
  {
    "cardName": "Knight of Swords",
    "arcana": "Minor",
    "suit": "Swords",
    "cardDescription": "The Knight of Swords depicts a knight charging forward on a horse, symbolizing action, ambition, and a pursuit of truth.",
    "meanings": [
      {
        "title": "Upright Meaning",
        "description": "In the upright position, the Knight of Swords represents action, ambition, a pursuit of truth, assertiveness, and directness. It suggests that you are ready to take on challenges and pursue your goals with determination. This card often indicates that you are assertive and decisive, willing to take risks to achieve your objectives."
      },
      {
        "title": "Reversed Meaning",
        "description": "In the reversed position, the Knight of Swords can indicate impulsiveness, haste, disregard for consequences, aggression, and recklessness. It suggests that you may be acting impulsively or without thinking things through, leading to potential conflicts or negative outcomes. This card often indicates that you need to slow down and consider the consequences of your actions."
      }
    ],
    "imageFileName": "Swords12",
    "prominentSymbols": [
      {
        "symbol": "charging knight",
        "meaning": "The charging knight symbolizes action and ambition. It suggests that you are ready to take on challenges and pursue your goals."
      },
      {
        "symbol": "horse",
        "meaning": "The horse symbolizes speed and energy. It suggests that you are moving forward with determination and purpose."
      },
      {
        "symbol": "sword",
        "meaning": "The sword symbolizes truth and justice. It suggests that you are pursuing the truth and seeking justice."
      },
      {
        "symbol": "stormy sky",
        "meaning": "The stormy sky symbolizes conflict and challenges. It suggests that you may face obstacles or difficulties on your path."
      }
    ],
    "prominentColors": [
      {
        "color": "blue",
        "meaning": "Blue symbolizes intellect and communication. It suggests that you are assertive and direct in your communication."
      },
      {
        "color": "yellow",
        "meaning": "Yellow symbolizes energy and ambition. It suggests that you are driven to achieve your goals."
      },
      {
        "color": "white",
        "meaning": "White symbolizes purity and truth. It suggests that you are seeking the truth and pursuing justice."
      },
      {
        "color": "red",
        "meaning": "Red symbolizes passion and aggression. It suggests that you are assertive and determined in your actions."
      }
    ]
  },
  {
    "cardName": "Queen of Swords",
    "arcana": "Minor",
    "suit": "Swords",
    "cardDescription": "The Queen of Swords sits on her throne, holding a sword upright, symbolizing clarity, independence, and unbiased judgment.",
    "meanings": [
      {
        "title": "Upright Meaning",
        "description": "In the upright position, the Queen of Swords represents clarity, independence, unbiased judgment, direct communication, and perception. It suggests that you are able to see situations clearly and make decisions based on logic and reason. This card often indicates that you are independent and self-sufficient, able to rely on your own judgment."
      },
      {
        "title": "Reversed Meaning",
        "description": "In the reversed position, the Queen of Swords can indicate coldness, bitterness, harsh criticism, deceit, and manipulation. It suggests that you may be using your sharp intellect and communication skills to manipulate others or to criticize them unfairly. This card often indicates that you need to be careful with your words and actions, as they can have a negative impact on others."
      }
    ],
    "imageFileName": "Swords13",
    "prominentSymbols": [
      {
        "symbol": "queen",
        "meaning": "The queen symbolizes maturity and wisdom. It suggests that you are able to make decisions based on experience and knowledge."
      },
      {
        "symbol": "upright sword",
        "meaning": "The upright sword symbolizes clarity and truth. It suggests that you are able to see things clearly and make decisions based on facts."
      },
      {
        "symbol": "throne",
        "meaning": "The throne symbolizes authority and power. It suggests that you are in a position of authority and can make decisions that affect others."
      },
      {
        "symbol": "clouds",
        "meaning": "The clouds symbolize confusion and uncertainty. It suggests that you are able to see through the confusion and make decisions with clarity."
      }
    ],
    "prominentColors": [
      {
        "color": "blue",
        "meaning": "Blue symbolizes intellect and communication. It suggests that you are able to communicate your ideas clearly and effectively."
      },
      {
        "color": "yellow",
        "meaning": "Yellow symbolizes clarity and wisdom. It suggests that you are able to see situations clearly and make decisions based on logic."
      },
      {
        "color": "white",
        "meaning": "White symbolizes purity and truth. It suggests that you are able to see the truth and make decisions based on honesty."
      },
      {
        "color": "red",
        "meaning": "Red symbolizes passion and power. It suggests that you are passionate about your beliefs and are willing to stand up for them."
      }
    ]
  },
  {
    "cardName": "King of Swords",
    "arcana": "Minor",
    "suit": "Swords",
    "cardDescription": "The King of Swords sits on his throne, holding a sword upright, representing intellectual power, authority, and truth.",
    "meanings": [
      {
        "title": "Upright Meaning",
        "description": "In the upright position, the King of Swords represents intellectual power, authority, truth, fairness, and clarity. It suggests that you are able to see things clearly and make decisions based on logic and reason. This card often indicates that you are in a position of authority and can make decisions that affect others."
      },
      {
        "title": "Reversed Meaning",
        "description": "In the reversed position, the King of Swords can indicate manipulation, tyranny, abuse of power, cunning, and coldness. It suggests that you may be using your intellect and authority to manipulate others or to control situations to your advantage. This card often indicates that you need to be careful with how you use your power and authority."
      }
    ],
    "imageFileName": "Swords14",
    "prominentSymbols": [
      {
        "symbol": "king",
        "meaning": "The king symbolizes authority and leadership. It suggests that you are in a position of authority and can make decisions that affect others."
      },
      {
        "symbol": "upright sword",
        "meaning": "The upright sword symbolizes truth and clarity. It suggests that you are able to see things clearly and make decisions based on logic."
      },
      {
        "symbol": "throne",
        "meaning": "The throne symbolizes authority and power. It suggests that you are in a position of authority and can make decisions that affect others."
      },
      {
        "symbol": "butterfly",
        "meaning": "The butterfly symbolizes transformation and change. It suggests that you are undergoing a period of transformation and growth."
      }
    ],
    "prominentColors": [
      {
        "color": "blue",
        "meaning": "Blue symbolizes intellect and communication. It suggests that you are able to communicate your ideas clearly and effectively."
      },
      {
        "color": "yellow",
        "meaning": "Yellow symbolizes clarity and wisdom. It suggests that you are able to see situations clearly and make decisions based on logic."
      },
      {
        "color": "white",
        "meaning": "White symbolizes purity and truth. It suggests that you are able to see the truth and make decisions based on honesty."
      },
      {
        "color": "green",
        "meaning": "Green symbolizes growth and harmony. It suggests that you are undergoing a period of growth and development."
      }
    ]
  },
  {
    "cardName": "Ace of Pentacles",
    "arcana": "Minor",
    "suit": "Pentacles",
    "cardDescription": "The Ace of Pentacles depicts a hand holding a pentacle, symbolizing new opportunities, abundance, and financial stability.",
    "meanings": [
      {
        "title": "Upright Meaning",
        "description": "In the upright position, the Ace of Pentacles represents new opportunities, abundance, financial stability, prosperity, and security. It suggests that you are on the path to success and that there are opportunities for growth and prosperity in your life."
      },
      {
        "title": "Reversed Meaning",
        "description": "In the reversed position, the Ace of Pentacles can indicate missed opportunities, lack of planning, financial loss, and instability. It suggests that you may need to be more cautious with your finances and that there may be challenges ahead that require careful planning and management."
      }
    ],
    "imageFileName": "Pents01",
    "prominentSymbols": [
      {
        "symbol": "hand",
        "meaning": "The hand symbolizes the giving and receiving of opportunities. It suggests that new opportunities are available to you."
      },
      {
        "symbol": "pentacle",
        "meaning": "The pentacle symbolizes prosperity and abundance. It suggests that you are on the path to financial stability."
      },
      {
        "symbol": "garden",
        "meaning": "The garden symbolizes growth and abundance. It suggests that there are opportunities for growth and prosperity in your life."
      },
      {
        "symbol": "archway",
        "meaning": "The archway symbolizes a doorway to new opportunities. It suggests that new opportunities are opening up for you."
      }
    ],
    "prominentColors": [
      {
        "color": "green",
        "meaning": "Green symbolizes growth and prosperity. It suggests that you are on the path to financial stability."
      },
      {
        "color": "yellow",
        "meaning": "Yellow symbolizes abundance and prosperity. It suggests that you are on the path to financial success."
      },
      {
        "color": "blue",
        "meaning": "Blue symbolizes stability and security. It suggests that you are financially secure."
      },
      {
        "color": "brown",
        "meaning": "Brown symbolizes stability and grounding. It suggests that you are grounded in your financial matters."
      }
    ]
  },
  {
    "cardName": "Two of Pentacles",
    "arcana": "Minor",
    "suit": "Pentacles",
    "cardDescription": "The Two of Pentacles shows a figure juggling two pentacles, symbolizing balance, adaptability, and time management.",
    "meanings": [
      {
        "title": "Upright Meaning",
        "description": "In the upright position, the Two of Pentacles represents balance, adaptability, time management, prioritization, and flexibility. It suggests that you are able to juggle multiple priorities and manage your time effectively."
      },
      {
        "title": "Reversed Meaning",
        "description": "In the reversed position, the Two of Pentacles can indicate imbalance, disorganization, financial stress, and overwhelm. It suggests that you may be struggling to keep up with your responsibilities and that you may need to find a better balance in your life."
      }
    ],
    "imageFileName": "Pents02",
    "prominentSymbols": [
      {
        "symbol": "juggling figure",
        "meaning": "The juggling figure symbolizes the need for balance and adaptability. It suggests that you may need to juggle multiple priorities in your life."
      },
      {
        "symbol": "two pentacles",
        "meaning": "The two pentacles symbolize balance and duality. It suggests that you are able to balance multiple aspects of your life."
      },
      {
        "symbol": "infinity symbol",
        "meaning": "The infinity symbol symbolizes the cyclical nature of life. It suggests that you may need to find a balance between work and play."
      },
      {
        "symbol": "waves",
        "meaning": "The waves symbolize the ebb and flow of life. It suggests that you may need to go with the flow and adapt to changes in your life."
      }
    ],
    "prominentColors": [
      {
        "color": "yellow",
        "meaning": "Yellow symbolizes energy and positivity. It suggests that you have the energy and positivity to handle your responsibilities."
      },
      {
        "color": "blue",
        "meaning": "Blue symbolizes calmness and stability. It suggests that you are able to stay calm and stable amidst chaos."
      },
      {
        "color": "green",
        "meaning": "Green symbolizes growth and harmony. It suggests that you are able to find harmony in your life."
      },
      {
        "color": "red",
        "meaning": "Red symbolizes passion and energy. It suggests that you have the passion and energy to handle your responsibilities."
      }
    ]
  },
  {
    "cardName": "Three of Pentacles",
    "arcana": "Minor",
    "suit": "Pentacles",
    "cardDescription": "The Three of Pentacles depicts a craftsman working on a cathedral, symbolizing collaboration, skill, and quality work.",
    "meanings": [
      {
        "title": "Upright Meaning",
        "description": "In the upright position, the Three of Pentacles represents collaboration, skill, quality work, teamwork, and planning. It suggests that you are working well with others to achieve a common goal."
      },
      {
        "title": "Reversed Meaning",
        "description": "In the reversed position, the Three of Pentacles can indicate a lack of teamwork, disregard for skills, poor quality work, and conflict. It suggests that there may be issues within a team or project that need to be addressed."
      }
    ],
    "imageFileName": "Pents03",
    "prominentSymbols": [
      {
        "symbol": "craftsman",
        "meaning": "The craftsman symbolizes skill and craftsmanship. It suggests that you have the skills needed to achieve your goals."
      },
      {
        "symbol": "cathedral",
        "meaning": "The cathedral symbolizes a large project or goal. It suggests that you are working on something important and meaningful."
      },
      {
        "symbol": "three pentacles",
        "meaning": "The three pentacles symbolize collaboration and teamwork. It suggests that you are working well with others to achieve your goals."
      },
      {
        "symbol": "blueprint",
        "meaning": "The blueprint symbolizes planning and preparation. It suggests that you have a plan in place to achieve your goals."
      }
    ],
    "prominentColors": [
      {
        "color": "yellow",
        "meaning": "Yellow symbolizes energy and positivity. It suggests that you have the energy and positivity to achieve your goals."
      },
      {
        "color": "red",
        "meaning": "Red symbolizes passion and determination. It suggests that you are passionate about your work and determined to succeed."
      },
      {
        "color": "blue",
        "meaning": "Blue symbolizes calmness and stability. It suggests that you are able to stay calm and stable amidst challenges."
      },
      {
        "color": "gray",
        "meaning": "Gray symbolizes stability and practicality. It suggests that you are approaching your goals in a practical and methodical manner."
      }
    ]
  },
  {
    "cardName": "Four of Pentacles",
    "arcana": "Minor",
    "suit": "Pentacles",
    "cardDescription": "The Four of Pentacles shows a figure holding onto four pentacles, symbolizing security, control, and possessiveness.",
    "meanings": [
      {
        "title": "Upright Meaning",
        "description": "In the upright position, the Four of Pentacles represents security, control, stability, possessiveness, and saving. It suggests that you are holding onto your resources and maintaining stability in your life."
      },
      {
        "title": "Reversed Meaning",
        "description": "In the reversed position, the Four of Pentacles can indicate greed, materialism, insecurity, letting go, and spending. It suggests that you may be holding onto things too tightly or being overly possessive."
      }
    ],
    "imageFileName": "Pents04",
    "prominentSymbols": [
      {
        "symbol": "holding pentacles",
        "meaning": "The figure holding onto four pentacles symbolizes security and control. It suggests that you are holding onto your resources and maintaining stability."
      },
      {
        "symbol": "city",
        "meaning": "The city in the background symbolizes stability and security. It suggests that you are in a stable and secure environment."
      },
      {
        "symbol": "throne",
        "meaning": "The throne symbolizes authority and control. It suggests that you are in control of your life and resources."
      },
      {
        "symbol": "foot on pentacle",
        "meaning": "The foot on the pentacle symbolizes possessiveness. It suggests that you may be holding onto things too tightly."
      }
    ],
    "prominentColors": [
      {
        "color": "yellow",
        "meaning": "Yellow symbolizes energy and positivity. It suggests that you are feeling secure and stable in your life."
      },
      {
        "color": "red",
        "meaning": "Red symbolizes passion and strength. It suggests that you are passionate about maintaining control and stability."
      },
      {
        "color": "blue",
        "meaning": "Blue symbolizes calmness and stability. It suggests that you are maintaining stability in your life."
      },
      {
        "color": "green",
        "meaning": "Green symbolizes growth and prosperity. It suggests that you are saving and investing wisely."
      }
    ]
  },
  {
    "cardName": "Five of Pentacles",
    "arcana": "Minor",
    "suit": "Pentacles",
    "cardDescription": "The Five of Pentacles depicts two figures in the snow outside a stained glass window, symbolizing hardship, loss, and feeling left out in the cold.",
    "meanings": [
      {
        "title": "Upright Meaning",
        "description": "In the upright position, the Five of Pentacles represents hardship, loss, financial struggle, isolation, and insecurity. It suggests that you may be experiencing difficulties and feeling left out in the cold."
      },
      {
        "title": "Reversed Meaning",
        "description": "In the reversed position, the Five of Pentacles can indicate recovery, regaining stability, re-entering society, and overcoming adversity. It suggests that you are beginning to overcome the challenges you have faced."
      }
    ],
    "imageFileName": "Pents05",
    "prominentSymbols": [
      {
        "symbol": "two figures",
        "meaning": "The two figures represent hardship and loss. They suggest that you may be experiencing difficulties and feeling isolated."
      },
      {
        "symbol": "snow",
        "meaning": "The snow symbolizes hardship and difficulty. It suggests that you are facing challenges and obstacles in your life."
      },
      {
        "symbol": "stained glass window",
        "meaning": "The stained glass window represents hope and spirituality. It suggests that there is a source of hope and comfort available to you."
      },
      {
        "symbol": "crutches",
        "meaning": "The crutches symbolize support and assistance. They suggest that you may need help and support to overcome your challenges."
      }
    ],
    "prominentColors": [
      {
        "color": "blue",
        "meaning": "Blue symbolizes calmness and stability. It suggests that you may be feeling isolated and insecure."
      },
      {
        "color": "yellow",
        "meaning": "Yellow symbolizes positivity and energy. It suggests that there is hope and opportunity for improvement."
      },
      {
        "color": "red",
        "meaning": "Red symbolizes passion and strength. It suggests that you have the strength to overcome your challenges."
      },
      {
        "color": "white",
        "meaning": "White symbolizes purity and spirituality. It suggests that there is hope and guidance available to you."
      }
    ]
  },
  {
    "cardName": "Six of Pentacles",
    "arcana": "Minor",
    "suit": "Pentacles",
    "cardDescription": "The Six of Pentacles shows a figure distributing coins to the needy, symbolizing generosity, charity, and balance in financial matters.",
    "meanings": [
      {
        "title": "Upright Meaning",
        "description": "In the upright position, the Six of Pentacles represents generosity, charity, balance, sharing wealth, and fairness. It suggests that you may be in a position to help others and share your resources."
      },
      {
        "title": "Reversed Meaning",
        "description": "In the reversed position, the Six of Pentacles can indicate selfishness, debt, one-sided charity, strings attached, and inequality. It suggests that you may need to reassess your approach to giving and receiving."
      }
    ],
    "imageFileName": "Pents06",
    "prominentSymbols": [
      {
        "symbol": "giving figure",
        "meaning": "The giving figure represents generosity and charity. It suggests that you may be in a position to help others."
      },
      {
        "symbol": "two recipients",
        "meaning": "The two recipients represent those in need. They suggest that there are people around you who could benefit from your help."
      },
      {
        "symbol": "scales",
        "meaning": "The scales symbolize balance and fairness. They suggest that your actions are guided by a sense of fairness and equality."
      },
      {
        "symbol": "six pentacles",
        "meaning": "The six pentacles represent sharing wealth and resources. They suggest that you are willing to share your blessings with others."
      }
    ],
    "prominentColors": [
      {
        "color": "yellow",
        "meaning": "Yellow symbolizes positivity and energy. It suggests that your actions are motivated by a desire to help others."
      },
      {
        "color": "red",
        "meaning": "Red symbolizes passion and action. It suggests that you are actively involved in helping others."
      },
      {
        "color": "blue",
        "meaning": "Blue symbolizes calmness and stability. It suggests that your actions are guided by a sense of balance and fairness."
      },
      {
        "color": "green",
        "meaning": "Green symbolizes growth and prosperity. It suggests that your generosity will lead to positive outcomes for you and others."
      }
    ]
  },
  {
    "cardName": "Seven of Pentacles",
    "arcana": "Minor",
    "suit": "Pentacles",
    "cardDescription": "The Seven of Pentacles shows a figure contemplating the fruits of their labor, symbolizing patience, investment, and delayed gratification.",
    "meanings": [
      {
        "title": "Upright Meaning",
        "description": "In the upright position, the Seven of Pentacles represents patience, investment, delayed gratification, a long-term view, and perseverance. It suggests that your hard work will pay off in the long run."
      },
      {
        "title": "Reversed Meaning",
        "description": "In the reversed position, the Seven of Pentacles can indicate impatience, lack of long-term vision, limited success, and dissatisfaction. It suggests that you may need to reassess your goals and be more patient with your progress."
      }
    ],
    "imageFileName": "Pents07",
    "prominentSymbols": [
      {
        "symbol": "contemplating figure",
        "meaning": "The contemplating figure symbolizes reflection and assessment. It suggests that you are taking the time to evaluate your progress and make necessary adjustments."
      },
      {
        "symbol": "seven pentacles",
        "meaning": "The seven pentacles represent the fruits of your labor. They suggest that your hard work is starting to bear fruit, but you may need to be patient for full results."
      },
      {
        "symbol": "plants",
        "meaning": "The plants symbolize growth and development. They suggest that your efforts are leading to positive growth and progress."
      },
      {
        "symbol": "shovel",
        "meaning": "The shovel symbolizes hard work and effort. It suggests that your success is the result of your dedication and perseverance."
      }
    ],
    "prominentColors": [
      {
        "color": "green",
        "meaning": "Green symbolizes growth and prosperity. It suggests that your efforts will lead to continued growth and success."
      },
      {
        "color": "yellow",
        "meaning": "Yellow symbolizes positivity and energy. It suggests that your hard work is paying off and will lead to positive outcomes."
      },
      {
        "color": "red",
        "meaning": "Red symbolizes passion and action. It suggests that your dedication and effort will lead to success."
      },
      {
        "color": "brown",
        "meaning": "Brown symbolizes stability and grounding. It suggests that your success is built on a solid foundation of hard work and perseverance."
      }
    ]
  },
  {
    "cardName": "Eight of Pentacles",
    "arcana": "Minor",
    "suit": "Pentacles",
    "cardDescription": "The Eight of Pentacles depicts a craftsman working on his craft, symbolizing dedication, skill development, and attention to detail.",
    "meanings": [
      {
        "title": "Upright Meaning",
        "description": "In the upright position, the Eight of Pentacles represents dedication, skill development, attention to detail, craftsmanship, and pride in work. It suggests that you are focused on honing your skills and producing high-quality work."
      },
      {
        "title": "Reversed Meaning",
        "description": "In the reversed position, the Eight of Pentacles can indicate a lack of focus, perfectionism, not applying your skills effectively, or feeling like your work is not being rewarded. It suggests that you may need to reassess your approach and find ways to be more productive."
      }
    ],
    "imageFileName": "Pents08",
    "prominentSymbols": [
      {
        "symbol": "craftsman",
        "meaning": "The craftsman symbolizes dedication and skill. It suggests that you are committed to your work and are focused on improving your craft."
      },
      {
        "symbol": "eight pentacles",
        "meaning": "The eight pentacles represent skill development and mastery. They suggest that you are dedicated to improving your skills and producing high-quality work."
      },
      {
        "symbol": "workbench",
        "meaning": "The workbench symbolizes a place of work and productivity. It suggests that you are focused on your work and are committed to achieving your goals."
      },
      {
        "symbol": "tools",
        "meaning": "The tools symbolize the tools of your trade. They suggest that you are equipped with the skills and knowledge necessary to succeed in your work."
      }
    ],
    "prominentColors": [
      {
        "color": "yellow",
        "meaning": "Yellow symbolizes energy and positivity. It suggests that you are enthusiastic about your work and are dedicated to achieving success."
      },
      {
        "color": "red",
        "meaning": "Red symbolizes passion and action. It suggests that you are passionate about your work and are willing to put in the effort to succeed."
      },
      {
        "color": "green",
        "meaning": "Green symbolizes growth and development. It suggests that your work is leading to personal and professional growth."
      },
      {
        "color": "blue",
        "meaning": "Blue symbolizes stability and trust. It suggests that you have a solid foundation and are trusted for your skills and expertise."
      }
    ]
  },
  {
    "cardName": "Nine of Pentacles",
    "arcana": "Minor",
    "suit": "Pentacles",
    "cardDescription": "The Nine of Pentacles shows a figure in a lush garden, surrounded by pentacles, symbolizing abundance, luxury, and self-sufficiency.",
    "meanings": [
      {
        "title": "Upright Meaning",
        "description": "In the upright position, the Nine of Pentacles represents abundance, luxury, self-sufficiency, financial independence, and success. It suggests that you have achieved a level of prosperity and are enjoying the fruits of your labor."
      },
      {
        "title": "Reversed Meaning",
        "description": "In the reversed position, the Nine of Pentacles can indicate financial dependency, lack of discipline, overspending, or feelings of loneliness despite material wealth. It suggests that you may need to reassess your relationship with money and find a balance between enjoying your success and maintaining financial stability."
      }
    ],
    "imageFileName": "Pents09",
    "prominentSymbols": [
      {
        "symbol": "figure in garden",
        "meaning": "The figure in the garden represents the enjoyment of the fruits of your labor. It suggests that you are able to relax and enjoy the abundance and luxury that you have created for yourself."
      },
      {
        "symbol": "nine pentacles",
        "meaning": "The nine pentacles represent material wealth and prosperity. They suggest that you have achieved a level of financial success and are able to enjoy the rewards of your hard work."
      },
      {
        "symbol": "bird of prey",
        "meaning": "The bird of prey symbolizes freedom and independence. It suggests that you have achieved a level of self-sufficiency and are able to rely on yourself for financial security."
      },
      {
        "symbol": "grapes",
        "meaning": "Grapes symbolize abundance and fertility. They suggest that you are surrounded by abundance and are able to enjoy the finer things in life."
      }
    ],
    "prominentColors": [
      {
        "color": "green",
        "meaning": "Green symbolizes growth and prosperity. It suggests that you are experiencing growth and prosperity in your life."
      },
      {
        "color": "yellow",
        "meaning": "Yellow symbolizes happiness and positivity. It suggests that you are enjoying a period of happiness and prosperity."
      },
      {
        "color": "red",
        "meaning": "Red symbolizes passion and energy. It suggests that you are passionate about your success and are enjoying the rewards of your hard work."
      },
      {
        "color": "blue",
        "meaning": "Blue symbolizes tranquility and peace. It suggests that you are at peace with your financial situation and are able to enjoy the luxuries of life."
      }
    ]
  },
  {
    "cardName": "Ten of Pentacles",
    "arcana": "Minor",
    "suit": "Pentacles",
    "cardDescription": "The Ten of Pentacles depicts a family and a patriarch, surrounded by wealth, symbolizing legacy, long-term success, and family support.",
    "meanings": [
      {
        "title": "Upright Meaning",
        "description": "In the upright position, the Ten of Pentacles represents legacy, long-term success, wealth, family support, and inheritance. It suggests that you have built a solid foundation for yourself and your family, and you are enjoying the benefits of your hard work."
      },
      {
        "title": "Reversed Meaning",
        "description": "In the reversed position, the Ten of Pentacles can indicate financial failure, instability, broken family ties, or fleeting success. It suggests that you may need to reassess your financial situation and family relationships to ensure long-term stability and success."
      }
    ],
    "imageFileName": "Pents10",
    "prominentSymbols": [
      {
        "symbol": "family",
        "meaning": "The family symbolizes unity, support, and heritage. It suggests that you have a strong family foundation and are supported by your family in your endeavors."
      },
      {
        "symbol": "patriarch",
        "meaning": "The patriarch represents leadership, wisdom, and guidance. It suggests that you are the head of your family and are responsible for providing for and protecting your loved ones."
      },
      {
        "symbol": "ten pentacles",
        "meaning": "The ten pentacles represent wealth, abundance, and prosperity. They suggest that you have achieved financial success and are able to enjoy the comforts of life."
      },
      {
        "symbol": "archway",
        "meaning": "The archway symbolizes stability, security, and a solid foundation. It suggests that you have built a solid foundation for yourself and your family, ensuring long-term success and security."
      }
    ],
    "prominentColors": [
      {
        "color": "yellow",
        "meaning": "Yellow symbolizes happiness, joy, and positivity. It suggests that you are experiencing happiness and contentment in your family life and financial situation."
      },
      {
        "color": "red",
        "meaning": "Red symbolizes passion, energy, and vitality. It suggests that you are passionate about your family and financial success, and you are willing to work hard to achieve your goals."
      },
      {
        "color": "green",
        "meaning": "Green symbolizes growth, fertility, and abundance. It suggests that you are experiencing growth and abundance in your family and financial life."
      },
      {
        "color": "blue",
        "meaning": "Blue symbolizes tranquility, peace, and harmony. It suggests that you have a harmonious family life and are at peace with your financial situation."
      }
    ]
  },
  {
    "cardName": "Page of Pentacles",
    "arcana": "Minor",
    "suit": "Pentacles",
    "cardDescription": "The Page of Pentacles shows a young figure holding a pentacle, symbolizing curiosity, new opportunities, and the desire to learn.",
    "meanings": [
      {
        "title": "Upright Meaning",
        "description": "In the upright position, the Page of Pentacles represents curiosity, new opportunities, the desire to learn, ambition, and diligence. It suggests that you are open to new ideas and experiences and are willing to put in the effort to achieve your goals."
      },
      {
        "title": "Reversed Meaning",
        "description": "In the reversed position, the Page of Pentacles can indicate a lack of progress, procrastination, financial irresponsibility, or missed opportunities. It suggests that you may need to focus more on your goals and be more disciplined in your approach to achieve success."
      }
    ],
    "imageFileName": "Pents11",
    "prominentSymbols": [
      {
        "symbol": "young figure",
        "meaning": "The young figure symbolizes youth, curiosity, and potential. It suggests that you are at a stage in your life where you are open to new ideas and experiences."
      },
      {
        "symbol": "pentacle",
        "meaning": "The pentacle represents wealth, abundance, and prosperity. It suggests that you are focused on material matters and are willing to work hard to achieve financial success."
      },
      {
        "symbol": "field",
        "meaning": "The field symbolizes potential and growth. It suggests that you are in a fertile period of your life where you have many opportunities for growth and development."
      },
      {
        "symbol": "mountains",
        "meaning": "The mountains represent challenges and obstacles. They suggest that you may face challenges on your path to success, but with determination and perseverance, you can overcome them."
      }
    ],
    "prominentColors": [
      {
        "color": "green",
        "meaning": "Green symbolizes growth, fertility, and abundance. It suggests that you are in a period of growth and development in your life."
      },
      {
        "color": "yellow",
        "meaning": "Yellow symbolizes happiness, joy, and positivity. It suggests that you are optimistic about the future and are willing to take risks to achieve your goals."
      },
      {
        "color": "blue",
        "meaning": "Blue symbolizes tranquility, peace, and harmony. It suggests that you are in a harmonious state of mind and are open to new ideas and experiences."
      },
      {
        "color": "brown",
        "meaning": "Brown symbolizes stability, reliability, and grounding. It suggests that you are grounded and practical in your approach to life."
      }
    ]
  },
  {
    "cardName": "Knight of Pentacles",
    "arcana": "Minor",
    "suit": "Pentacles",
    "cardDescription": "The Knight of Pentacles sits on a stationary horse, holding a pentacle, symbolizing reliability, patience, and a methodical approach.",
    "meanings": [
      {
        "title": "Upright Meaning",
        "description": "In the upright position, the Knight of Pentacles represents reliability, patience, a methodical approach, hard work, and dedication. It suggests that you are committed to your goals and are willing to put in the effort to achieve them."
      },
      {
        "title": "Reversed Meaning",
        "description": "In the reversed position, the Knight of Pentacles can indicate stagnation, laziness, inflexibility, lack of innovation, or boredom. It suggests that you may be stuck in a rut and need to find new ways to progress."
      }
    ],
    "imageFileName": "Pents12",
    "prominentSymbols": [
      {
        "symbol": "knight",
        "meaning": "The knight symbolizes action, movement, and progress. However, the fact that the horse is stationary suggests that the knight is currently in a state of rest or contemplation."
      },
      {
        "symbol": "stationary horse",
        "meaning": "The stationary horse represents stability and reliability. It suggests that the knight is dependable and trustworthy."
      },
      {
        "symbol": "pentacle",
        "meaning": "The pentacle represents wealth, abundance, and material concerns. It suggests that the knight is focused on practical matters and is willing to work hard to achieve financial security."
      },
      {
        "symbol": "plowed field",
        "meaning": "The plowed field symbolizes fertility and potential. It suggests that there are opportunities for growth and development, but they may require hard work and dedication to realize."
      }
    ],
    "prominentColors": [
      {
        "color": "green",
        "meaning": "Green symbolizes growth, fertility, and abundance. It suggests that the knight is focused on personal and professional growth."
      },
      {
        "color": "yellow",
        "meaning": "Yellow symbolizes happiness, joy, and positivity. It suggests that the knight is optimistic about the future and is willing to work hard to achieve success."
      },
      {
        "color": "brown",
        "meaning": "Brown symbolizes stability, reliability, and grounding. It suggests that the knight is grounded and practical in his approach to life."
      },
      {
        "color": "blue",
        "meaning": "Blue symbolizes tranquility, peace, and harmony. It suggests that the knight is in a harmonious state of mind and is focused on his goals."
      }
    ]
  },
  {
    "cardName": "Queen of Pentacles",
    "arcana": "Minor",
    "suit": "Pentacles",
    "cardDescription": "The Queen of Pentacles sits on her throne surrounded by nature, holding a pentacle, symbolizing nurture, practicality, and a love for the natural world.",
    "meanings": [
      {
        "title": "Upright Meaning",
        "description": "In the upright position, the Queen of Pentacles represents nurture, practicality, security, a love for nature, and generosity. It suggests that you are grounded and practical in your approach to life, and you derive joy from taking care of others."
      },
      {
        "title": "Reversed Meaning",
        "description": "In the reversed position, the Queen of Pentacles can indicate a need for financial independence, self-care, practicality, or luxury. It suggests that you may need to focus on taking care of yourself and ensuring your own well-being."
      }
    ],
    "imageFileName": "Pents13",
    "prominentSymbols": [
      {
        "symbol": "queen",
        "meaning": "The queen represents nurturing and caring qualities. She is often associated with motherhood and the domestic sphere."
      },
      {
        "symbol": "throne",
        "meaning": "The throne represents authority and stability. It suggests that the queen is in a position of power and influence."
      },
      {
        "symbol": "pentacle",
        "meaning": "The pentacle represents wealth, abundance, and material concerns. It suggests that the queen is practical and resourceful when it comes to managing her finances."
      },
      {
        "symbol": "garden",
        "meaning": "The garden represents nature and fertility. It suggests that the queen has a deep connection to the natural world and finds solace in its beauty."
      },
      {
        "symbol": "rabbit",
        "meaning": "The rabbit represents fertility, abundance, and prosperity. It suggests that the queen is able to multiply her resources and make them grow."
      }
    ],
    "prominentColors": [
      {
        "color": "green",
        "meaning": "Green symbolizes growth, fertility, and abundance. It suggests that the queen is nurturing and caring, and she thrives in environments that are lush and fertile."
      },
      {
        "color": "yellow",
        "meaning": "Yellow symbolizes happiness, joy, and positivity. It suggests that the queen has a sunny disposition and brings warmth and light to those around her."
      },
      {
        "color": "red",
        "meaning": "Red symbolizes passion, vitality, and energy. It suggests that the queen is passionate about her beliefs and values, and she is willing to work hard to achieve her goals."
      },
      {
        "color": "blue",
        "meaning": "Blue symbolizes tranquility, peace, and harmony. It suggests that the queen is calm and composed, even in challenging situations."
      }
    ]
  },
  {
    "cardName": "King of Pentacles",
    "arcana": "Minor",
    "suit": "Pentacles",
    "cardDescription": "The King of Pentacles sits on his throne adorned with vines, holding a scepter and a pentacle, representing wealth, stability, and leadership.",
    "meanings": [
      {
        "title": "Upright Meaning",
        "description": "In the upright position, the King of Pentacles represents wealth, stability, leadership, security, and discipline. It suggests that you have achieved a level of success and are able to enjoy the fruits of your labor."
      },
      {
        "title": "Reversed Meaning",
        "description": "In the reversed position, the King of Pentacles can indicate greed, materialism, stagnation, an obsession with wealth, or stubbornness. It suggests that you may need to reassess your priorities and make sure that you are not overly focused on material gain."
      }
    ],
    "imageFileName": "Pents14",
    "prominentSymbols": [
      {
        "symbol": "king",
        "meaning": "The king represents authority, power, and leadership. He is often associated with wealth and success."
      },
      {
        "symbol": "throne",
        "meaning": "The throne represents authority and stability. It suggests that the king is in a position of power and influence."
      },
      {
        "symbol": "scepter",
        "meaning": "The scepter represents power and authority. It suggests that the king is a strong leader who commands respect."
      },
      {
        "symbol": "pentacle",
        "meaning": "The pentacle represents wealth, abundance, and material concerns. It suggests that the king is financially secure and able to provide for himself and others."
      },
      {
        "symbol": "bull",
        "meaning": "The bull represents strength, determination, and stability. It suggests that the king is steadfast and reliable in his pursuits."
      }
    ],
    "prominentColors": [
      {
        "color": "green",
        "meaning": "Green symbolizes growth, prosperity, and abundance. It suggests that the king is successful and able to achieve his goals."
      },
      {
        "color": "yellow",
        "meaning": "Yellow symbolizes happiness, optimism, and positivity. It suggests that the king has a sunny disposition and enjoys life."
      },
      {
        "color": "red",
        "meaning": "Red symbolizes passion, vitality, and energy. It suggests that the king is passionate about his pursuits and is willing to work hard to achieve his goals."
      },
      {
        "color": "blue",
        "meaning": "Blue symbolizes tranquility, peace, and harmony. It suggests that the king is calm and composed, even in challenging situations."
      }
    ]
  }
]
