[
  {
    "cardName": "The Fool",
    "number": 0,
    "arcana": "Major",
    "suit": "Keys",
    "cardDescription": "The Fool depicts a youthful figure carrying a bundle, standing on the edge of a cliff, with a small dog at his heels. The sun shines brightly, and mountains loom in the distance.",
    "meanings": [
      {
        "title": "Upright Meaning",
        "description": "In the upright position, The Fool symbolizes new beginnings, innocence, spontaneous actions, freedom, and originality.",
        "keywords": [
          "new beginnings",
          "innocence",
          "spontaneous actions",
          "freedom",
          "originality"
        ]
      },
      {
        "title": "Reversed Meaning",
        "description": "In the reversed position, The Fool can indicate naivety, foolishness, recklessness, and risk-taking without forethought.",
        "keywords": [
          "naivety",
          "foolishness",
          "recklessness",
          "risk-taking without forethought"
        ]
      }
    ],
    "imageFileName": "RWS_Tarot_00_Fool",
    "prominentSymbols": [
      {
        "symbol": "youthful figure",
        "meaning": "Represents a new journey, innocence, and being open to new experiences."
      },
      {
        "symbol": "cliff",
        "meaning": "Symbolizes a leap of faith, taking risks, and being on the edge of change."
      },
      {
        "symbol": "dog",
        "meaning": "Can signify loyalty, friendship, protection, and companionship."
      },
      {
        "symbol": "sun",
        "meaning": "Represents success, vitality, enlightenment, and clarity."
      },
      {
        "symbol": "mountains",
        "meaning": "Symbolize challenges, obstacles, and the need for perseverance and determination."
      }
    ],
    "prominentColors": [
      {
        "color": "yellow",
        "meaning": "Joy, happiness, intellect, energy."
      },
      {
        "color": "white",
        "meaning": "Purity, innocence, clarity, new beginnings."
      },
      {
        "color": "blue",
        "meaning": "Calmness, tranquility, communication, spirituality."
      },
      {
        "color": "green",
        "meaning": "Growth, fertility, abundance, harmony."
      }
    ]
  },
  {
    "cardName": "The Magician",
    "number": 1,
    "arcana": "Major",
    "suit": "Keys",
    "cardDescription": "The Magician is seen standing at a table with one hand pointed to the sky and the other pointing to the ground. Symbols of the four suits (Wands, Cups, Swords, Pentacles) are on the table, symbolizing the elements of natural power.",
    "meanings": [
      {
        "title": "Upright Meaning",
        "description": "In the upright position, The Magician represents manifestation, resourcefulness, power, and inspired action.",
        "keywords": [
          "manifestation",
          "resourcefulness",
          "power",
          "inspired action"
        ]
      },
      {
        "title": "Reversed Meaning",
        "description": "In the reversed position, The Magician can indicate manipulation, poor planning, and untapped talents.",
        "keywords": ["manipulation", "poor planning", "untapped talents"]
      }
    ],
    "imageFileName": "RWS_Tarot_01_Magician",
    "prominentSymbols": [
      {
        "symbol": "one hand pointing upwards",
        "meaning": "The hand pointing upwards symbolizes the connection between the spiritual and material worlds, as above, so below."
      },
      {
        "symbol": "one hand pointing downwards",
        "meaning": "The hand pointing downwards represents the power to manifest ideas and bring them into reality."
      },
      {
        "symbol": "four suits",
        "meaning": "The four suits represent the four elements (Wands - Fire, Cups - Water, Swords - Air, Pentacles - Earth) and the ability to harness natural power."
      },
      {
        "symbol": "infinity symbol",
        "meaning": "The infinity symbol above the Magician's head represents infinite potential and the interconnectedness of all things."
      }
    ],
    "prominentColors": [
      {
        "color": "red",
        "meaning": "Red symbolizes passion, energy, and the power to take action."
      },
      {
        "color": "white",
        "meaning": "White symbolizes purity of intention and the clarity of thought needed to manifest ideas."
      },
      {
        "color": "yellow",
        "meaning": "Yellow symbolizes the intellect and the creative mind at work."
      },
      {
        "color": "green",
        "meaning": "Green symbolizes growth, abundance, and the ability to manifest material wealth."
      }
    ]
  },
  {
    "cardName": "The High Priestess",
    "number": 2,
    "arcana": "Major",
    "suit": "Keys",
    "cardDescription": "The High Priestess is seated between two pillars, with a tapestry hanging between them, symbolizing the veil of awareness. She holds a Torah, representing divine knowledge.",
    "meanings": [
      {
        "title": "Upright Meaning",
        "description": "In the upright position, The High Priestess represents intuition, unconscious knowledge, mystery, and spirituality.",
        "keywords": [
          "intuition",
          "unconscious knowledge",
          "mystery",
          "spirituality"
        ]
      },
      {
        "title": "Reversed Meaning",
        "description": "In the reversed position, The High Priestess can indicate secrets, being disconnected from intuition, and withdrawal and silence.",
        "keywords": [
          "secrets",
          "disconnected from intuition",
          "withdrawal and silence"
        ]
      }
    ],
    "imageFileName": "RWS_Tarot_02_High_Priestess",
    "prominentSymbols": [
      {
        "symbol": "pillars",
        "meaning": "Pillars represent duality, such as light and dark, and the need to balance opposing forces."
      },
      {
        "symbol": "veil",
        "meaning": "The veil symbolizes hidden knowledge and the need to look beyond the obvious."
      },
      {
        "symbol": "Torah",
        "meaning": "The Torah signifies divine knowledge and the importance of seeking wisdom."
      },
      {
        "symbol": "moon crown",
        "meaning": "The moon crown represents the subconscious mind and the mysteries of the night."
      }
    ],
    "prominentColors": [
      {
        "color": "blue",
        "meaning": "Blue symbolizes intuition, depth, and the mysteries of the unknown."
      },
      {
        "color": "black",
        "meaning": "Black represents the hidden, the unconscious, and the mysteries that lie beyond."
      },
      {
        "color": "white",
        "meaning": "White symbolizes purity, truth, and the clarity of thought."
      },
      {
        "color": "yellow",
        "meaning": "Yellow represents enlightenment, optimism, and the light of wisdom."
      }
    ]
  },
  {
    "cardName": "The Empress",
    "number": 3,
    "arcana": "Major",
    "suit": "Keys",
    "cardDescription": "The Empress is depicted as a motherly figure sitting on a throne in a field of wheat, symbolizing fertility and abundance. She holds a scepter and wears a crown of stars.",
    "meanings": [
      {
        "title": "Upright Meaning",
        "description": "In the upright position, The Empress represents fertility, femininity, beauty, nature, and nurturing.",
        "keywords": ["fertility", "femininity", "beauty", "nature", "nurturing"]
      },
      {
        "title": "Reversed Meaning",
        "description": "In the reversed position, The Empress can indicate neglect, lack of growth, smothering care, and infertility.",
        "keywords": [
          "neglect",
          "lack of growth",
          "smothering care",
          "infertility"
        ]
      }
    ],
    "imageFileName": "RWS_Tarot_03_Empress",
    "prominentSymbols": [
      {
        "symbol": "throne",
        "meaning": "The throne symbolizes authority, power, and the ability to nurture and protect."
      },
      {
        "symbol": "wheat field",
        "meaning": "The wheat field represents fertility, abundance, and the cycles of nature."
      },
      {
        "symbol": "scepter",
        "meaning": "The scepter symbolizes authority, leadership, and the power to create and nurture."
      },
      {
        "symbol": "crown of stars",
        "meaning": "The crown of stars represents divine guidance, intuition, and the connection to higher realms."
      }
    ],
    "prominentColors": [
      {
        "color": "green",
        "meaning": "Green symbolizes growth, fertility, and the nurturing aspects of nature."
      },
      {
        "color": "yellow",
        "meaning": "Yellow symbolizes joy, optimism, and the creative energy of the sun."
      },
      {
        "color": "red",
        "meaning": "Red symbolizes passion, vitality, and the life force that sustains all living things."
      },
      {
        "color": "blue",
        "meaning": "Blue symbolizes intuition, depth, and the calming influence of water."
      }
    ]
  },
  {
    "cardName": "The Emperor",
    "number": 4,
    "arcana": "Major",
    "suit": "Keys",
    "cardDescription": "The Emperor sits on a throne adorned with rams' heads, symbolizing authority and power. He holds an orb and a scepter, representing the world and his control over it.",
    "meanings": [
      {
        "title": "Upright Meaning",
        "description": "In the upright position, The Emperor represents authority, structure, control, fatherhood, and leadership.",
        "keywords": [
          "authority",
          "structure",
          "control",
          "fatherhood",
          "leadership"
        ]
      },
      {
        "title": "Reversed Meaning",
        "description": "In the reversed position, The Emperor can indicate tyranny, rigidity, coldness, and overbearing power.",
        "keywords": ["tyranny", "rigidity", "coldness", "overbearing power"]
      }
    ],
    "imageFileName": "RWS_Tarot_04_Emperor",
    "prominentSymbols": [
      {
        "symbol": "throne",
        "meaning": "The throne symbolizes authority, power, and the establishment of order."
      },
      {
        "symbol": "rams' heads",
        "meaning": "The rams' heads represent determination, power, and the ability to overcome obstacles."
      },
      {
        "symbol": "orb",
        "meaning": "The orb symbolizes the world and the Emperor's control over his domain."
      },
      {
        "symbol": "scepter",
        "meaning": "The scepter symbolizes authority, leadership, and the Emperor's power to rule."
      }
    ],
    "prominentColors": [
      {
        "color": "red",
        "meaning": "Red symbolizes passion, power, and the Emperor's ability to take action."
      },
      {
        "color": "yellow",
        "meaning": "Yellow symbolizes intellect, clarity, and the Emperor's wisdom in decision-making."
      },
      {
        "color": "blue",
        "meaning": "Blue symbolizes stability, trustworthiness, and the Emperor's commitment to order."
      },
      {
        "color": "white",
        "meaning": "White symbolizes purity, authority, and the Emperor's impartiality in judgment."
      }
    ]
  },
  {
    "cardName": "The Hierophant",
    "number": 5,
    "arcana": "Major",
    "suit": "Keys",
    "cardDescription": "The Hierophant is depicted as a religious figure sitting between two pillars, similar to The High Priestess. He wears a papal crown and holds a scepter.",
    "meanings": [
      {
        "title": "Upright Meaning",
        "description": "In the upright position, The Hierophant represents tradition, conformity, morality, and religious beliefs.",
        "keywords": ["tradition", "conformity", "morality", "religious beliefs"]
      },
      {
        "title": "Reversed Meaning",
        "description": "In the reversed position, The Hierophant can indicate rebellion, subversiveness, new approaches, and unconventional thinking.",
        "keywords": [
          "rebellion",
          "subversiveness",
          "new approaches",
          "unconventional"
        ]
      }
    ],
    "imageFileName": "RWS_Tarot_05_Hierophant",
    "prominentSymbols": [
      {
        "symbol": "pillars",
        "meaning": "The pillars symbolize duality, balance, and the gateway between the physical and spiritual worlds."
      },
      {
        "symbol": "papal crown",
        "meaning": "The papal crown symbolizes authority, leadership, and divine connection."
      },
      {
        "symbol": "scepter",
        "meaning": "The scepter symbolizes power, authority, and the Hierophant's role as a spiritual leader."
      },
      {
        "symbol": "cross",
        "meaning": "The cross symbolizes faith, sacrifice, and spiritual teachings."
      }
    ],
    "prominentColors": [
      {
        "color": "red",
        "meaning": "Red symbolizes passion, power, and the Hierophant's dedication to his beliefs."
      },
      {
        "color": "blue",
        "meaning": "Blue symbolizes wisdom, truth, and the Hierophant's connection to the divine."
      },
      {
        "color": "yellow",
        "meaning": "Yellow symbolizes enlightenment, clarity, and the Hierophant's spiritual guidance."
      },
      {
        "color": "white",
        "meaning": "White symbolizes purity, holiness, and the Hierophant's commitment to righteousness."
      }
    ]
  },
  {
    "cardName": "The Lovers",
    "number": 6,
    "arcana": "Major",
    "suit": "Keys",
    "cardDescription": "The Lovers card shows a man and a woman in a garden, with an angel blessing them from above. The card symbolizes harmony, relationships, and choices.",
    "meanings": [
      {
        "title": "Upright Meaning",
        "description": "In the upright position, The Lovers card represents love, harmony, relationships, values alignment, and choices.",
        "keywords": ["love", "harmony", "relationships", "values alignment", "choices"]
      },
      {
        "title": "Reversed Meaning",
        "description": "In the reversed position, The Lovers card can indicate disharmony, imbalance, misalignment of values, and difficult choices.",
        "keywords": ["disharmony", "imbalance", "misalignment of values", "difficult choices"]
      }
    ],
    "imageFileName": "RWS_Tarot_06_Lovers",
    "prominentSymbols": [
      {
        "symbol": "man",
        "meaning": "The man symbolizes masculinity, logic, and the conscious mind."
      },
      {
        "symbol": "woman",
        "meaning": "The woman symbolizes femininity, intuition, and the subconscious mind."
      },
      {
        "symbol": "angel",
        "meaning": "The angel symbolizes divine guidance, blessings, and spiritual connection."
      },
      {
        "symbol": "tree",
        "meaning": "The tree symbolizes growth, life, and the natural world."
      },
      {
        "symbol": "serpent",
        "meaning": "The serpent symbolizes temptation, transformation, and the cycle of life and death."
      }
    ],
    "prominentColors": [
      {
        "color": "green",
        "meaning": "Green symbolizes nature, fertility, and growth, reflecting the harmony and balance of The Lovers."
      },
      {
        "color": "red",
        "meaning": "Red symbolizes passion, desire, and love, highlighting the emotional connection between the man and woman."
      },
      {
        "color": "blue",
        "meaning": "Blue symbolizes communication, wisdom, and truth, suggesting the importance of honest and open dialogue in relationships."
      },
      {
        "color": "yellow",
        "meaning": "Yellow symbolizes positivity, joy, and enlightenment, representing the blessings and divine guidance of the angel."
      }
    ]
  }
  ,
  {
    "cardName": "The Chariot",
    "number": 7,
    "arcana": "Major",
    "suit": "Keys",
    "cardDescription": "The Chariot depicts a warrior riding a chariot, pulled by two sphinxes of opposite colors. The card represents control, willpower, and victory.",
    "meanings": [
      {
        "title": "Upright Meaning",
        "description": "In the upright position, The Chariot represents control, willpower, success, action, and determination.",
        "keywords": ["control", "willpower", "success", "action", "determination"]
      },
      {
        "title": "Reversed Meaning",
        "description": "In the reversed position, The Chariot can indicate lack of control, lack of direction, aggression, and failure.",
        "keywords": ["lack of control", "lack of direction", "aggression", "failure"]
      }
    ],
    "imageFileName": "RWS_Tarot_07_Chariot",
    "prominentSymbols": [
      {
        "symbol": "chariot",
        "meaning": "The chariot symbolizes travel, progression, and control over one's path."
      },
      {
        "symbol": "sphinxes",
        "meaning": "The sphinxes represent opposing forces or aspects of the self, requiring balance and control."
      },
      {
        "symbol": "armor",
        "meaning": "The armor symbolizes protection, strength, and preparedness for battle."
      },
      {
        "symbol": "city",
        "meaning": "The city in the background symbolizes civilization, progress, and the destination of the chariot's journey."
      }
    ],
    "prominentColors": [
      {
        "color": "yellow",
        "meaning": "Yellow symbolizes energy, vitality, and confidence, reflecting the dynamic nature of The Chariot."
      },
      {
        "color": "blue",
        "meaning": "Blue symbolizes stability, control, and communication, emphasizing the need for clear direction and purpose."
      },
      {
        "color": "black",
        "meaning": "Black symbolizes mystery, the unknown, and hidden forces, suggesting challenges or obstacles to overcome."
      },
      {
        "color": "white",
        "meaning": "White symbolizes purity, clarity, and spiritual enlightenment, indicating the spiritual guidance and purity of intention needed for victory."
      }
    ]
  }
  ,
  {
    "cardName": "Strength",
    "number": 8,
    "arcana": "Major",
    "suit": "Keys",
    "cardDescription": "Strength shows a woman gently closing the jaws of a lion. The card symbolizes inner strength, courage, and compassion.",
    "meanings": [
      {
        "title": "Upright Meaning",
        "description": "In the upright position, Strength represents strength, courage, patience, control, and compassion.",
        "keywords": ["strength", "courage", "patience", "control", "compassion"]
      },
      {
        "title": "Reversed Meaning",
        "description": "In the reversed position, Strength can indicate weakness, self-doubt, lack of self-discipline, and cowardice.",
        "keywords": ["weakness", "self-doubt", "lack of self-discipline", "cowardice"]
      }
    ],
    "imageFileName": "RWS_Tarot_08_Strength",
    "prominentSymbols": [
      {
        "symbol": "woman",
        "meaning": "The woman symbolizes inner strength, nurturing, and feminine power."
      },
      {
        "symbol": "lion",
        "meaning": "The lion represents courage, strength, and the raw, primal aspects of the self."
      },
      {
        "symbol": "lemniscate",
        "meaning": "The lemniscate, or infinity symbol, signifies infinite strength, balance, and harmony."
      },
      {
        "symbol": "mountains",
        "meaning": "The mountains in the background represent obstacles, challenges, and the need for perseverance."
      }
    ],
    "prominentColors": [
      {
        "color": "yellow",
        "meaning": "Yellow symbolizes energy, joy, and optimism, reflecting the inner strength and courage of the woman."
      },
      {
        "color": "green",
        "meaning": "Green symbolizes growth, healing, and renewal, suggesting the compassionate and nurturing nature of strength."
      },
      {
        "color": "red",
        "meaning": "Red symbolizes passion, courage, and vitality, highlighting the fierce determination and courage needed to face challenges."
      },
      {
        "color": "blue",
        "meaning": "Blue symbolizes peace, tranquility, and clarity, indicating the calm control and patience required to manage difficult situations."
      }
    ]
  }
  ,
  {
    "cardName": "The Hermit",
    "number": 9,
    "arcana": "Major",
    "suit": "Keys",
    "cardDescription": "The Hermit stands alone on a mountain peak, holding a lantern and a staff. The card represents introspection, solitude, and guidance.",
    "meanings": [
      {
        "title": "Upright Meaning",
        "description": "In the upright position, The Hermit represents introspection, solitude, guidance, contemplation, and inner wisdom.",
        "keywords": ["introspection", "solitude", "guidance", "contemplation", "inner wisdom"]
      },
      {
        "title": "Reversed Meaning",
        "description": "In the reversed position, The Hermit can indicate loneliness, isolation, feeling lost, withdrawal, and paranoia.",
        "keywords": ["loneliness", "isolation", "lost", "withdrawal", "paranoia"]
      }
    ],
    "imageFileName": "RWS_Tarot_09_Hermit",
    "prominentSymbols": [
      {
        "symbol": "mountain",
        "meaning": "The mountain symbolizes challenges, obstacles, and the journey to enlightenment."
      },
      {
        "symbol": "lantern",
        "meaning": "The lantern represents inner guidance, wisdom, and the search for truth in the darkness."
      },
      {
        "symbol": "staff",
        "meaning": "The staff symbolizes authority, wisdom, and the journey of self-discovery."
      },
      {
        "symbol": "cloak",
        "meaning": "The cloak symbolizes protection, concealment, and the need for introspection and solitude."
      }
    ],
    "prominentColors": [
      {
        "color": "gray",
        "meaning": "Gray symbolizes neutrality, wisdom, and balance, reflecting the introspective nature of The Hermit's journey."
      },
      {
        "color": "yellow",
        "meaning": "Yellow symbolizes enlightenment, joy, and clarity, representing the inner wisdom and guidance The Hermit seeks."
      },
      {
        "color": "blue",
        "meaning": "Blue symbolizes peace, tranquility, and intuition, suggesting the calm contemplation and guidance provided by The Hermit."
      },
      {
        "color": "white",
        "meaning": "White symbolizes purity, clarity, and spiritual enlightenment, indicating the spiritual guidance and truth The Hermit seeks."
      }
    ]
  }
  ,
  {
    "cardName": "The Wheel of Fortune",
    "number": 10,
    "arcana": "Major",
    "suit": "Keys",
    "cardDescription": "The Wheel of Fortune features a large wheel surrounded by various creatures and symbols. It represents cycles, change, and the ups and downs of life.",
    "meanings": [
      {
        "title": "Upright Meaning",
        "description": "In the upright position, The Wheel of Fortune represents good luck, karma, life cycles, destiny, and a turning point.",
        "keywords": ["good luck", "karma", "life cycles", "destiny", "turning point"]
      },
      {
        "title": "Reversed Meaning",
        "description": "In the reversed position, The Wheel of Fortune can indicate bad luck, resistance to change, breaking cycles, and unforeseen events.",
        "keywords": ["bad luck", "resistance to change", "breaking cycles", "unforeseen events"]
      }
    ],
    "imageFileName": "RWS_Tarot_10_Wheel_of_Fortune",
    "prominentSymbols": [
      {
        "symbol": "wheel",
        "meaning": "The wheel symbolizes the cycles of life, fate, and the interconnectedness of all things."
      },
      {
        "symbol": "creatures",
        "meaning": "The creatures symbolize the four fixed signs of the zodiac and the continuous cycle of change and evolution."
      },
      {
        "symbol": "symbols",
        "meaning": "The symbols represent the ever-changing nature of life and the lessons to be learned from each cycle."
      },
      {
        "symbol": "clouds",
        "meaning": "The clouds symbolize uncertainty and the unpredictable nature of fate and destiny."
      }
    ],
    "prominentColors": [
      {
        "color": "blue",
        "meaning": "Blue symbolizes stability, trust, and calmness, suggesting the need to trust in the natural cycles of life."
      },
      {
        "color": "yellow",
        "meaning": "Yellow symbolizes positivity, energy, and optimism, indicating a turning point or change for the better."
      },
      {
        "color": "red",
        "meaning": "Red symbolizes passion, action, and vitality, suggesting a period of transformation and change."
      },
      {
        "color": "green",
        "meaning": "Green symbolizes growth, renewal, and balance, indicating a time of positive change and new opportunities."
      }
    ]
  }
  ,
  {
    "cardName": "Justice",
    "number": 11,
    "arcana": "Major",
    "suit": "Keys",
    "cardDescription": "Justice depicts a figure seated on a throne, holding a sword in one hand and scales in the other. It symbolizes fairness, truth, and the law.",
    "meanings": [
      {
        "title": "Upright Meaning",
        "description": "In the upright position, Justice represents justice, fairness, truth, cause and effect, and the law.",
        "keywords": ["justice", "fairness", "truth", "cause and effect", "law"]
      },
      {
        "title": "Reversed Meaning",
        "description": "In the reversed position, Justice can indicate unfairness, lack of accountability, dishonesty, and injustice.",
        "keywords": ["unfairness", "lack of accountability", "dishonesty", "injustice"]
      }
    ],
    "imageFileName": "RWS_Tarot_11_Justice",
    "prominentSymbols": [
      {
        "symbol": "scales",
        "meaning": "The scales symbolize balance, fairness, and the weighing of decisions."
      },
      {
        "symbol": "sword",
        "meaning": "The sword symbolizes truth, justice, and the power of reason and intellect."
      },
      {
        "symbol": "throne",
        "meaning": "The throne symbolizes authority, power, and the seat of judgment."
      },
      {
        "symbol": "pillar",
        "meaning": "The pillar symbolizes stability, strength, and the support of justice and truth."
      }
    ],
    "prominentColors": [
      {
        "color": "red",
        "meaning": "Red symbolizes passion, action, and justice, suggesting the need for action and fairness."
      },
      {
        "color": "blue",
        "meaning": "Blue symbolizes truth, clarity, and justice, indicating a need for honesty and integrity."
      },
      {
        "color": "yellow",
        "meaning": "Yellow symbolizes clarity, wisdom, and intellect, suggesting the need for rational judgment."
      },
      {
        "color": "white",
        "meaning": "White symbolizes purity, truth, and fairness, indicating a need for impartiality and objectivity."
      }
    ]
  }
  ,
  {
    "cardName": "The Hanged Man",
    "number": 12,
    "arcana": "Major",
    "suit": "Keys",
    "cardDescription": "The Hanged Man is depicted hanging upside-down by one foot from a tree. It represents sacrifice, new perspectives, and surrender.",
    "meanings": [
      {
        "title": "Upright Meaning",
        "description": "In the upright position, The Hanged Man represents a pause, surrender, letting go, and new perspectives.",
        "keywords": ["pause", "surrender", "letting go", "new perspectives"]
      },
      {
        "title": "Reversed Meaning",
        "description": "In the reversed position, The Hanged Man can indicate delays, resistance, stalling, and indecision.",
        "keywords": ["delays", "resistance", "stalling", "indecision"]
      }
    ],
    "imageFileName": "RWS_Tarot_12_Hanged_Man",
    "prominentSymbols": [
      {
        "symbol": "tree",
        "meaning": "The tree symbolizes life, growth, and connection to the earth, suggesting the need to look at things from a different perspective."
      },
      {
        "symbol": "halo",
        "meaning": "The halo symbolizes enlightenment, spiritual awakening, and divine guidance, indicating a need to surrender to a higher power or wisdom."
      },
      {
        "symbol": "bound foot",
        "meaning": "The bound foot symbolizes sacrifice, restriction, and surrender, suggesting the need to let go of control and accept a new way of thinking."
      },
      {
        "symbol": "serenity",
        "meaning": "The serenity of the figure's expression symbolizes peace, acceptance, and tranquility, indicating the benefits of surrender and acceptance."
      }
    ],
    "prominentColors": [
      {
        "color": "blue",
        "meaning": "Blue symbolizes calmness, introspection, and intuition, suggesting the need to reflect on one's situation and find inner peace."
      },
      {
        "color": "green",
        "meaning": "Green symbolizes growth, renewal, and harmony with nature, indicating the need for a fresh perspective and new beginnings."
      },
      {
        "color": "yellow",
        "meaning": "Yellow symbolizes enlightenment, positivity, and clarity, suggesting the need to see things from a different angle and embrace change."
      },
      {
        "color": "red",
        "meaning": "Red symbolizes passion, action, and courage, indicating the need to take bold steps and face challenges with determination."
      }
    ]
  }
  ,
  {
    "cardName": "Death",
    "number": 13,
    "arcana": "Major",
    "suit": "Keys",
    "cardDescription": "Death depicts a skeleton riding a white horse, with people of different social statuses lying in its path. It symbolizes endings, transformation, and renewal.",
    "meanings": [
      {
        "title": "Upright Meaning",
        "description": "In the upright position, Death represents endings, change, transformation, and transition.",
        "keywords": ["endings", "change", "transformation", "transition"]
      },
      {
        "title": "Reversed Meaning",
        "description": "In the reversed position, Death can indicate resistance to change, personal transformation, and inner purging.",
        "keywords": ["resistance to change", "personal transformation", "inner purging"]
      }
    ],
    "imageFileName": "RWS_Tarot_13_Death",
    "prominentSymbols": [
      {
        "symbol": "skeleton",
        "meaning": "The skeleton symbolizes the end of life, mortality, and the impermanence of existence, suggesting the need to accept endings and embrace change."
      },
      {
        "symbol": "white horse",
        "meaning": "The white horse symbolizes purity, spirit, and the journey of the soul, indicating a transition to a new phase of life or a spiritual transformation."
      },
      {
        "symbol": "fallen figures",
        "meaning": "The fallen figures represent people from different social statuses, symbolizing the universal nature of death and the leveling of all individuals in its path."
      },
      {
        "symbol": "rising sun",
        "meaning": "The rising sun symbolizes new beginnings, hope, and the promise of a new day, suggesting that death is not the end but a new beginning."
      }
    ],
    "prominentColors": [
      {
        "color": "black",
        "meaning": "Black symbolizes death, mourning, and the unknown, suggesting the need to confront fears and embrace the mysteries of life."
      },
      {
        "color": "white",
        "meaning": "White symbolizes purity, innocence, and spiritual awakening, indicating a transformation or purification process."
      },
      {
        "color": "yellow",
        "meaning": "Yellow symbolizes enlightenment, clarity, and optimism, suggesting that death brings understanding and a new perspective."
      },
      {
        "color": "blue",
        "meaning": "Blue symbolizes tranquility, peace, and acceptance, indicating the need to find peace with the natural cycle of life and death."
      }
    ]
  }
  ,
  {
    "cardName": "Temperance",
    "number": 14,
    "arcana": "Major",
    "suit": "Keys",
    "cardDescription": "Temperance depicts an angelic figure pouring water between two cups, symbolizing balance, moderation, and harmony.",
    "meanings": [
      {
        "title": "Upright Meaning",
        "description": "In the upright position, Temperance represents balance, moderation, patience, purpose, and meaning.",
        "keywords": ["balance", "moderation", "patience", "purpose", "meaning"]
      },
      {
        "title": "Reversed Meaning",
        "description": "In the reversed position, Temperance can indicate imbalance, excess, self-healing, and re-alignment.",
        "keywords": ["imbalance", "excess", "self-healing", "re-alignment"]
      }
    ],
    "imageFileName": "RWS_Tarot_14_Temperance",
    "prominentSymbols": [
      {
        "symbol": "angel",
        "meaning": "The angel symbolizes divine intervention, guidance, and spiritual connection, suggesting the need to find a higher purpose or spiritual path."
      },
      {
        "symbol": "water",
        "meaning": "Water symbolizes emotions, intuition, and the subconscious mind, indicating the need to balance and harmonize emotions."
      },
      {
        "symbol": "cups",
        "meaning": "The cups symbolize emotions, relationships, and the heart, suggesting the need to find harmony and balance in relationships."
      },
      {
        "symbol": "path",
        "meaning": "The path symbolizes the journey of life, indicating the need to find balance and moderation on life's path."
      },
      {
        "symbol": "mountains",
        "meaning": "Mountains symbolize challenges, obstacles, and the need for perseverance, suggesting the need to overcome challenges with patience and moderation."
      }
    ],
    "prominentColors": [
      {
        "color": "blue",
        "meaning": "Blue symbolizes tranquility, peace, and calmness, suggesting the need to find inner peace and balance."
      },
      {
        "color": "yellow",
        "meaning": "Yellow symbolizes joy, happiness, and positivity, indicating the need to approach life with optimism and enthusiasm."
      },
      {
        "color": "red",
        "meaning": "Red symbolizes passion, energy, and action, suggesting the need to take decisive action with moderation and balance."
      },
      {
        "color": "white",
        "meaning": "White symbolizes purity, clarity, and spiritual awakening, indicating the need to find spiritual balance and harmony."
      }
    ]
  }
  ,
  {
    "cardName": "The Devil",
    "number": 15,
    "arcana": "Major",
    "suit": "Keys",
    "cardDescription": "The Devil shows a horned figure with two chained figures beneath him. It represents bondage, materialism, and the shadow self.",
    "meanings": [
      {
        "title": "Upright Meaning",
        "description": "In the upright position, The Devil represents bondage, addiction, sexuality, and materialism.",
        "keywords": ["bondage", "addiction", "sexuality", "materialism"]
      },
      {
        "title": "Reversed Meaning",
        "description": "In the reversed position, The Devil can indicate release, freedom, reclaiming power, and breaking chains.",
        "keywords": ["release", "freedom", "reclaiming power", "breaking chains"]
      }
    ],
    "imageFileName": "RWS_Tarot_15_Devil",
    "prominentSymbols": [
      {
        "symbol": "horned figure",
        "meaning": "The horned figure symbolizes temptation, desire, and the shadow self, suggesting the need to confront and overcome inner demons."
      },
      {
        "symbol": "chains",
        "meaning": "The chains symbolize bondage and restriction, indicating the need to break free from limiting beliefs or situations."
      },
      {
        "symbol": "flames",
        "meaning": "The flames symbolize passion, desire, and transformation, suggesting the need to channel desires in a positive direction."
      },
      {
        "symbol": "nude figures",
        "meaning": "The nude figures symbolize vulnerability and exposure, indicating the need to confront fears and insecurities."
      }
    ],
    "prominentColors": [
      {
        "color": "black",
        "meaning": "Black symbolizes darkness, mystery, and the unknown, suggesting the need to explore hidden aspects of the self."
      },
      {
        "color": "red",
        "meaning": "Red symbolizes passion, desire, and intensity, indicating the need to harness and control powerful emotions."
      },
      {
        "color": "gray",
        "meaning": "Gray symbolizes neutrality and balance, suggesting the need to find a balance between extremes."
      },
      {
        "color": "yellow",
        "meaning": "Yellow symbolizes clarity, intellect, and illumination, indicating the need to shed light on dark or hidden aspects of the self."
      }
    ]
  },
  {
    "cardName": "The Tower",
    "number": 16,
    "arcana": "Major",
    "suit": "Keys",
    "cardDescription": "The Tower depicts a tall tower struck by lightning, with figures falling from it. It symbolizes sudden change, upheaval, and revelation.",
    "meanings": [
      {
        "title": "Upright Meaning",
        "description": "In the upright position, The Tower represents sudden change, upheaval, chaos, revelation, and awakening.",
        "keywords": ["sudden change", "upheaval", "chaos", "revelation", "awakening"]
      },
      {
        "title": "Reversed Meaning",
        "description": "In the reversed position, The Tower can indicate personal transformation, fear of change, and averting disaster.",
        "keywords": ["personal transformation", "fear of change", "averting disaster"]
      }
    ],
    "imageFileName": "RWS_Tarot_16_Tower",
    "prominentSymbols": [
      {
        "symbol": "tower",
        "meaning": "The tower symbolizes a structure built on false beliefs or shaky foundations, suggesting the need to rebuild and start anew."
      },
      {
        "symbol": "lightning",
        "meaning": "Lightning symbolizes a sudden and unexpected event or realization, indicating the need to embrace change and let go of the past."
      },
      {
        "symbol": "falling figures",
        "meaning": "The falling figures symbolize destruction and chaos, suggesting the need to surrender to forces beyond control."
      },
      {
        "symbol": "fire",
        "meaning": "Fire symbolizes destruction and purification, indicating the need to let go of what no longer serves for new growth to occur."
      }
    ],
    "prominentColors": [
      {
        "color": "red",
        "meaning": "Red symbolizes passion, intensity, and upheaval, suggesting the need to channel energy into positive transformation."
      },
      {
        "color": "yellow",
        "meaning": "Yellow symbolizes illumination and insight, indicating the need to embrace change and seek higher understanding."
      },
      {
        "color": "gray",
        "meaning": "Gray symbolizes neutrality and detachment, suggesting the need to step back and reassess the situation."
      },
      {
        "color": "blue",
        "meaning": "Blue symbolizes clarity and calmness, indicating the need to stay grounded and focused during times of upheaval."
      }
    ]
  },
  {
    "cardName": "The Star",
    "number": 17,
    "arcana": "Major",
    "suit": "Keys",
    "cardDescription": "The Star shows a naked woman pouring water into a pool and onto the land, with stars shining above. It represents hope, inspiration, and serenity.",
    "meanings": [
      {
        "title": "Upright Meaning",
        "description": "In the upright position, The Star represents hope, faith, inspiration, spirituality, and renewal.",
        "keywords": ["hope", "faith", "inspiration", "spirituality", "renewal"]
      },
      {
        "title": "Reversed Meaning",
        "description": "In the reversed position, The Star can indicate lack of faith, despair, self-trust, and disconnection.",
        "keywords": ["lack of faith", "despair", "self-trust", "disconnection"]
      }
    ],
    "imageFileName": "RWS_Tarot_17_Star",
    "prominentSymbols": [
      {
        "symbol": "naked woman",
        "meaning": "The naked woman symbolizes vulnerability and openness, suggesting the need to be authentic and true to oneself."
      },
      {
        "symbol": "stars",
        "meaning": "Stars symbolize hope and guidance, indicating the need to trust in a higher purpose or divine plan."
      },
      {
        "symbol": "water",
        "meaning": "Water symbolizes emotions and intuition, suggesting the need to listen to one's inner voice and follow one's heart."
      },
      {
        "symbol": "bird",
        "meaning": "The bird symbolizes freedom and transcendence, indicating the need to rise above challenges and limitations."
      }
    ],
    "prominentColors": [
      {
        "color": "blue",
        "meaning": "Blue symbolizes peace and tranquility, suggesting the need to find inner calm and clarity."
      },
      {
        "color": "yellow",
        "meaning": "Yellow symbolizes optimism and joy, indicating the need to stay positive and hopeful."
      },
      {
        "color": "green",
        "meaning": "Green symbolizes growth and healing, suggesting the need to nurture oneself and others."
      },
      {
        "color": "white",
        "meaning": "White symbolizes purity and clarity, indicating the need to let go of negativity and embrace purity of spirit."
      }
    ]
  },
  {
    "cardName": "The Moon",
    "number": 18,
    "arcana": "Major",
    "suit": "Keys",
    "cardDescription": "The Moon features a night scene with a full moon, two towers, a wolf, a dog howling, and a crayfish emerging from water. It symbolizes intuition, fear, and the subconscious.",
    "meanings": [
      {
        "title": "Upright Meaning",
        "description": "In the upright position, The Moon represents illusion, fear, anxiety, the subconscious, and intuition.",
        "keywords": ["illusion", "fear", "anxiety", "subconscious", "intuition"]
      },
      {
        "title": "Reversed Meaning",
        "description": "In the reversed position, The Moon can indicate the release of fear, repressed emotion, inner clarity, and facing fears.",
        "keywords": ["release of fear", "repressed emotion", "inner clarity", "facing fears"]
      }
    ],
    "imageFileName": "RWS_Tarot_18_Moon",
    "prominentSymbols": [
      {
        "symbol": "moon",
        "meaning": "The moon symbolizes the subconscious mind, emotions, and cycles, suggesting the need to trust in the unknown and navigate through uncertainty."
      },
      {
        "symbol": "wolf",
        "meaning": "The wolf symbolizes instinct, intuition, and the wild, indicating the need to listen to one's inner voice and primal instincts."
      },
      {
        "symbol": "dog",
        "meaning": "The dog symbolizes loyalty and companionship, suggesting the need for emotional support and guidance."
      },
      {
        "symbol": "crayfish",
        "meaning": "The crayfish symbolizes regeneration and renewal, indicating the need to let go of the past and embrace new beginnings."
      },
      {
        "symbol": "towers",
        "meaning": "The towers symbolize illusion and deception, suggesting the need to look beyond surface appearances and uncover hidden truths."
      }
    ],
    "prominentColors": [
      {
        "color": "blue",
        "meaning": "Blue symbolizes intuition and inner knowing, suggesting the need to trust in one's instincts and follow one's inner guidance."
      },
      {
        "color": "yellow",
        "meaning": "Yellow symbolizes illumination and clarity, indicating the need to shine light on the subconscious and uncover hidden fears."
      },
      {
        "color": "black",
        "meaning": "Black symbolizes the unknown and the subconscious mind, suggesting the need to explore the depths of one's psyche and confront fears."
      },
      {
        "color": "white",
        "meaning": "White symbolizes purity and spiritual growth, indicating the need to find clarity and peace within oneself."
      }
    ]
  },
  {
    "cardName": "The Sun",
    "number": 19,
    "arcana": "Major",
    "suit": "Keys",
    "cardDescription": "The Sun shows a joyful child riding a white horse under the bright sun, surrounded by sunflowers. It represents success, vitality, and joy.",
    "meanings": [
      {
        "title": "Upright Meaning",
        "description": "In the upright position, The Sun represents positivity, fun, warmth, success, and vitality.",
        "keywords": ["positivity", "fun", "warmth", "success", "vitality"]
      },
      {
        "title": "Reversed Meaning",
        "description": "In the reversed position, The Sun can indicate negativity, depression, sadness, and lack of clarity.",
        "keywords": ["negativity", "depression", "sadness", "lack of clarity"]
      }
    ],
    "imageFileName": "RWS_Tarot_19_Sun",
    "prominentSymbols": [
      {
        "symbol": "child",
        "meaning": "The child symbolizes innocence, joy, and new beginnings, suggesting the need to approach life with a fresh perspective and open heart."
      },
      {
        "symbol": "white horse",
        "meaning": "The white horse symbolizes purity, freedom, and spiritual growth, indicating the need to embrace your true self and follow your path with confidence."
      },
      {
        "symbol": "sun",
        "meaning": "The sun symbolizes success, vitality, and enlightenment, suggesting the need to shine brightly and embrace opportunities for growth and transformation."
      },
      {
        "symbol": "sunflowers",
        "meaning": "Sunflowers symbolize joy, happiness, and optimism, indicating the need to focus on the positive aspects of life and cultivate a sense of gratitude."
      }
    ],
    "prominentColors": [
      {
        "color": "yellow",
        "meaning": "Yellow symbolizes happiness, positivity, and enlightenment, suggesting the need to stay optimistic and focus on the bright side of life."
      },
      {
        "color": "white",
        "meaning": "White symbolizes purity, clarity, and new beginnings, indicating the need to let go of the past and embrace a fresh start."
      },
      {
        "color": "green",
        "meaning": "Green symbolizes growth, abundance, and vitality, suggesting the need to nurture your dreams and cultivate a sense of well-being."
      },
      {
        "color": "red",
        "meaning": "Red symbolizes passion, energy, and vitality, indicating the need to take action and pursue your goals with enthusiasm."
      }
    ]
  },
  {
    "cardName": "Judgement",
    "number": 20,
    "arcana": "Major",
    "suit": "Keys",
    "cardDescription": "Judgement depicts an angel blowing a trumpet, with people rising from their graves. It symbolizes rebirth, inner calling, and absolution.",
    "meanings": [
      {
        "title": "Upright Meaning",
        "description": "In the upright position, Judgement represents judgement, rebirth, inner calling, and absolution.",
        "keywords": ["judgement", "rebirth", "inner calling", "absolution"]
      },
      {
        "title": "Reversed Meaning",
        "description": "In the reversed position, Judgement can indicate self-doubt, failure to learn lessons, and the need for self-examination.",
        "keywords": ["self-doubt", "failure to learn lessons", "self-examination"]
      }
    ],
    "imageFileName": "RWS_Tarot_20_Judgement",
    "prominentSymbols": [
      {
        "symbol": "angel",
        "meaning": "The angel symbolizes divine intervention, guidance, and awakening, suggesting the need to listen to your inner voice and follow your spiritual path."
      },
      {
        "symbol": "trumpet",
        "meaning": "The trumpet symbolizes awakening, revelation, and the call to action, indicating the need to heed the call of destiny and embrace change."
      },
      {
        "symbol": "rising figures",
        "meaning": "The rising figures symbolize rebirth, renewal, and transformation, suggesting the need to let go of the past and embrace a new beginning."
      },
      {
        "symbol": "cross",
        "meaning": "The cross symbolizes sacrifice, redemption, and faith, indicating the need to make sacrifices for a greater good and have faith in the future."
      }
    ],
    "prominentColors": [
      {
        "color": "blue",
        "meaning": "Blue symbolizes spirituality, intuition, and inner peace, suggesting the need to connect with your spiritual side and trust your instincts."
      },
      {
        "color": "red",
        "meaning": "Red symbolizes passion, vitality, and action, indicating the need to take bold steps and pursue your goals with determination."
      },
      {
        "color": "white",
        "meaning": "White symbolizes purity, clarity, and new beginnings, suggesting the need to let go of the past and embrace a fresh start."
      },
      {
        "color": "yellow",
        "meaning": "Yellow symbolizes enlightenment, positivity, and joy, indicating the need to stay optimistic and focus on the bright side of life."
      }
    ]
  },
  {
    "cardName": "The World",
    "number": 21,
    "arcana": "Major",
    "suit": "Keys",
    "cardDescription": "The World shows a figure surrounded by a laurel wreath, with symbols of the four elements in each corner. It represents completion, accomplishment, and unity.",
    "meanings": [
      {
        "title": "Upright Meaning",
        "description": "In the upright position, The World represents completion, accomplishment, travel, fulfillment, and harmony.",
        "keywords": ["completion", "accomplishment", "travel", "fulfillment", "harmony"]
      },
      {
        "title": "Reversed Meaning",
        "description": "In the reversed position, The World can indicate incompletion, lack of closure, lack of achievement, and stagnation.",
        "keywords": ["incompletion", "lack of closure", "lack of achievement", "stagnation"]
      }
    ],
    "imageFileName": "RWS_Tarot_21_World",
    "prominentSymbols": [
      {
        "symbol": "laurel wreath",
        "meaning": "The laurel wreath symbolizes victory, success, and achievement, suggesting the need to celebrate your accomplishments and acknowledge your hard work."
      },
      {
        "symbol": "four elements",
        "meaning": "The symbols of the four elements (earth, air, fire, water) represent balance and harmony, indicating the need to find balance in all aspects of your life."
      },
      {
        "symbol": "dancing figure",
        "meaning": "The dancing figure symbolizes joy, celebration, and freedom, suggesting the need to embrace life with enthusiasm and optimism."
      },
      {
        "symbol": "ribbon",
        "meaning": "The ribbon symbolizes unity and completion, indicating the need to tie up loose ends and bring projects to a successful conclusion."
      }
    ],
    "prominentColors": [
      {
        "color": "green",
        "meaning": "Green symbolizes growth, renewal, and harmony, suggesting the need to nurture your relationships and personal growth."
      },
      {
        "color": "blue",
        "meaning": "Blue symbolizes peace, tranquility, and communication, indicating the need to express yourself clearly and listen to others."
      },
      {
        "color": "red",
        "meaning": "Red symbolizes passion, energy, and action, suggesting the need to take bold steps and pursue your goals with determination."
      },
      {
        "color": "yellow",
        "meaning": "Yellow symbolizes enlightenment, positivity, and joy, indicating the need to stay optimistic and focus on the bright side of life."
      }
    ]
  },
  {
    "cardName": "Ace of Wands",
    "number": 1,
    "arcana": "Minor",
    "suit": "Wands",
    "cardDescription": "The Ace of Wands depicts a hand holding a budding wand, symbolizing new beginnings, inspiration, and potential.",
    "cardUprightMeaning": "New beginnings, inspiration, creativity, potential.",
    "cardReverseMeaning": "Delays, lack of motivation, wasted potential, uninspired.",
    "imageFileName": "Wands01",
    "prominentSymbols": ["hand", "budding wand", "landscape"],
    "prominentColors": ["yellow", "green", "blue", "brown"]
  },
  {
    "cardName": "Two of Wands",
    "number": 2,
    "arcana": "Minor",
    "suit": "Wands",
    "cardDescription": "The Two of Wands shows a figure holding a globe, looking out over a landscape. It represents planning, decision-making, and the future.",
    "cardUprightMeaning": "Future planning, progress, decisions, discovery.",
    "cardReverseMeaning": "Fear of change, indecision, lack of planning, overwhelmed.",
    "imageFileName": "Wands02",
    "prominentSymbols": ["figure", "globe", "landscape", "wand"],
    "prominentColors": ["red", "blue", "yellow", "green"]
  },
  {
    "cardName": "Three of Wands",
    "number": 3,
    "arcana": "Minor",
    "suit": "Wands",
    "cardDescription": "The Three of Wands depicts a figure looking out over a vast landscape, with three wands standing firmly. It symbolizes exploration, foresight, and expansion.",
    "cardUprightMeaning": "Expansion, foresight, overseas opportunities, long-term plans.",
    "cardReverseMeaning": "Delays, obstacles, frustration, lack of foresight.",
    "imageFileName": "Wands03",
    "prominentSymbols": ["figure", "landscape", "three wands", "sea"],
    "prominentColors": ["red", "green", "blue", "yellow"]
  },
  {
    "cardName": "Four of Wands",
    "number": 4,
    "arcana": "Minor",
    "suit": "Wands",
    "cardDescription": "The Four of Wands depicts a celebration with a background of a castle. It represents community, homecoming, and joy.",
    "cardUprightMeaning": "Celebration, joy, harmony, relaxation, homecoming.",
    "cardReverseMeaning": "Lack of support, feeling unwelcome, transient joy, instability.",
    "imageFileName": "Wands04",
    "prominentSymbols": ["celebration", "castle", "four wands", "garlands"],
    "prominentColors": ["yellow", "red", "green", "blue"]
  },
  {
    "cardName": "Five of Wands",
    "number": 5,
    "arcana": "Minor",
    "suit": "Wands",
    "cardDescription": "The Five of Wands shows five people holding wands and appearing to be in conflict. It represents competition, conflict, and disagreement.",
    "cardUprightMeaning": "Conflict, competition, disagreements, tension, diversity.",
    "cardReverseMeaning": "Avoiding conflict, respecting differences, finding common ground.",
    "imageFileName": "Wands05",
    "prominentSymbols": ["five people", "wands", "struggle", "disarray"],
    "prominentColors": ["orange", "yellow", "blue", "green"]
  },
  {
    "cardName": "Six of Wands",
    "number": 6,
    "arcana": "Minor",
    "suit": "Wands",
    "cardDescription": "The Six of Wands depicts a figure riding a horse, holding a wand with a wreath. It symbolizes victory, success, and recognition.",
    "cardUprightMeaning": "Victory, success, public recognition, progress, self-confidence.",
    "cardReverseMeaning": "Failure, lack of recognition, lack of achievement, fall from grace.",
    "imageFileName": "Wands06",
    "prominentSymbols": ["figure on horse", "wreath", "crowd", "six wands"],
    "prominentColors": ["red", "yellow", "white", "green"]
  },
  {
    "cardName": "Seven of Wands",
    "number": 7,
    "arcana": "Minor",
    "suit": "Wands",
    "cardDescription": "The Seven of Wands shows a figure standing on a hill, defending against opponents. It represents standing one's ground, perseverance, and challenge.",
    "cardUprightMeaning": "Perseverance, defensive, maintaining control, challenge.",
    "cardReverseMeaning": "Giving up, overwhelmed, yielding, lack of confidence.",
    "imageFileName": "Wands07",
    "prominentSymbols": [
      "figure on hill",
      "opponents",
      "seven wands",
      "defensive stance"
    ],
    "prominentColors": ["red", "yellow", "green", "blue"]
  },
  {
    "cardName": "Eight of Wands",
    "number": 8,
    "arcana": "Minor",
    "suit": "Wands",
    "cardDescription": "The Eight of Wands shows eight wands flying through the air, symbolizing swift action, movement, and rapid change.",
    "cardUprightMeaning": "Rapid action, movement, quick decisions, swift changes.",
    "cardReverseMeaning": "Delays, frustration, resisting change, internal conflict.",
    "imageFileName": "Wands08",
    "prominentSymbols": ["eight wands", "speed", "movement", "river"],
    "prominentColors": ["yellow", "green", "blue", "red"]
  },
  {
    "cardName": "Nine of Wands",
    "number": 9,
    "arcana": "Minor",
    "suit": "Wands",
    "cardDescription": "The Nine of Wands shows a figure standing guard with a bandaged head, surrounded by nine wands. It represents resilience, persistence, and boundaries.",
    "cardUprightMeaning": "Resilience, courage, persistence, test of faith, boundaries.",
    "cardReverseMeaning": "Inner resources, struggle, overwhelm, defensive, paranoia.",
    "imageFileName": "Wands09",
    "prominentSymbols": ["bandaged figure", "nine wands", "mountains"],
    "prominentColors": ["yellow", "green", "red", "blue"]
  },
  {
    "cardName": "Ten of Wands",
    "number": 10,
    "arcana": "Minor",
    "suit": "Wands",
    "cardDescription": "The Ten of Wands depicts a figure carrying a heavy load of ten wands. It symbolizes burden, responsibility, and hard work.",
    "cardUprightMeaning": "Burden, responsibility, hard work, stress, achievement.",
    "cardReverseMeaning": "Release, letting go, too much to bear, overwhelmed.",
    "imageFileName": "Wands10",
    "prominentSymbols": ["figure", "ten wands", "burden"],
    "prominentColors": ["yellow", "red", "green", "brown"]
  },
  {
    "cardName": "Page of Wands",
    "arcana": "Minor",
    "suit": "Wands",
    "cardDescription": "The Page of Wands shows a young figure holding a staff, looking at it with curiosity. It represents enthusiasm, exploration, and discovery.",
    "cardUprightMeaning": "Enthusiasm, exploration, discovery, free spirit.",
    "cardReverseMeaning": "Lack of direction, procrastination, creating conflict.",
    "imageFileName": "Wands11",
    "prominentSymbols": ["young figure", "staff", "desert"],
    "prominentColors": ["yellow", "red", "blue", "green"]
  },
  {
    "cardName": "Knight of Wands",
    "arcana": "Minor",
    "suit": "Wands",
    "cardDescription": "The Knight of Wands shows a knight in armor riding a horse, representing energy, passion, and adventure.",
    "cardUprightMeaning": "Energy, passion, adventure, impulsiveness, travel.",
    "cardReverseMeaning": "Haste, scattered energy, delays, frustration.",
    "imageFileName": "Wands12",
    "prominentSymbols": ["knight", "horse", "armor", "wands"],
    "prominentColors": ["red", "yellow", "green", "blue"]
  },
  {
    "cardName": "Queen of Wands",
    "arcana": "Minor",
    "suit": "Wands",
    "cardDescription": "The Queen of Wands sits on her throne, holding a wand and a sunflower, embodying confidence, warmth, and determination.",
    "cardUprightMeaning": "Confidence, warmth, determination, vibrancy, independence.",
    "cardReverseMeaning": "Overbearing, demanding, jealousy, deceit.",
    "imageFileName": "Wands13",
    "prominentSymbols": ["queen", "throne", "sunflower", "lion"],
    "prominentColors": ["yellow", "red", "green", "orange"]
  },
  {
    "cardName": "King of Wands",
    "arcana": "Minor",
    "suit": "Wands",
    "cardDescription": "The King of Wands is a natural leader, depicted on his throne, which is adorned with lions and salamanders, symbolizing strength and transformation.",
    "cardUprightMeaning": "Natural leader, vision, entrepreneur, honor, force of nature.",
    "cardReverseMeaning": "Impulsiveness, overbearing, unrealistic expectations, tyranny.",
    "imageFileName": "Wands14",
    "prominentSymbols": ["king", "throne", "lion", "salamander"],
    "prominentColors": ["orange", "yellow", "red", "green"]
  },
  {
    "cardName": "Ace of Cups",
    "number": 1,
    "arcana": "Minor",
    "suit": "Cups",
    "cardDescription": "The Ace of Cups depicts a hand holding a cup overflowing with water, symbolizing new beginnings, emotional fulfillment, and intuition.",
    "cardUprightMeaning": "New beginnings, emotional fulfillment, intuition, creativity.",
    "cardReverseMeaning": "Emotional loss, blocked creativity, emptiness, unfulfilled love.",
    "imageFileName": "Cups01",
    "prominentSymbols": ["hand", "overflowing cup", "water", "dove"],
    "prominentColors": ["blue", "white", "yellow", "green"]
  },
  {
    "cardName": "Two of Cups",
    "number": 2,
    "arcana": "Minor",
    "suit": "Cups",
    "cardDescription": "The Two of Cups shows two people exchanging cups, symbolizing partnership, unity, and emotional connection.",
    "cardUprightMeaning": "Partnership, unity, emotional connection, mutual attraction.",
    "cardReverseMeaning": "Miscommunication, breakups, imbalance, tension in relationships.",
    "imageFileName": "Cups02",
    "prominentSymbols": [
      "two people",
      "exchange of cups",
      "caduceus",
      "lion's head"
    ],
    "prominentColors": ["red", "blue", "yellow", "green"]
  },
  {
    "cardName": "Three of Cups",
    "number": 3,
    "arcana": "Minor",
    "suit": "Cups",
    "cardDescription": "The Three of Cups depicts three people celebrating together, symbolizing friendship, community, and joy.",
    "cardUprightMeaning": "Friendship, community, celebration, collaboration, joy.",
    "cardReverseMeaning": "Overindulgence, gossip, isolation, conflicts in friendship.",
    "imageFileName": "Cups03",
    "prominentSymbols": ["three people", "celebration", "cups", "fruit"],
    "prominentColors": ["yellow", "green", "red", "blue"]
  },
  {
    "cardName": "Four of Cups",
    "number": 4,
    "arcana": "Minor",
    "suit": "Cups",
    "cardDescription": "The Four of Cups shows a figure contemplating three cups while a fourth is offered. It represents contemplation, apathy, and missed opportunities.",
    "cardUprightMeaning": "Contemplation, apathy, missed opportunities, dissatisfaction.",
    "cardReverseMeaning": "New opportunities, reevaluation, newfound interest, overcoming apathy.",
    "imageFileName": "Cups04",
    "prominentSymbols": ["figure", "three cups", "offered cup", "tree"],
    "prominentColors": ["blue", "green", "yellow", "red"]
  },
  {
    "cardName": "Five of Cups",
    "number": 5,
    "arcana": "Minor",
    "suit": "Cups",
    "cardDescription": "The Five of Cups shows a figure mourning over three spilled cups, unaware of two upright cups behind them. It symbolizes loss, regret, and focusing on the negative.",
    "cardUprightMeaning": "Loss, regret, disappointment, focusing on the negative, sadness.",
    "cardReverseMeaning": "Acceptance, moving on, finding peace, forgiveness, hope.",
    "imageFileName": "Cups05",
    "prominentSymbols": [
      "figure in cloak",
      "spilled cups",
      "upright cups",
      "river"
    ],
    "prominentColors": ["black", "blue", "red", "green"]
  },
  {
    "cardName": "Six of Cups",
    "number": 6,
    "arcana": "Minor",
    "suit": "Cups",
    "cardDescription": "The Six of Cups depicts two children sharing cups filled with flowers, symbolizing nostalgia, innocence, and childhood memories.",
    "cardUprightMeaning": "Nostalgia, innocence, childhood memories, joy, simplicity.",
    "cardReverseMeaning": "Stuck in the past, naivety, unrealistic, growing up, letting go of the past.",
    "imageFileName": "Cups06",
    "prominentSymbols": [
      "two children",
      "cups with flowers",
      "village",
      "guard"
    ],
    "prominentColors": ["yellow", "green", "blue", "red"]
  },
  {
    "cardName": "Seven of Cups",
    "number": 7,
    "arcana": "Minor",
    "suit": "Cups",
    "cardDescription": "The Seven of Cups shows a figure facing a cloud of cups filled with various symbols, representing choices, illusions, and imagination.",
    "cardUprightMeaning": "Choices, illusions, imagination, fantasy, wishful thinking.",
    "cardReverseMeaning": "Clarity, decision-making, seeing through illusions, reality.",
    "imageFileName": "Cups07",
    "prominentSymbols": ["figure", "cloud of cups", "various symbols", "mist"],
    "prominentColors": ["blue", "yellow", "red", "green"]
  },
  {
    "cardName": "Eight of Cups",
    "number": 8,
    "arcana": "Minor",
    "suit": "Cups",
    "cardDescription": "The Eight of Cups depicts a figure walking away from a stack of cups, symbolizing moving on, letting go, and seeking deeper meaning.",
    "cardUprightMeaning": "Moving on, letting go, seeking deeper meaning, disillusionment.",
    "cardReverseMeaning": "Stagnation, fear of change, clinging to the past, indecision.",
    "imageFileName": "Cups08",
    "prominentSymbols": ["walking figure", "stack of cups", "moon", "river"],
    "prominentColors": ["blue", "brown", "yellow", "red"]
  },
  {
    "cardName": "Nine of Cups",
    "number": 9,
    "arcana": "Minor",
    "suit": "Cups",
    "cardDescription": "The Nine of Cups shows a figure sitting in front of a row of cups, symbolizing contentment, satisfaction, and emotional fulfillment.",
    "cardUprightMeaning": "Contentment, satisfaction, emotional fulfillment, gratitude, wish fulfillment.",
    "cardReverseMeaning": "Dissatisfaction, materialism, smugness, unfulfilled wishes.",
    "imageFileName": "Cups09",
    "prominentSymbols": ["seated figure", "row of cups", "curtained backdrop"],
    "prominentColors": ["blue", "yellow", "red", "white"]
  },
  {
    "cardName": "Ten of Cups",
    "number": 10,
    "arcana": "Minor",
    "suit": "Cups",
    "cardDescription": "The Ten of Cups depicts a happy family with a rainbow of cups in the sky, symbolizing harmony, joy, and emotional contentment.",
    "cardUprightMeaning": "Harmony, joy, family happiness, emotional contentment, fulfillment.",
    "cardReverseMeaning": "Broken family, disharmony, lack of emotional connection, disillusionment.",
    "imageFileName": "Cups10",
    "prominentSymbols": [
      "happy family",
      "rainbow of cups",
      "home",
      "green landscape"
    ],
    "prominentColors": ["blue", "green", "yellow", "red"]
  },
  {
    "cardName": "Page of Cups",
    "arcana": "Minor",
    "suit": "Cups",
    "cardDescription": "The Page of Cups shows a young figure holding a cup with a fish in it, symbolizing curiosity, creativity, and emotional beginnings.",
    "cardUprightMeaning": "Curiosity, creativity, emotional beginnings, intuition, new opportunities.",
    "cardReverseMeaning": "Emotional immaturity, creative blocks, moodiness, insecurity.",
    "imageFileName": "Cups11",
    "prominentSymbols": [
      "young figure",
      "cup with fish",
      "waves",
      "floral hat"
    ],
    "prominentColors": ["blue", "yellow", "pink", "white"]
  },
  {
    "cardName": "Knight of Cups",
    "arcana": "Minor",
    "suit": "Cups",
    "cardDescription": "The Knight of Cups rides gracefully on a horse, holding a cup, symbolizing charm, romance, and a quest for emotional fulfillment.",
    "cardUprightMeaning": "Charm, romance, idealism, artistic, following the heart.",
    "cardReverseMeaning": "Moodiness, disillusionment, unrealistic expectations, jealousy.",
    "imageFileName": "Cups12",
    "prominentSymbols": ["knight", "horse", "cup", "river"],
    "prominentColors": ["blue", "yellow", "red", "white"]
  },
  {
    "cardName": "Queen of Cups",
    "arcana": "Minor",
    "suit": "Cups",
    "cardDescription": "The Queen of Cups sits on a throne by the sea, holding an ornate cup. She symbolizes compassion, intuition, and emotional security.",
    "cardUprightMeaning": "Compassion, intuition, emotional security, nurturing, empathy.",
    "cardReverseMeaning": "Emotional insecurity, codependency, manipulation, moodiness.",
    "imageFileName": "Cups13",
    "prominentSymbols": ["queen", "throne", "ornate cup", "sea"],
    "prominentColors": ["blue", "yellow", "red", "white"]
  },
  {
    "cardName": "King of Cups",
    "arcana": "Minor",
    "suit": "Cups",
    "cardDescription": "The King of Cups sits on a throne surrounded by water, holding a cup and a scepter. He represents emotional balance, diplomacy, and wisdom.",
    "cardUprightMeaning": "Emotional balance, diplomacy, wisdom, calmness, fairness.",
    "cardReverseMeaning": "Emotional manipulation, volatility, detachment, moodiness.",
    "imageFileName": "Cups14",
    "prominentSymbols": ["king", "throne", "cup", "scepter", "water"],
    "prominentColors": ["blue", "yellow", "red", "green"]
  },
  {
    "cardName": "Ace of Swords",
    "number": 1,
    "arcana": "Minor",
    "suit": "Swords",
    "cardDescription": "The Ace of Swords depicts a hand holding a sword upright, symbolizing clarity, breakthroughs, and new ideas.",
    "cardUprightMeaning": "Clarity, breakthroughs, new ideas, mental clarity, truth.",
    "cardReverseMeaning": "Confusion, misinformation, lack of clarity, indecision.",
    "imageFileName": "Swords01",
    "prominentSymbols": ["hand", "upright sword", "crown", "clouds"],
    "prominentColors": ["blue", "yellow", "gray", "white"]
  },
  {
    "cardName": "Two of Swords",
    "number": 2,
    "arcana": "Minor",
    "suit": "Swords",
    "cardDescription": "The Two of Swords shows a blindfolded figure holding two crossed swords, symbolizing indecision, stalemate, and blocked emotions.",
    "cardUprightMeaning": "Indecision, stalemate, blocked emotions, denial, truce.",
    "cardReverseMeaning": "Clarity, decision-making, resolution of conflict, openness.",
    "imageFileName": "Swords02",
    "prominentSymbols": ["blindfolded figure", "crossed swords", "moon", "sea"],
    "prominentColors": ["blue", "white", "gray", "black"]
  },
  {
    "cardName": "Three of Swords",
    "number": 3,
    "arcana": "Minor",
    "suit": "Swords",
    "cardDescription": "The Three of Swords depicts a heart pierced by three swords, representing heartbreak, sorrow, and betrayal.",
    "cardUprightMeaning": "Heartbreak, sorrow, betrayal, loss, painful separation.",
    "cardReverseMeaning": "Healing, reconciliation, forgiveness, release of pain.",
    "imageFileName": "Swords03",
    "prominentSymbols": ["pierced heart", "three swords", "clouds", "rain"],
    "prominentColors": ["red", "gray", "black", "blue"]
  },
  {
    "cardName": "Four of Swords",
    "number": 4,
    "arcana": "Minor",
    "suit": "Swords",
    "cardDescription": "The Four of Swords shows a figure lying in repose, with swords hanging above. It represents rest, recovery, and contemplation.",
    "cardUprightMeaning": "Rest, recovery, contemplation, meditation, peace.",
    "cardReverseMeaning": "Exhaustion, burnout, stress, restlessness, lack of progress.",
    "imageFileName": "Swords04",
    "prominentSymbols": [
      "reposing figure",
      "hanging swords",
      "stained glass window"
    ],
    "prominentColors": ["blue", "yellow", "gray", "red"]
  },
  {
    "cardName": "Five of Swords",
    "number": 5,
    "arcana": "Minor",
    "suit": "Swords",
    "cardDescription": "The Five of Swords depicts a figure holding three swords while two others are discarded, symbolizing conflict, betrayal, and winning at all costs.",
    "cardUprightMeaning": "Conflict, betrayal, loss, winning at all costs, tension.",
    "cardReverseMeaning": "Reconciliation, making amends, past resentments, forgiveness.",
    "imageFileName": "Swords05",
    "prominentSymbols": ["smirking figure", "discarded swords", "stormy sky"],
    "prominentColors": ["gray", "blue", "yellow", "green"]
  },
  {
    "cardName": "Six of Swords",
    "number": 6,
    "arcana": "Minor",
    "suit": "Swords",
    "cardDescription": "The Six of Swords shows a figure being ferried across water, symbolizing transition, moving on, and finding solace.",
    "cardUprightMeaning": "Transition, moving on, finding solace, journey to a calmer place.",
    "cardReverseMeaning": "Stagnation, emotional baggage, unresolved issues, resistance to change.",
    "imageFileName": "Swords06",
    "prominentSymbols": [
      "boat",
      "figure with child",
      "six swords",
      "calm water"
    ],
    "prominentColors": ["blue", "gray", "yellow", "brown"]
  },
  {
    "cardName": "Seven of Swords",
    "number": 7,
    "arcana": "Minor",
    "suit": "Swords",
    "cardDescription": "The Seven of Swords depicts a figure sneaking away with five swords, leaving two behind, symbolizing deception, strategy, and evasion.",
    "cardUprightMeaning": "Deception, strategy, stealth, tactics, resourcefulness.",
    "cardReverseMeaning": "Coming clean, facing consequences, honesty, confession.",
    "imageFileName": "Swords07",
    "prominentSymbols": [
      "sneaky figure",
      "five swords",
      "two left behind",
      "camp"
    ],
    "prominentColors": ["yellow", "blue", "green", "red"]
  },
  {
    "cardName": "Eight of Swords",
    "number": 8,
    "arcana": "Minor",
    "suit": "Swords",
    "cardDescription": "The Eight of Swords shows a blindfolded figure surrounded by swords, symbolizing feeling trapped, restricted, and self-imposed limitations.",
    "cardUprightMeaning": "Feeling trapped, restricted, self-imposed limitations, victim mentality.",
    "cardReverseMeaning": "Self-liberation, release, overcoming obstacles, new perspective.",
    "imageFileName": "Swords08",
    "prominentSymbols": [
      "blindfolded figure",
      "eight swords",
      "water",
      "castle"
    ],
    "prominentColors": ["blue", "gray", "yellow", "brown"]
  },
  {
    "cardName": "Nine of Swords",
    "number": 9,
    "arcana": "Minor",
    "suit": "Swords",
    "cardDescription": "The Nine of Swords depicts a figure sitting up in bed, hands over their face, with nine swords on the wall, symbolizing worry, anxiety, and nightmares.",
    "cardUprightMeaning": "Worry, anxiety, nightmares, mental torment, guilt.",
    "cardReverseMeaning": "Release of worry, finding hope, overcoming fear, moving past guilt.",
    "imageFileName": "Swords09",
    "prominentSymbols": ["anguished figure", "nine swords", "darkness", "bed"],
    "prominentColors": ["blue", "gray", "yellow", "red"]
  },
  {
    "cardName": "Ten of Swords",
    "number": 10,
    "arcana": "Minor",
    "suit": "Swords",
    "cardDescription": "The Ten of Swords shows a figure lying face down with ten swords in their back, symbolizing betrayal, loss, and a need to let go.",
    "cardUprightMeaning": "Betrayal, loss, end of a cycle, backstabbing, need to let go.",
    "cardReverseMeaning": "Recovery, resilience, moving on, release of pain, forgiveness.",
    "imageFileName": "Swords10",
    "prominentSymbols": ["fallen figure", "ten swords", "dark sky", "dawn"],
    "prominentColors": ["black", "red", "yellow", "blue"]
  },
  {
    "cardName": "Page of Swords",
    "arcana": "Minor",
    "suit": "Swords",
    "cardDescription": "The Page of Swords shows a young figure holding a sword, symbolizing curiosity, mental agility, and a thirst for knowledge.",
    "cardUprightMeaning": "Curiosity, mental agility, thirst for knowledge, new ideas, vigilance.",
    "cardReverseMeaning": "Deception, manipulation, gossip, lack of planning, hasty decisions.",
    "imageFileName": "Swords11",
    "prominentSymbols": ["young figure", "sword", "windy clouds", "birds"],
    "prominentColors": ["yellow", "blue", "green", "red"]
  },
  {
    "cardName": "Knight of Swords",
    "arcana": "Minor",
    "suit": "Swords",
    "cardDescription": "The Knight of Swords depicts a knight charging forward on a horse, symbolizing action, ambition, and a pursuit of truth.",
    "cardUprightMeaning": "Action, ambition, pursuit of truth, assertiveness, directness.",
    "cardReverseMeaning": "Impulsiveness, haste, disregard for consequences, aggression, recklessness.",
    "imageFileName": "Swords12",
    "prominentSymbols": ["charging knight", "horse", "sword", "stormy sky"],
    "prominentColors": ["blue", "yellow", "white", "red"]
  },
  {
    "cardName": "Queen of Swords",
    "arcana": "Minor",
    "suit": "Swords",
    "cardDescription": "The Queen of Swords sits on her throne, holding a sword upright, symbolizing clarity, independence, and unbiased judgment.",
    "cardUprightMeaning": "Clarity, independence, unbiased judgment, direct communication, perception.",
    "cardReverseMeaning": "Coldness, bitterness, harsh criticism, deceit, manipulation.",
    "imageFileName": "Swords13",
    "prominentSymbols": ["queen", "upright sword", "throne", "clouds"],
    "prominentColors": ["blue", "yellow", "white", "red"]
  },
  {
    "cardName": "King of Swords",
    "arcana": "Minor",
    "suit": "Swords",
    "cardDescription": "The King of Swords sits on his throne, holding a sword upright, representing intellectual power, authority, and truth.",
    "cardUprightMeaning": "Intellectual power, authority, truth, fairness, clarity.",
    "cardReverseMeaning": "Manipulation, tyranny, abuse of power, cunning, coldness.",
    "imageFileName": "Swords14",
    "prominentSymbols": ["king", "upright sword", "throne", "butterfly"],
    "prominentColors": ["blue", "yellow", "white", "green"]
  },
  {
    "cardName": "Ace of Pentacles",
    "number": 1,
    "arcana": "Minor",
    "suit": "Pentacles",
    "cardDescription": "The Ace of Pentacles depicts a hand holding a pentacle, symbolizing new opportunities, abundance, and financial stability.",
    "cardUprightMeaning": "New opportunities, abundance, financial stability, prosperity, security.",
    "cardReverseMeaning": "Missed opportunities, lack of planning, financial loss, instability.",
    "imageFileName": "Pents01",
    "prominentSymbols": ["hand", "pentacle", "garden", "archway"],
    "prominentColors": ["green", "yellow", "blue", "brown"]
  },
  {
    "cardName": "Two of Pentacles",
    "number": 2,
    "arcana": "Minor",
    "suit": "Pentacles",
    "cardDescription": "The Two of Pentacles shows a figure juggling two pentacles, symbolizing balance, adaptability, and time management.",
    "cardUprightMeaning": "Balance, adaptability, time management, prioritization, flexibility.",
    "cardReverseMeaning": "Imbalance, disorganization, financial stress, overwhelm.",
    "imageFileName": "Pents02",
    "prominentSymbols": [
      "juggling figure",
      "two pentacles",
      "infinity symbol",
      "waves"
    ],
    "prominentColors": ["yellow", "blue", "green", "red"]
  },
  {
    "cardName": "Three of Pentacles",
    "number": 3,
    "arcana": "Minor",
    "suit": "Pentacles",
    "cardDescription": "The Three of Pentacles depicts a craftsman working on a cathedral, symbolizing collaboration, skill, and quality work.",
    "cardUprightMeaning": "Collaboration, skill, quality work, teamwork, planning.",
    "cardReverseMeaning": "Lack of teamwork, disregard for skills, poor quality, conflict.",
    "imageFileName": "Pents03",
    "prominentSymbols": [
      "craftsman",
      "cathedral",
      "three pentacles",
      "blueprint"
    ],
    "prominentColors": ["yellow", "red", "blue", "gray"]
  },
  {
    "cardName": "Four of Pentacles",
    "number": 4,
    "arcana": "Minor",
    "suit": "Pentacles",
    "cardDescription": "The Four of Pentacles shows a figure holding onto four pentacles, symbolizing security, control, and possessiveness.",
    "cardUprightMeaning": "Security, control, stability, possessiveness, saving.",
    "cardReverseMeaning": "Greed, materialism, insecurity, letting go, spending.",
    "imageFileName": "Pents04",
    "prominentSymbols": [
      "holding pentacles",
      "city",
      "throne",
      "foot on pentacle"
    ],
    "prominentColors": ["yellow", "red", "blue", "green"]
  },
  {
    "cardName": "Five of Pentacles",
    "number": 5,
    "arcana": "Minor",
    "suit": "Pentacles",
    "cardDescription": "The Five of Pentacles depicts two figures in the snow outside a stained glass window, symbolizing hardship, loss, and feeling left out in the cold.",
    "cardUprightMeaning": "Hardship, loss, financial struggle, isolation, insecurity.",
    "cardReverseMeaning": "Recovery, regaining stability, re-entering society, overcoming adversity.",
    "imageFileName": "Pents05",
    "prominentSymbols": [
      "two figures",
      "snow",
      "stained glass window",
      "crutches"
    ],
    "prominentColors": ["blue", "yellow", "red", "white"]
  },
  {
    "cardName": "Six of Pentacles",
    "number": 6,
    "arcana": "Minor",
    "suit": "Pentacles",
    "cardDescription": "The Six of Pentacles shows a figure distributing coins to the needy, symbolizing generosity, charity, and balance in financial matters.",
    "cardUprightMeaning": "Generosity, charity, balance, sharing wealth, fairness.",
    "cardReverseMeaning": "Selfishness, debt, one-sided charity, strings attached, inequality.",
    "imageFileName": "Pents06",
    "prominentSymbols": [
      "giving figure",
      "two recipients",
      "scales",
      "six pentacles"
    ],
    "prominentColors": ["yellow", "red", "blue", "green"]
  },
  {
    "cardName": "Seven of Pentacles",
    "number": 7,
    "arcana": "Minor",
    "suit": "Pentacles",
    "cardDescription": "The Seven of Pentacles shows a figure contemplating the fruits of their labor, symbolizing patience, investment, and delayed gratification.",
    "cardUprightMeaning": "Patience, investment, delayed gratification, long-term view, perseverance.",
    "cardReverseMeaning": "Impatience, lack of long-term vision, limited success, dissatisfaction.",
    "imageFileName": "Pents07",
    "prominentSymbols": [
      "contemplating figure",
      "seven pentacles",
      "plants",
      "shovel"
    ],
    "prominentColors": ["green", "yellow", "red", "brown"]
  },
  {
    "cardName": "Eight of Pentacles",
    "number": 8,
    "arcana": "Minor",
    "suit": "Pentacles",
    "cardDescription": "The Eight of Pentacles depicts a craftsman working on his craft, symbolizing dedication, skill development, and attention to detail.",
    "cardUprightMeaning": "Dedication, skill development, attention to detail, craftsmanship, pride in work.",
    "cardReverseMeaning": "Lack of focus, perfectionism, not applying skills, work without reward.",
    "imageFileName": "Pents08",
    "prominentSymbols": ["craftsman", "eight pentacles", "workbench", "tools"],
    "prominentColors": ["yellow", "red", "green", "blue"]
  },
  {
    "cardName": "Nine of Pentacles",
    "number": 9,
    "arcana": "Minor",
    "suit": "Pentacles",
    "cardDescription": "The Nine of Pentacles shows a figure in a lush garden, surrounded by pentacles, symbolizing abundance, luxury, and self-sufficiency.",
    "cardUprightMeaning": "Abundance, luxury, self-sufficiency, financial independence, success.",
    "cardReverseMeaning": "Financial dependency, lack of discipline, overspending, loneliness.",
    "imageFileName": "Pents09",
    "prominentSymbols": [
      "figure in garden",
      "nine pentacles",
      "bird of prey",
      "grapes"
    ],
    "prominentColors": ["green", "yellow", "red", "blue"]
  },
  {
    "cardName": "Ten of Pentacles",
    "number": 10,
    "arcana": "Minor",
    "suit": "Pentacles",
    "cardDescription": "The Ten of Pentacles depicts a family and a patriarch, surrounded by wealth, symbolizing legacy, long-term success, and family support.",
    "cardUprightMeaning": "Legacy, long-term success, wealth, family support, inheritance.",
    "cardReverseMeaning": "Financial failure, instability, broken family, fleeting success.",
    "imageFileName": "Pents10",
    "prominentSymbols": ["family", "patriarch", "ten pentacles", "archway"],
    "prominentColors": ["yellow", "red", "green", "blue"]
  },
  {
    "cardName": "Page of Pentacles",
    "arcana": "Minor",
    "suit": "Pentacles",
    "cardDescription": "The Page of Pentacles shows a young figure holding a pentacle, symbolizing curiosity, new opportunities, and the desire to learn.",
    "cardUprightMeaning": "Curiosity, new opportunities, desire to learn, ambition, diligence.",
    "cardReverseMeaning": "Lack of progress, procrastination, financial irresponsibility, missed opportunities.",
    "imageFileName": "Pents11",
    "prominentSymbols": ["young figure", "pentacle", "field", "mountains"],
    "prominentColors": ["green", "yellow", "blue", "brown"]
  },
  {
    "cardName": "Knight of Pentacles",
    "arcana": "Minor",
    "suit": "Pentacles",
    "cardDescription": "The Knight of Pentacles sits on a stationary horse, holding a pentacle, symbolizing reliability, patience, and a methodical approach.",
    "cardUprightMeaning": "Reliability, patience, methodical approach, hard work, dedication.",
    "cardReverseMeaning": "Stagnation, laziness, inflexibility, lack of innovation, boredom.",
    "imageFileName": "Pents12",
    "prominentSymbols": [
      "knight",
      "stationary horse",
      "pentacle",
      "plowed field"
    ],
    "prominentColors": ["green", "yellow", "brown", "blue"]
  },
  {
    "cardName": "Queen of Pentacles",
    "arcana": "Minor",
    "suit": "Pentacles",
    "cardDescription": "The Queen of Pentacles sits on her throne surrounded by nature, holding a pentacle, symbolizing nurture, practicality, and a love for the natural world.",
    "cardUprightMeaning": "Nurture, practicality, security, love for nature, generosity.",
    "cardReverseMeaning": "Financial independence, self-care, practicality, luxury.",
    "imageFileName": "Pents13",
    "prominentSymbols": ["queen", "throne", "pentacle", "garden", "rabbit"],
    "prominentColors": ["green", "yellow", "red", "blue"]
  },
  {
    "cardName": "King of Pentacles",
    "arcana": "Minor",
    "suit": "Pentacles",
    "cardDescription": "The King of Pentacles sits on his throne adorned with vines, holding a scepter and a pentacle, representing wealth, stability, and leadership.",
    "cardUprightMeaning": "Wealth, stability, leadership, security, discipline.",
    "cardReverseMeaning": "Greed, materialism, stagnation, obsession with wealth, stubbornness.",
    "imageFileName": "Pents14",
    "prominentSymbols": ["king", "throne", "scepter", "pentacle", "bull"],
    "prominentColors": ["green", "yellow", "red", "blue"]
  }
]
