[
    {
        "deckName": "Rider Waite Smith Tarot Deck",
        "deckCreators": ["A.E. Waite", "Pamela Colman Smith"],
        "deckDescription": "The Rider-Waite tarot deck, created in 1909 by Arthur Edward Waite and illustrated by Pamela Colman Smith, is a seminal work in the tarot tradition. Renowned for its rich symbolism and detailed imagery, the deck draws on various esoteric traditions to provide depth and insight into readings. As one of the most popular and influential tarot decks, the Rider-Waite has shaped the practice of tarot reading and remains a beloved tool for divination and personal reflection. Now in the public domain, its timeless images continue to inspire seekers around the world.",
        "cardSeeds": "RWSCardSeeds.json"
    },
    {
        "deckName": "Eclipse of the Soul Tarot",
        "deckCreators": ["Andrea Presto", "Christi Tugwell", "Joseph Picardat"],
        "deckDescription": "The \"Eclipse of the Soul\" tarot deck invites you on an extraordinary journey. Unlike traditional tarot decks, here you are the traveler, venturing through a lost realm. As you draw cards and uncover their meanings, imagine yourself physically traversing this land, each step, a step towards unlocking the secrets within your own soul… \n\nVenture into the shadowed beauty of the \"Eclipse of the Soul\" tarot deck. This unique collection eschews traditional numbering, crafting an evocative story that echoes through the arcana. Each somberly hued image weaves a tale of sorrowful grace, inviting you on a journey of cycles, not linear paths. \n\n\"Eclipse of the Soul\" is a tarot deck for those who find beauty in the forgotten and who are unafraid to delve into the depths of the self. It is for the seekers of truth who know that sometimes, it is only through acknowledging our darkest hours that we may truly appreciate the light. This deck does not merely predict but illuminates, guiding you through the shadows with a compassionate embrace of life's inherent contrasts. \n\nImmerse yourself in the \"Eclipse of the Soul\" tarot deck. Each draw reveals a chapter in the hauntingly beautiful narrative of your own journey—a celebration of life's macabre dance.",
        "cardSeeds": "EotScardSeeds.json"
    }
]
