[
    {
        "spreadName": "Self Awareness Spread",
        "spreadDescription": "There are many three card spreads as it is an extremely versitile layout lending itself to self-discovery, introspection, and personal growth. With this one we're focusing on who we are as a person. The three positions represent the questions \"Who am I?\", \"Who do I want to be?\", and finally, \"How do I get there?\"",
        "numCards": 3,
        "positions": [
            {
                "positionNumber": 1,
                "positionDescription": "left of center",
                "positionDetails": "Who am I?"
            },
            {
                "positionNumber": 2,
                "positionDescription": "center",
                "positionDetails": "Who do I want to be?"
            },
            {
                "positionNumber": 3,
                "positionDescription": "right of center",
                "positionDetails": "How do I get there?"
            }
        ],
        "spreadTips": [
            "Center yourself and focus on your question or intention.",
            "Pay attention to your intuition as each card is revealed.",
            "\"Who am I?\": Reflect on the card's representation of your current state.",
            "\"Who do I want to be?\": Consider the card as a goal or aspiration.",
            "\"How do I get there?\": Look for guidance on aligning with your desired self."
        ],
        "tags": ["Personal Growth", "Self-Awareness Journey", "Identity"]
    },
    {
        "spreadName": "Deck Intervew Spread",
        "spreadDescription": "The Deck Interview Spread is used to establish a connection with a new tarot deck and understand its unique characteristics, strengths, limitations, and potential for collaboration. This spread can provide insights into how to best work with the deck and what it has to offer.",
        "numCards": "6",
        "positions": [
            {
                "positionNumber": 1,
                "positionDescription": "top right",
                "positionDetails": "What is your most important characteristic?"
            },
            {
                "positionNumber": 2,
                "positionDescription": "bottom right",
                "positionDetails": "What are your strengths as a deck?"
            },
            {
                "positionNumber": 3,
                "positionDescription": "bottom center",
                "positionDetails": "What are your limits as a deck?"
            },
            {
                "positionNumber": 4,
                "positionDescription": "bottom left",
                "positionDetails": "What are you here to teach me?"
            },
            {
                "positionNumber": 5,
                "positionDescription": "top left",
                "positionDetails": "How can I best learn and collaborate with you?"
            },
            {
                "positionNumber": 6,
                "positionDescription": "top center",
                "positionDetails": "What is the potential outcome of our working relationship?"
            }
        ],
        "spreadTips": [
            "Center yourself and focus on your question or intention.",
            "Pay attention to your intuition as each card is revealed.",
            "\"What is your most important characteristic?\" Pay attention to any symbolism or messages that stand out in the card.",
            "\"What are your strengths as a deck?\" Can reveal the unique qualities or strengths of the deck in readings.",
            "\"What are your limits as a deck?\" May indicate any challenges or limitations you may encounter when using the deck.",
            "\"What are you here to teach me?\" Offers insights into the wisdom or lessons the deck can impart.",
            "\"How can I best learn and collaborate with you?\" Provides guidance on how to effectively work with the deck and interpret its messages.",
            "\"What is the potential outcome of our working relationship?\" Offers a glimpse into the potential outcomes or benefits of using the deck for readings."
        ],
        "tags": ["Deck Interview", "Deck Characteristics", "New Deck Connection", "Deck Relationship"]
    },
    {
        "spreadName": "Daily Focus",
        "spreadDescription": "The Daily Focus spread consists of a single card drawn each day to provide insight and guidance for the day ahead.",
        "numCards": "1",
        "positions": [
            {
                "positionNumber": 1,
                "positionDescription": "center",
                "positionDetails": "What should I focus on today?"
            }
        ],
        "spreadTips": [
            "Establish a daily ritual for drawing and reflecting on the card, such as drawing the card at the same time each day and journaling about its relevance to your day ahead. This practice can help you stay consistent and derive greater insights from the daily card."
        ],
        "tags": ["Daily Reading", "Focus", "Guidance", "Insight"]
    }
]
